{"sector":{"0":"Industrials"},"longName":{"0":"3M India Limited"},"fullTimeEmployees":{"0":1132},"longBusinessSummary":{"0":"3M India Limited engages in the manufacture and trade of various products for health care, manufacturing, automotive, safety, electronics, energy, commercial solutions, transportation, and design and construction industries in India. The company operates through four segments: Safety and Industrial, Health Care, Transportation and Electronics, and Consumer. The Safety and Industrial segment offers vinyl, polyester, foil, and specialty industrial tapes and adhesives, such as scotch masking tapes, scotch filament and packaging tapes, functional and decorative graphics, abrasion-resistant films, masking tapes, and other specialty materials. This segment serves industrial, electrical, vehicle maintenance, and safety markets. The Health Care segment provides medical and surgical supplies; medical devices; skin and wound care, as well as infection prevention products and solutions; drug delivery systems; dental and orthodontic products; and food safety products. The Transportation and Electronics segment offers personal protection products, brand and asset protection solutions, border control products, passive fire protection products for industries and commercial establishments, track and trace products, and cleaning and hygiene products for the hospitality industry, as well as traffic signs, and pavement marking and vehicle registration products and services; films, inks, and digital signage products; wall and glass cladding products; and projection systems, computer and ATM-screen privacy filters, and brightness enhancement films. The Consumer segment provides home and office tapes, adhesives, and packaging protection platforms under the Scotch brand; note pads, dispensers, flagging solution, and labels under the Post-it brand; and stain protection products under the Scotchguard brand. It also exports its products. The company was incorporated in 1987 and is based in Bengaluru, India. 3M India Limited is a subsidiary of 3M Company."},"city":{"0":"Bengaluru"},"phone":{"0":"91 80 2223 1414"},"website":{"0":"https:\/\/www.3mindia.in"},"grossProfits":{"0":12302006000},"totalCash":{"0":14203784192},"totalDebt":{"0":221336992},"totalRevenue":{"0":36721680384},"totalCashPerShare":{"0":1260.821},"revenuePerShare":{"0":3259.784},"bookValue":{"0":2107.942},"priceToBook":{"0":10.409727},"marketCap":{"0":247300931584},"averageVolume":{"0":3409},"fiftyTwoWeekHigh":{"0":26943},"fiftyTwoWeekLow":{"0":17273},"logo_url":{"0":"https:\/\/logo.clearbit.com\/3mindia.in"}}