{"sector":{"0":"Healthcare"},"longName":{"0":"Aarti Drugs Limited"},"fullTimeEmployees":{"0":1450},"longBusinessSummary":{"0":"Aarti Drugs Limited, through its subsidiaries, engages in the pharmaceuticals business in India and internationally. The company offers active pharmaceutical ingredients in various therapeutic categories, including anti-inflammatory, cardioprotectants, antidiarrhoeals, antifungals, antiarthritis\/osteoporosis, antibiotics, antidiabetics, Alzheimer's treatment, sedatives, vitamins, and alcoholism treatment; and pharmaceutical intermediate products comprising tinidazole, celecoxib, ciprofloxacin, clopidogrel, diclofenac, ketoconazole, nimesulide, and raloxifene. It also offers specialty chemical products, such as benzene sulphonamide, benzene sulphonic acid, benzene sulphonic acid methyl ester, benzene sulphonyl chloride, cipro Q acid, levofloxacin Q acid, methyl nicotinate, N-methyl methane sulphonamide, diphenyl sulphone, norofloxacin Q acid, ofloxacin Q acid, ortho para toluene sulphonamide, ortho\/para toluene sulphonic acid methyl ester, para chloro benzene sulphonamide, para chloro benzene sulphonyl chloride, para toluene sulphonamide, para toluene sulphonic acid methyl ester, para toluene sulphonyl chloride, and sodium benezene sulfinate, as well as para toluene sulphonyl hydrazide and benzene sulphonic acid and sodium salt; and benzyl nicotinate, bisphenol \u0096 C, bisphenol \u0096 C(chloride), ethyl nicotinate, ethyl para toluene sulphonate, and N-methyl imidazole. In addition, the company's products under development comprise Acamprosate for alcoholism; Dabigatran for use as an anticoagulant; Sevelamer for antihyperphosphatemia; Colsevelam for anti-cholestrol treatment; Drondarone and Olmesartan for the treatment of cardiovascular diseases; Valasartan for use as cardiprotectant; and Sitagliptin for use as an antidiabetic. Further, it offers contract manufacturing services. The company was incorporated in 1984 and is headquartered in Mumbai, India."},"city":{"0":"Mumbai"},"phone":{"0":"91 22 2401 9025"},"website":{"0":"https:\/\/www.aartidrugs.co.in"},"grossProfits":{"0":7864951000},"totalCash":{"0":272300000},"totalDebt":{"0":5856000000},"totalRevenue":{"0":26387458048},"totalCashPerShare":{"0":2.941},"revenuePerShare":{"0":284.962},"bookValue":{"0":119.862},"priceToBook":{"0":3.838581},"marketCap":{"0":42605260800},"averageVolume":{"0":91612},"fiftyTwoWeekHigh":{"0":552.3},"fiftyTwoWeekLow":{"0":378},"logo_url":{"0":"https:\/\/logo.clearbit.com\/aartidrugs.co.in"}}