{"sector":{"0":"Financial Services"},"longName":{"0":"Aditya Birla Capital Limited"},"fullTimeEmployees":{"0":30905},"longBusinessSummary":{"0":"Aditya Birla Capital Limited, through its subsidiaries, provides various financial products and services in India and internationally. It operates through NBFC, Housing Finance, Life Insurance, Asset Management, General Insurance Broking, Stock and Securities Broking, Health Insurance, and Other Financial Services segments. The company offers protecting solutions, which include life, health, motor, and travel insurance; multiply wellness, and group and corporate general insurance; and investing solution, such as mutual funds, stocks and securities, wealth, portfolio management services, pension funds, and real estate investment. It also provides financing solutions comprising personal, home, small and medium-sized enterprise, and mortgage finance, as well as loan against securities; and debt capital markets and loan syndication services. In addition, the company offers asset management; and other financial services, such as depository, risk advisory, asset reconstruction, and other business support services. The company was formerly known as Aditya Birla Financial Services Limited and changed its name to Aditya Birla Capital Limited in June 2017. The company was incorporated in 2007 and is headquartered in Mumbai, India. Aditya Birla Capital Limited is a subsidiary of Grasim Industries Limited."},"city":{"0":"Mumbai"},"phone":{"0":"91 22 4356 7000"},"website":{"0":"https:\/\/www.adityabirlacapital.com"},"grossProfits":{"0":33794900000},"totalCash":{"0":25968300032},"totalDebt":{"0":684127617024},"totalRevenue":{"0":203222695936},"totalCashPerShare":{"0":10.744},"revenuePerShare":{"0":84.137},"bookValue":{"0":67.729},"priceToBook":{"0":2.2176616},"marketCap":{"0":363028873216},"averageVolume":{"0":4641684},"fiftyTwoWeekHigh":{"0":162.45},"fiftyTwoWeekLow":{"0":85.6},"logo_url":{"0":"https:\/\/logo.clearbit.com\/adityabirlacapital.com"}}