{"sector":{"0":"Consumer Cyclical"},"longName":{"0":"Aditya Birla Fashion and Retail Limited"},"fullTimeEmployees":{"0":24818},"longBusinessSummary":{"0":"Aditya Birla Fashion and Retail Limited designs, manufactures, distributes, and retails fashion apparel and accessories in India and internationally. It operates in two segments, Madura Fashion & Lifestyle, and Pantaloons. The company offers shirts, trousers, denims, t-shirts, dresses, suits and blazers, casuals, ceremonial, and party wear; shorts, joggers, track pants, sweatshirts, jackets, loungewear, biker t-shirts, polos, chinos, kurtas and bottom wear, occasion wear, festive ensembles, streetwear, classic shirts, logo T-shirts, casual pants, lehengas and kurta sets, ethnic bottom wear, athleisure wear, workwear, tops, sleepwear, crops tops, skirts, jeans, sportswear; accessories; and shawls, stoles, shoes, and lingerie, as well as home furnishings, footwear, handbags, bed linen, towels, smart table linen, dressy cushion covers, and others. It markets its products primarily under the Louis Philippe, Van Heusen, Allen Solly, and Peter England brands, as well as operates fashion store under the Pantaloons brand. The company also holds online and offline rights to the India network of California-based fashion brand Forever 21; and international brands portfolio, such as The Collective, Simon Carter, American Eagle, Ralph Lauren, Hackett London, Ted Baker, and Fred Perry. It operates 3091 brand stores and 377 Pantaloons stores, as well as 28,585 multi-brand outlets in approximately 900 cities in India. The company was formerly known as Pantaloons Fashion & Retail Limited and changed its name to Aditya Birla Fashion and Retail Limited in January 2016. Aditya Birla Fashion and Retail Limited was incorporated in 2007 and is based in Mumbai, India."},"city":{"0":"Mumbai"},"phone":{"0":"91 86 5290 5000"},"website":{"0":"https:\/\/www.abfrl.com"},"grossProfits":{"0":42255100000},"totalCash":{"0":11316200448},"totalDebt":{"0":46175698944},"totalRevenue":{"0":112193003520},"totalCashPerShare":{"0":12.01},"revenuePerShare":{"0":113.84},"bookValue":{"0":38.177},"priceToBook":{"0":7.5307126},"marketCap":{"0":272766205952},"averageVolume":{"0":2010495},"fiftyTwoWeekHigh":{"0":359.5},"fiftyTwoWeekLow":{"0":221.3},"logo_url":{"0":"https:\/\/logo.clearbit.com\/abfrl.com"}}