{"sector":{"0":"Energy"},"longName":{"0":"Adani Enterprises Limited"},"fullTimeEmployees":{"0":5051},"longBusinessSummary":{"0":"Adani Enterprises Limited, together with its subsidiaries, engages in the coal trading, coal mining, oil and gas exploration, ports, multi-modal logistics, power generation and transmission, gas distribution, and edible oil and agro commodities businesses in India and internationally. The company trades in coal; offers bunkering and integrated coal management services; imports fruits, apple, pear, kiwi, oranges, grapes, and other fruits; and markets its apple under the FARM-PIK brand. It is also involved in the mining, processing, acquisition, exploration, and development of various coal properties, including Parsa East and Kanta Basan coal block, Kente Extension coal block, Parsa coal block, and Gare Pelma sector III coal block; Talabira II and III coal block, and Suliyari coal block; a coal mining concession in Indonesia; and the Carmichael Coal mine in the Galilee Basin in Queensland, Australia, as well as solar PV panels manufacturing business. In addition, company offers edible oils, basmati rice, pulses, soya chunks, and besan and atta, as well as lauric and bakery fats, castor oil derivatives, oleo chemicals, and soya value added products under the Fortune, King's, Bullet, Raag, Avsar, Pilaf, Jubilee, Fryola, Alpha, Alife, and Aadhar brands. Further, it manufactures fighter aircraft, unmanned aerial systems, and helicopters, submarines, air defence guns, missiles and small arms; develops avionics and systems, opto-electronics, aero structures and components, aerospace composites, and radar and electronic warfare systems, as well as constructs national highways, expressways, tunnels, metro-rail, railways, etc. Additionally, it engages in the waste water treatment, recycle, and reuse business; mining of minerals and ores activities, as well as operates, manages, and develops airports; and builds data centers. The company was founded in 1988 and is headquartered in Ahmedabad, India. Adani Enterprises Limited operates as a subsidiary of S.B. Adani Family Trust."},"city":{"0":"Ahmedabad"},"phone":{"0":"91 79 2656 5555"},"website":{"0":"https:\/\/www.adanienterprises.com"},"grossProfits":{"0":157026800000},"totalCash":{"0":41111298048},"totalDebt":{"0":411908505600},"totalRevenue":{"0":1226428645376},"totalCashPerShare":{"0":36.122},"revenuePerShare":{"0":1099.732},"bookValue":{"0":277.232},"priceToBook":{"0":13.917405},"marketCap":{"0":4398518894592},"averageVolume":{"0":2177455},"fiftyTwoWeekHigh":{"0":4190},"fiftyTwoWeekLow":{"0":1528.8},"logo_url":{"0":"https:\/\/logo.clearbit.com\/adanienterprises.com"}}