{"sector":{"0":"Energy"},"longName":{"0":"Aegis Logistics Limited"},"fullTimeEmployees":{"0":462},"longBusinessSummary":{"0":"Aegis Logistics Limited, together with its subsidiaries, operates as an oil, gas, and chemical logistics company in the downstream oil and gas sector primarily in India. The company operates through Liquid Terminal Division and Gas Terminal Division segments. It owns and operates a network of shore based tank farm installations for the handling of bulk liquids, including hazardous chemicals, petroleum products, and petrochemicals for petroleum, oil, petrochemical, chemical, and vegetable oil industries, as well as sources and distributes LPG and propane. The company also offers supply chain management services, including product planning, sourcing, shipping, receipt, storage, and dispatch; product handling services; storage services for other related gases, such as Butene-1, Butadiene, Propylene, VCM etc.; energy solution to industries for their various applications; and turnkey solutions for conversions from other fuels\/energy sources, as well as supplies LPG, propane, and butane to various sectors, including steel, automotive, ceramics, glass, pharmaceuticals, aerosol, paper, and textile. In addition, it provides fuel transportation services; and LPG installation and interfuel conversion services for home, hotels, and industries, as well as offers LPG appliances, such as cooktops, pressure cooker, cookware, LPG iron-gasXpress, and LPG accessories. The company was incorporated in 1956 and is based in Mumbai, India."},"city":{"0":"Mumbai"},"phone":{"0":"91 22 6666 3666"},"website":{"0":"https:\/\/www.aegisindia.com"},"grossProfits":{"0":7406642000},"totalCash":{"0":13091600384},"totalDebt":{"0":15366400000},"totalRevenue":{"0":77036797952},"totalCashPerShare":{"0":37.288},"revenuePerShare":{"0":219.488},"bookValue":{"0":94.919},"priceToBook":{"0":3.6625965},"marketCap":{"0":122025148416},"averageVolume":{"0":1004255},"fiftyTwoWeekHigh":{"0":373.75},"fiftyTwoWeekLow":{"0":167.25},"logo_url":{"0":"https:\/\/logo.clearbit.com\/aegisindia.com"}}