{"sector":{"0":"Consumer Cyclical"},"longName":{"0":"Asahi India Glass Limited"},"fullTimeEmployees":{"0":2734},"longBusinessSummary":{"0":"Asahi India Glass Limited, an integrated glass and windows solutions company, manufactures and supplies various glass products in India and internationally. It operates in two segments, Automotive Glass and Float Glass. The company offers various automotive glass products, including laminated windshields, tempered glass for sidelites and backlites, defogger glasses, glass antennas, encapsulated glasses, plug-in windows, solar control glasses, IR and UV cut glasses, dark green UV cut glasses, rain sensor and wiper heated windshields, glasses with assembly, privacy glasses, acoustic windshields, IR cut and acoustic windshields, sliding windows for buses and trucks, thinner glazings, bullet resistant glasses, removed sunveil green glasses, head up display W\/S, and IGU for metro and railways. It also provides a range of architectural glass products, such as clear float, heat absorbing, solar control, patterned reflective, sunshield, patterned sunshield, ecosense, energy-efficient reflective, impact resistance, burglar resistant, sound resistant, valuglas, securityplus, insulated-glazed, heat-strengthened, swytchglas -electrochromatic, integrated blinds, pyrobel - fire retardant, and energy-efficient reflective glasses. In addition, the company offers uPVC and aluminum windows; designer glasses, such as back painted, frosted, mesh laminated, colored laminated, fabric laminated, printed, and acid etched glasses, as well as distortion-free mirrors, ceramic frit, and vibrant colors for interiors; and glass, window, and door solutions. Further, it provides automotive glass repair and replacement services. The company was incorporated in 1984 and is based in Gurugram, India."},"city":{"0":"Gurugram"},"phone":{"0":"91 12 4406 2212"},"website":{"0":"https:\/\/www.aisglass.com"},"grossProfits":{"0":21906600000},"totalCash":{"0":635699968},"totalDebt":{"0":11898300416},"totalRevenue":{"0":37070000128},"totalCashPerShare":{"0":2.618},"revenuePerShare":{"0":152.494},"bookValue":{"0":79.221},"priceToBook":{"0":6.6017847},"marketCap":{"0":127136071680},"averageVolume":{"0":127417},"fiftyTwoWeekHigh":{"0":694},"fiftyTwoWeekLow":{"0":381},"logo_url":{"0":"https:\/\/logo.clearbit.com\/aisglass.com"}}