{"sector":{"0":"Industrials"},"longName":{"0":"Astral Limited"},"fullTimeEmployees":{"0":6000},"longBusinessSummary":{"0":"Astral Limited, together with its subsidiaries, manufactures and markets pipes, water tanks, and adhesives and sealants in India and internationally. The company operates in Plastic and Adhesives segments. It offers chlorinated poly vinyl chloride (CPVC) and plumbing systems under the Astral CPVC Pro, Astral Pex-a PRO, Astral MultiPro, Astral EcoPro, and Astral Aquarius names for residential and industrial applications. It also provides ASTRAL Silencio low noise system; Astral DrainMaster, a drainage system; ASTRAL Foamcore pipes for underground systems; ASTRAL DrainHulk manhole drainage chambers; ASTRAL Underground drainage systems; and D-Rex double walled corrugated pipes. In addition, the company offers ASTRAL Chem PRO industrial piping systems; and Aquarius Plus uPVC industrial piping systems. Further, it provides Pre-StiRex and Plus + StiRex ducts for post-tensioning of bridges; Bore-Well column pipes, Case-Well uPVC casing pipes, Aquasafe agriculture pressure pipes, and GeoRex s perforated sub-surface drainage for agriculture; ASTRAL high density poly ethylene pipes; Astral Fire Pro, a CPVC piping system for fire sprinklers; water tanks under the Opta, Cleo, Vito, Sylo, and Sarita brand names; and surface drainage systems under the Astral Hauraton brand name. Additionally, the company offers Astral MultiRex polyolefin cable channels; Astral Wire Guard conduit pipes; and Astral TeleRex pipes for cable protection. It also offers ancillary products, including clamps and hangers for pipes and cables; Astral INSUPro \u0096XLPE insulation for piping; and air admittance valve, basin traps, and back flow preventer valve. The company was formerly known as Astral Poly Technik Limited and changed its name to Astral Limited in April 2021. Astral Limited was incorporated in 1996 and is based in Ahmedabad, India."},"city":{"0":"Ahmedabad"},"phone":{"0":"91 79 6621 2000"},"website":{"0":"https:\/\/www.astralpipes.com"},"grossProfits":{"0":14525000000},"totalCash":{"0":4592000000},"totalDebt":{"0":954000000},"totalRevenue":{"0":48777998336},"totalCashPerShare":{"0":22.83},"revenuePerShare":{"0":242.788},"bookValue":{"0":120.616},"priceToBook":{"0":16.282251},"marketCap":{"0":395645353984},"averageVolume":{"0":428743},"fiftyTwoWeekHigh":{"0":2654.8},"fiftyTwoWeekLow":{"0":1581.55},"logo_url":{"0":"https:\/\/logo.clearbit.com\/astralpipes.com"}}