{"sector":{"0":"Basic Materials"},"longName":{"0":"Atul Ltd"},"fullTimeEmployees":{"0":3034},"longBusinessSummary":{"0":"Atul Ltd manufactures and sells chemicals and other chemical products worldwide. It operates in two segments, Life Science Chemicals; and Performance and Other Chemicals. The company offers aromatics, such as 2 nitro para cresol, 2-methylcyclohexyl acetate, allyl caproate, allyl heptanoate, ambrettolide, anethole, cresol mixture, manganese sulphate monohydrate, ortho cresol and methoxy toluene, phenyl acetic acid, skatole, and sodium sulfite and sulphate, as well as para anisic aldehyde, anisyl acetate and alcohol, anisyl propanal, cresidine, cresol, cresyl acetate and methyl ether, methoxy phenyl acetic acid, and aceto nitrile; and bulk chemicals and intermediates, including 1,3-cyclohexanedione, 2-methylresorcinol, 4-chlororesorcinol, anisole, caustic soda lye, chlorosulphonic and hydrochloric acid, gypsum, hydrogen gas, liquid chlorine, liquid sulphur dioxide and trioxide, oleum, resoform, resorcinol, resorcinol dimethyl ether, sodium hypochlorite, sodium sulphite, and sulphuric acid. It also provides colors; fungicides, herbicides, insecticides, and intermediates; amino acid derivatives, active pharmaceutical ingredients (API), API intermediates, and phosgene derivatives; and epoxy resins, curing agents, reactive diluents, accelerators and catalysts, formulations, and sulfones. In addition, the company produces tissue culture raised oil and date palm plants, as well as engage in the crop protection retail and polymers retail operations. It serves various industries, including adhesives, agriculture, animal feed, automobile, composites, construction, cosmetic, defense, dyestuff, electrical and electronics, flavor, food, footwear, fragrance, glass, home care, horticulture, hospitality, paint and coatings, paper, personal care, pharmaceutical, plastic, rubber, soap and detergent, sport and leisure, textile, tire, and wind energy. Atul Ltd was incorporated in 1947 and is headquartered in Valsad, India."},"city":{"0":"Valsad"},"phone":{"0":"91 26 3223 0000"},"website":{"0":"https:\/\/www.atul.co.in"},"grossProfits":{"0":23547300000},"totalCash":{"0":2475599872},"totalDebt":{"0":731900032},"totalRevenue":{"0":57148502016},"totalCashPerShare":{"0":83.843},"revenuePerShare":{"0":1933.559},"bookValue":{"0":1548.52},"priceToBook":{"0":5.332834},"marketCap":{"0":243724959744},"averageVolume":{"0":30496},"fiftyTwoWeekHigh":{"0":10856.8},"fiftyTwoWeekLow":{"0":7750},"logo_url":{"0":"https:\/\/logo.clearbit.com\/atul.co.in"}}