{"sector":{"0":"Financial Services"},"longName":{"0":"AU Small Finance Bank Limited"},"fullTimeEmployees":{"0":28677},"longBusinessSummary":{"0":"AU Small Finance Bank Limited provides various banking and financial services in India. The company operates through Treasury, Retail Banking, Wholesale Banking, and Other Banking Operations segments. It provides saving, current, salary, senior citizen and NRI, fixed, recurring, and COVID shield deposit accounts, as well as debit and credit cards and locker services. The company also offers car, two-wheeler, commercial vehicle, personal, tractor, home, gold, construction equipment, business, agriculture, and working capital loans. In addition, it provides life, health, general, and motor insurance; mutual funds and national pension system; overdraft, cash credit, bank guarantee, and letters of credit; and internet and mobile banking, collection and receivables, and payment and other merchant payment services. Further, the company provides government banking services to central government, state governments, central and state public sector undertakings, boards, defence, urban local bodies, and other government departments. As of March 31, 2022, it operated 692 bank branches, 210 correspondents banking outlets, 17 business correspondents, and 514 ATMs. The company was formerly known as AU Financiers (India) Limited and changed its name to AU Small Finance Bank Limited in May 2017. The company was incorporated in 1996 and is headquartered in Jaipur, India."},"city":{"0":"Jaipur"},"phone":{"0":"91 14 1666 0666"},"website":{"0":"https:\/\/www.aubank.in"},"grossProfits":{"0":38668487000},"totalCash":{"0":39485411328},"totalDebt":{"0":66951036928},"totalRevenue":{"0":45793452032},"totalCashPerShare":{"0":60.738},"revenuePerShare":{"0":72.261},"bookValue":{"0":155.581},"priceToBook":{"0":4.206491},"marketCap":{"0":436147716096},"averageVolume":{"0":1665658},"fiftyTwoWeekHigh":{"0":732.975},"fiftyTwoWeekLow":{"0":519.95},"logo_url":{"0":"https:\/\/logo.clearbit.com\/aubank.in"}}