{"sector":{"0":"Consumer Defensive"},"longName":{"0":"Adani Wilmar Limited"},"fullTimeEmployees":{"0":2409},"longBusinessSummary":{"0":"Adani Wilmar Limited, a fast-moving consumer goods (FMCG) food company, provides kitchen commodities in India. It produces, refines, and sells soyabean, palm, sunflower, rice bran, mustard, groundnut, cottonseed, and blended oil; specialty fats, including industrial margarine, bakery shortenings, and vanaspati for baked products; and lauric fats for ice cream and confectionery. The company also offers oleochemicals, such as stearic acids, soap noodles, palmitic acids, oleic acids, and glycerin for home and personal care products; sastor oils and its derivatives comprising steric acids and ricin oleic acids for medical, pharmaceutical, cosmetic, and aeronautical use; and de-oiled cakes that are used as livestock feeds. In addition, it provides wheat flour, rice, pulses, sugar, besan, atta, soya chunks, bakery fats, and ready-to-cook khichdi; soaps, handwash, and sanitizers. Further, the company is involved in the bulk packaging of frying oil. It provides its products under the Fortune, King's, Raag, Bullet, Fryola, Jubilee, Aadhaar, Alpha, Avsar, Golden Chef, Alife, and VIVO brand names through retail distribution channels and e-commerce platforms, such as Fortune Online, as well as operates 33 Fortune Mart stores. The company exports its products to the Middle East, Southeast Asia, East Africa, Europe, the United States, Canada, and internationally. Adani Wilmar Limited was incorporated in 1999 and is based in Ahmedabad, India."},"city":{"0":"Ahmedabad"},"phone":{"0":"91 79 2645 5650"},"website":{"0":"https:\/\/www.adaniwilmar.com"},"grossProfits":{"0":54046400000},"totalCash":{"0":44422201344},"totalDebt":{"0":31140100096},"totalRevenue":{"0":582535413760},"totalCashPerShare":{"0":34.619},"revenuePerShare":{"0":467.322},"bookValue":{"0":61.032},"priceToBook":{"0":10.120101},"marketCap":{"0":802747383808},"averageVolume":{"0":2739242},"fiftyTwoWeekHigh":{"0":878},"fiftyTwoWeekLow":{"0":227},"logo_url":{"0":"https:\/\/logo.clearbit.com\/adaniwilmar.com"}}