{"sector":{"0":"Consumer Cyclical"},"longName":{"0":"Bajaj Electricals Limited"},"fullTimeEmployees":{"0":2661},"longBusinessSummary":{"0":"Bajaj Electricals Limited engages in the consumer durables; and engineering, procurement, and construction businesses in India. It operates through Consumer Products; Engineering & Projects; and Others segments. The company offers various appliances, including toasters, mixer-grinders, food processors, juicer mixer grinders, choppers and hand blenders, snack makers, wet grinders, oven toaster grill, microwave ovens, electric kettles, induction cookers, rice cookers, pressure cookers, gas stoves, non-electric kitchen appliances, irons, storage water heaters, pans and tavas, gas water heaters, instant water heaters, room heaters, air coolers, coffee makers, pop-up toasters, and electric cookers. It also provides various fans comprising ceiling, pedestal, table, wall, personal, and domestic exhaust fans, as well as air circulators. In addition, the company offers lighting products, including LED lamps, battens, panels, and electrical accessories. Further, it is involved in the design, engineering, supply, execution, and commissioning of power distribution and transmission projects, as well as illumination. Additionally, the company generates wind energy. It operates approximately 2,30,000 retail outlets. Bajaj Electricals Limited exports its products to Sri Lanka, Bangladesh, Singapore, Myanmar, Mauritius, Nigeria, Ethiopia, Uganda, Ghana, Tanzania, Madagascar, Kenya, Egypt, the United Arab Emirates, Oman, Bahrain, Iraq, Jordan, and other countries. The company was formerly known as Radio Lamp Works Limited and changed its name to Bajaj Electricals Limited in October 1960. The company was incorporated in 1938 and is headquartered in Mumbai, India."},"city":{"0":"Mumbai"},"phone":{"0":"91 22 2204 3780"},"website":{"0":"https:\/\/www.bajajelectricals.com"},"grossProfits":{"0":13706066000},"totalCash":{"0":2128300032},"totalDebt":{"0":600300032},"totalRevenue":{"0":51088044032},"totalCashPerShare":{"0":19.046},"revenuePerShare":{"0":465.693},"bookValue":{"0":159.564},"priceToBook":{"0":7.6107397},"marketCap":{"0":139694866432},"averageVolume":{"0":75718},"fiftyTwoWeekHigh":{"0":1317.7},"fiftyTwoWeekLow":{"0":858.55},"logo_url":{"0":"https:\/\/logo.clearbit.com\/bajajelectricals.com"}}