{"sector":{"0":"Financial Services"},"longName":{"0":"Bank of Baroda"},"fullTimeEmployees":{"0":79806},"longBusinessSummary":{"0":"Bank of Baroda provides various banking products and services to individuals, government departments, and corporate customers. The company operates through Treasury, Corporate\/Wholesale Banking, Retail Banking, and Other Banking Operations segments. It offers savings and current accounts; term, fixed and recurring deposits; and NRI deposit products. The company also provides loans, such as home, education, vehicle, gold, mudra, personal, and mortgage loans, as well as loans against securities and public issues\/IPO; professional, composite, bridge, FCNR, and short and medium-term corporate loans, as well as loans for micro, small, and medium enterprises; working capital finance, term finance, commercial vehicle finance, export finance, advances against shares, bill finance, lines of credit, loans against rent receivables, project finance, infrastructure finance, supply chain finance, loans for the takeover of accounts, foreign currency credit, and non-fund based services; and debit, prepaid, and credit cards. In addition, it offers loans and advances, and pensions and government schemes to customers; life insurance, general insurance, and health insurance products, as well as mutual funds; appraisal merchant banking, cash management, remittance, collection, e-stamping, ECS, hedging, FX retail, correspondent banking, treasury, investment, lockers, and capital market services; and ATM, mobile banking, internet banking, cash recycler, and e-lobby services. Further, the company offers banking solutions for start-ups. As of March 31, 2022, it operated a network of 8,168 branches; 94 overseas branches; 9,845 ATMs; and 1,642 cash re-cyclers. Bank of Baroda was founded in 1908 and is headquartered in Vadodara, India."},"city":{"0":"Vadodara"},"phone":{"0":"91 26 5231 6792"},"website":{"0":"https:\/\/www.bankofbaroda.in"},"grossProfits":{"0":331067631000},"totalCash":{"0":521449799680},"totalDebt":{"0":1173321023488},"totalRevenue":{"0":380227321856},"totalCashPerShare":{"0":100.902},"revenuePerShare":{"0":73.489},"bookValue":{"0":188.671},"priceToBook":{"0":0.984253},"marketCap":{"0":960321486848},"averageVolume":{"0":29856984},"fiftyTwoWeekHigh":{"0":197.2},"fiftyTwoWeekLow":{"0":81.6},"logo_url":{"0":"https:\/\/logo.clearbit.com\/bankofbaroda.in"}}