{"sector":{"0":"Basic Materials"},"longName":{"0":"BASF India Limited"},"fullTimeEmployees":{"0":1327},"longBusinessSummary":{"0":"BASF India Limited provides chemicals, materials, industrial solutions, surface technologies, nutrition and care, and agricultural solutions in India. Its Agricultural Solution segment offers crop protection products, such as insecticides, herbicides, fungicides, and plant growth regulators. The company's Chemicals segment provides petrochemicals, including oxo-alcohols, acrylic acid, acrylic monomers, and specialty plasticizers; and intermediate chemicals for pharmaceuticals, agrochemicals, coatings, food and feed, flavor and fragrance, surfactants, rubber chemicals, textiles, personal care, adhesives, dyes, etc. Its Materials segment offers performance materials, such as polyurethane, and engineering and specialty plastics; and monomers comprising basic raw materials for polyurethanes, inorganics, and polyamides, as well as its precursors. The company's Industrial Solutions segment provides dispersions, resins, additives, and performance chemicals for paints and coatings, construction, paper, adhesives, automobile, printing, and packaging industries. Its Surface Technologies segment offers catalysts and coatings. The company's Nutrition & Care segment provides solutions to personal care, home care and institutional cleaning, and industrial formulation segments; and products for human nutrition, animal nutrition, pharma solutions, and aroma ingredients. It also exports its products. The company was incorporated in 1943 and is based in Navi Mumbai, India. BASF India Limited is a subsidiary of BASF SE."},"city":{"0":"Navi Mumbai"},"phone":{"0":"91 22 6712 7777"},"website":{"0":"https:\/\/www.basf.com\/in"},"grossProfits":{"0":22102400000},"totalCash":{"0":764000000},"totalDebt":{"0":1054499968},"totalRevenue":{"0":141511000064},"totalCashPerShare":{"0":17.65},"revenuePerShare":{"0":3269.288},"bookValue":{"0":603.277},"priceToBook":{"0":4.6739726},"marketCap":{"0":122052403200},"averageVolume":{"0":19016},"fiftyTwoWeekHigh":{"0":3526.1},"fiftyTwoWeekLow":{"0":2351},"logo_url":{"0":"https:\/\/logo.clearbit.com\/basf.com"}}