{"sector":{"0":"Communication Services"},"longName":{"0":"Bharti Airtel Limited"},"fullTimeEmployees":{"0":18000},"longBusinessSummary":{"0":"Bharti Airtel Limited operates as a telecommunications company in Asia and Africa. It operates through Mobile Services India, Mobile Services Africa, Mobile Services South Asia, Airtel Business, Tower Infrastructure Services, Homes Services, Digital TV Services, and Others segments. The company's product offerings include 2G, 3G, and 4G wireless services, as well as mobile commerce, fixed-line services, high speed broadband, DTH, enterprise services, and national and international long-distance connectivity services. It also provides voice, data, video, web conferencing, network integration, data center, and managed services, as well as enterprise mobility applications and digital media; on-demand and streaming services; digital payments and financial services; and cloud and data center, cybersecurity, IoT, Ad Tech, and cloud based networking solutions. In addition, the company operates a submarine cable system; and provides telecom towers. The company has approximately 491 million customers across 17 countries. Bharti Airtel Limited has partnership with Google Cloud and Cisco to launch Airtel Office Internet, a unified enterprise grade solution; and a strategic partnership with Tata Consultancy Services Limited for implementing 5G network solutions for India. The company was formerly known as Bharti Tele-Ventures Limited and changed its name to Bharti Airtel Limited in April 2006. Bharti Airtel Limited was incorporated in 1995 and is headquartered in New Delhi, India."},"city":{"0":"New Delhi"},"phone":{"0":"91 11 4666 6100"},"website":{"0":"https:\/\/www.airtel.in"},"grossProfits":{"0":698027000000},"totalCash":{"0":91891998720},"totalDebt":{"0":1696778944512},"totalRevenue":{"0":1230145978368},"totalCashPerShare":{"0":15.625},"revenuePerShare":{"0":220.527},"bookValue":{"0":109.817},"priceToBook":{"0":7.340393},"marketCap":{"0":4740633591808},"averageVolume":{"0":4989234},"fiftyTwoWeekHigh":{"0":860.55},"fiftyTwoWeekLow":{"0":628.75},"logo_url":{"0":"https:\/\/logo.clearbit.com\/airtel.in"}}