{"sector":{"0":"Industrials"},"longName":{"0":"Bharat Heavy Electricals Limited"},"fullTimeEmployees":{"0":30758},"longBusinessSummary":{"0":"Bharat Heavy Electricals Limited operates as engineering and manufacturing company in India. The company operates in two segments: Power and Industry. It offers thermal power plants, nuclear power plants, gas-based power plants, hydro power plants, solar power systems, DG power plants, desalination and water treatment plants, systems and services, industrial systems, boilers, boiler auxiliaries, soot blowers, valves, piping systems, seamless steel tubes, steam turbines, turbo generators, industrial sets, castings and forgings, condenser and heat exchangers, pumps, compressors, solar photovoltaics, and automation and control systems. The company also provides transmission systems control, software system solutions, medium voltage vacuum switchgears, on load tap changers, LT switchgears and bus ducts, transformers and reactors, capacitors, bushings, control gears, insulators, electrical machines, rail transportation systems, defense and aerospace products, transportation equipment, energy storage systems and e-mobility, oil field equipment, and fabricated equipment and mechanical packages. It serves customers in power-thermal, transmission, transportation, renewables, water, oil and gas, defense and aerospace, hydro, gas, nuclear and solar PV, energy storage, electric mobility, petrochemicals, and other industries. The company was incorporated in 1964 and is based in New Delhi, India."},"city":{"0":"New Delhi"},"phone":{"0":"91 11 6633 7000"},"website":{"0":"https:\/\/www.bhel.com"},"grossProfits":{"0":62894400000},"totalCash":{"0":71536902144},"totalDebt":{"0":48299298816},"totalRevenue":{"0":229817696256},"totalCashPerShare":{"0":20.549},"revenuePerShare":{"0":65.893},"bookValue":{"0":78.286},"priceToBook":{"0":1.0116751},"marketCap":{"0":278535307264},"averageVolume":{"0":36394397},"fiftyTwoWeekHigh":{"0":91.55},"fiftyTwoWeekLow":{"0":41.4},"logo_url":{"0":"https:\/\/logo.clearbit.com\/bhel.com"}}