{"sector":{"0":"Basic Materials"},"longName":{"0":"Birla Corporation Limited"},"fullTimeEmployees":{"0":7184},"longBusinessSummary":{"0":"Birla Corporation Limited manufactures and sells cement in India. The company operates through three segments: Cement, Jute, and Others. It offers ordinary Portland, Portland Pozzolana, and Portland slag cement under the MP Birla Cement Perfect Plus, MP Birla Cement Samrat Advanced, MP Birla Cement Ultimate Ultra, MP Birla Cement Unique, MP Birla Cement Samrat, MP Birla Cement Ultimate, MP Birla Cement Chetak, MP Birla Cement PSC, MP Birla Cement MULTICEM, and MP Birla Cement CONCRECEM brands used in bridges, dams, railway sleepers, reservoirs, industrial buildings, marine structures, cooling towers, metro lines, and airport runways. The company also manufactures various jute products, such as jute yarn, floor and wall coverings, lino hessian products, decorative fabrics, nursery cloths, scrims, jute carpets, non-woven jute felts, hydrocarbon-free bags\/cloths, D.W. canvas products, carpet backing cloths, hessian cloths\/bags, and sacking bags\/cloths, which are used in mats, yarns, ropes, bags, carpets, and panama. In addition, it offers iron and steel castings. The company also exports its products. The company was formerly known as Birla Jute Manufacturing Company Limited and changed its name to Birla Corporation Limited in 1998. Birla Corporation Limited was incorporated in 1919 and is based in Kolkata, India."},"city":{"0":"Kolkata"},"phone":{"0":"91 33 6603 3300"},"website":{"0":"https:\/\/www.birlacorporation.com"},"grossProfits":{"0":62594800000},"totalCash":{"0":7396100096},"totalDebt":{"0":43259400192},"totalRevenue":{"0":79158697984},"totalCashPerShare":{"0":96.035},"revenuePerShare":{"0":1027.858},"bookValue":{"0":651.478},"priceToBook":{"0":1.5047323},"marketCap":{"0":75662786560},"averageVolume":{"0":148415},"fiftyTwoWeekHigh":{"0":1628.5},"fiftyTwoWeekLow":{"0":823},"logo_url":{"0":"https:\/\/logo.clearbit.com\/birlacorporation.com"}}