{"sector":{"0":"Energy"},"longName":{"0":"Bharat Petroleum Corporation Limited"},"fullTimeEmployees":{"0":8594},"longBusinessSummary":{"0":"Bharat Petroleum Corporation Limited refines crude oil and markets petroleum products in India. The company operates through two segments, Downstream Petroleum; and Exploration and Production of Hydrocarbons. It operates fuel stations that sell petrol, diesel, automotive liquefied petroleum gas (LPG), and compressed natural gas. The company operates a network of 18,622 fuel stations. It also provides Bharatgas fuels to approximately 8 crore households; MAK lubricants, such as automotive engine oils, gear oils, greases, and specialties, as well as industrial lubricants; and jet fuel and services to airlines, as well as operates oil refineries in Mumbai, Bina, and Kochi. In addition, the company offers industrial fuels products, such as white oil, black oil, bitumen, sulphur, petcoke, propylene, petchem, and solvents products; and bunkering facilities. Further, it has participating interests in eighteen blocks, including nine blocks in India and nine blocks in other countries; imports and exports petroleum products; and owns a network of 2,596 km of multi-product pipelines, as well as engages in the natural gas business. The company was formerly known as Bharat Refineries Limited and changed its name to Bharat Petroleum Corporation Limited in August 1977. Bharat Petroleum Corporation Limited was incorporated in 1952 and is based in Mumbai, India."},"city":{"0":"Mumbai"},"phone":{"0":"91 22 2271 3000"},"website":{"0":"https:\/\/www.bharatpetroleum.in"},"grossProfits":{"0":433898100000},"totalCash":{"0":52945801216},"totalDebt":{"0":645341970432},"totalRevenue":{"0":3969246560256},"totalCashPerShare":{"0":24.407},"revenuePerShare":{"0":1863.941},"bookValue":{"0":203.748},"priceToBook":{"0":1.6221018},"marketCap":{"0":716937166848},"averageVolume":{"0":3468016},"fiftyTwoWeekHigh":{"0":406.9},"fiftyTwoWeekLow":{"0":288.05},"logo_url":{"0":"https:\/\/logo.clearbit.com\/bharatpetroleum.in"}}