{"sector":{"0":"Financial Services"},"longName":{"0":"Central Bank of India"},"fullTimeEmployees":{"0":30289},"longBusinessSummary":{"0":"Central Bank of India operates as a commercial bank in India. The company offers deposit products, which include savings and current accounts, time deposits, fixed deposits, and recurring deposit schemes, as well as small saving scheme; and loans, including housing, vehicle, property, personal, senior citizens, education, and agricultural, as well as micro small and medium enterprises loans. It also provides credit, debit, and prepaid\/gift cards, as well as cash management, mutual funds, depository, mobile and Internet banking, and ATM services. In addition, the company offers corporate loans, such as project finance, infrastructure funding, financing to infrastructure investment trusts, short term corporate loans, advances, working capital facilities, line of credit, export finance, foreign currency loan, bills purchase\/discount\/negotiation facilities, non-fund based facilities, and facilities to other industries. Further, the company sells and distributes life, general, and health insurance products, including unit linked, whole life, children, money back, endowment, pension, health, property, personal, fire, burglary, engineering, motor, package, travel, and group insurance products, as well as protection and retirement solutions. As of March 31, 2022, it operated through a network of 4,528 branches; 2,976 ATMs; 10 satellite offices; and 1 extension counter. Central Bank of India has a strategic co lending partnership with IIFL Home Finance Limited to offer SME LAP loan products under priority sector to MSME borrowers. The company was incorporated in 1911 and is headquartered in Mumbai, India."},"city":{"0":"Mumbai"},"phone":{"0":"91 22 2202 6438"},"website":{"0":"https:\/\/www.centralbankofindia.co.in"},"grossProfits":{"0":83415733000},"totalCash":{"0":13361986560},"totalDebt":{"0":78287200256},"totalRevenue":{"0":84164534272},"totalCashPerShare":{"0":1.539},"revenuePerShare":{"0":9.704},"bookValue":{"0":37.502},"priceToBook":{"0":0.8572877},"marketCap":{"0":279092232192},"averageVolume":{"0":34572493},"fiftyTwoWeekHigh":{"0":41.8},"fiftyTwoWeekLow":{"0":16.25},"logo_url":{"0":"https:\/\/logo.clearbit.com\/centralbankofindia.co.in"}}