{"sector":{"0":"Industrials"},"longName":{"0":"CG Power and Industrial Solutions Limited"},"fullTimeEmployees":{"0":2586},"longBusinessSummary":{"0":"CG Power and Industrial Solutions Limited provides various solutions to utilities, industries, and consumers for the management and application of electrical energy in India and internationally. The company operates through Power Systems and Industrial Systems segments. The Power Systems segment offers power and distribution transformers, switchgears, circuit breakers, instrument transformers, lightning arrestors, isolators, and vacuum interrupters. It also undertakes design, products, procurement, construction, erection, and servicing of turnkey transmission and distribution projects, as well as substation projects. The Industrial Systems segment provides motors, AC generators, drives and automation, soft starters and shaft power monitors, heat exchanger drives with switched reluctance motors, domestic and commercial fans, traction electronics and traction machines for railway transportation, railway signaling equipment, and stampings and laminations, as well as residential, agricultural, and specialty pumps. It also offers services and refurbishment of large rotating machines. The company was formerly known as Crompton Greaves Limited and changed its name to CG Power and Industrial Solutions Limited in February 2017. CG Power and Industrial Solutions Limited was incorporated in 1937 and is headquartered in Mumbai, India."},"city":{"0":"Mumbai"},"phone":{"0":"91 22 2423 7777"},"website":{"0":"https:\/\/www.cgglobal.com"},"grossProfits":{"0":15895100000},"totalCash":{"0":7670400000},"totalDebt":{"0":2417900032},"totalRevenue":{"0":64190799872},"totalCashPerShare":{"0":5.014},"revenuePerShare":{"0":92.339},"bookValue":{"0":-4.903},"priceToBook":{"0":null},"marketCap":{"0":365402324992},"averageVolume":{"0":1627735},"fiftyTwoWeekHigh":{"0":288},"fiftyTwoWeekLow":{"0":154},"logo_url":{"0":"https:\/\/logo.clearbit.com\/cgglobal.com"}}