{"sector":{"0":"Financial Services"},"longName":{"0":"Cholamandalam Investment and Finance Company Limited"},"fullTimeEmployees":{"0":9125},"longBusinessSummary":{"0":"Cholamandalam Investment and Finance Company Limited, a non-banking finance company, provides various financial services in India. The company operates through Vehicle Finance, Loan Against Property, Home Loans, and Other loans segments. It offers two and three wheeler loans, new and used commercial vehicle loans, tractor loans, car and multi utility vehicles loans, and construction equipment loans, as well as loans to automobile dealers; loans against properties; home loans; loans for the self-construction, purchase of resale and new flats, independent houses, and ready to occupy homes; balance transfer facility for existing home loans; mixed use for residential and commercial; shop loans; business loans for micro, small and medium enterprises; professional loans; personal loans; rural and agri-loans; and refinance against existing vehicles. The company also provides supply chain financing, term loans for capex, loan against shares, and funding on hypothecation of machinery for specific industries; wealth management services comprising mutual funds, fixed deposits and bonds, debentures, PMS, insurance, sovereign gold bonds, and initial public offers; other unsecured loans; and stock broking services for mutual funds, stocks and derivatives, exchange-traded funds, and bonds, as well as internet broking, demat, and depository participant services. In addition, it provides online payment gateway services for e-commerce businesses; e-commerce solutions; and Payswiff, an omni channel payment transaction solution. As of March 31, 2022, it operated through a network of 1,145 branches. The company was incorporated in 1978 and is headquartered in Chennai, India."},"city":{"0":"Chennai"},"phone":{"0":"91 44 4090 7172"},"website":{"0":"https:\/\/www.cholamandalam.com"},"grossProfits":{"0":49768100000},"totalCash":{"0":28853700608},"totalDebt":{"0":694534209536},"totalRevenue":{"0":52438401024},"totalCashPerShare":{"0":35.125},"revenuePerShare":{"0":63.859},"bookValue":{"0":110.01},"priceToBook":{"0":6.571221},"marketCap":{"0":593405476864},"averageVolume":{"0":1315716},"fiftyTwoWeekHigh":{"0":817.75},"fiftyTwoWeekLow":{"0":519.35},"logo_url":{"0":"https:\/\/logo.clearbit.com\/cholamandalam.com"}}