{"sector":{"0":"Technology"},"longName":{"0":"Coforge Limited"},"fullTimeEmployees":{"0":22991},"longBusinessSummary":{"0":"Coforge Limited provides information technology (IT) and IT enabled services in India, the Americas, Europe, the Middle East and Africa, and the Asia Pacific. It offers digital process automation services, including workflow\/process management, artificial intelligence (AI) and predictive analytics, robotic process automation, and case management; digital services, such as digital integration, Salesforce, MuleSoft, digital interactive and advisory, automation, digital innovation, and innovation as a services; and cloud and infrastructure management services comprising cloud, workplace, cybersecurity, data center, and always on network, as well as service integration services. The company also provides cybersecurity services, which include security incident management platform, managed automated security testing and enhanced remediation, intelligent detection and response of threats, access control and entity management, governance risk management and compliance, and secure adaptive fortified endpoints, as well as phishing, analysis, and training and testing platform. In addition, it offers AI and cognitive, business analytics, and data engineering services; advanced application engineering services, including development, operations, and quality engineering services; business process solutions; and media solutions, such as print design services and marketing solutions. The company serves insurance, travel, transportation, hospitality, banking and financial services, healthcare and life sciences, public sector, hi-tech and manufacturing, media and entertainment, and retail and consumer goods industries. Coforge Limited has strategic alliances with Kong Inc. for cloud API services; and Newgen Software Technologies Limited to enhance digital operations for organizations. The company was formerly known as NIIT Technologies Limited and changed its name to Coforge Limited in August 2020. Coforge Limited was incorporated in 1992 and is based in New Delhi, India."},"city":{"0":"New Delhi"},"phone":{"0":"91 11 4102 9297"},"website":{"0":"https:\/\/www.coforge.com"},"grossProfits":{"0":15326000000},"totalCash":{"0":3888999936},"totalDebt":{"0":7553999872},"totalRevenue":{"0":71897997312},"totalCashPerShare":{"0":63.818},"revenuePerShare":{"0":1181.351},"bookValue":{"0":383.188},"priceToBook":{"0":10.136278},"marketCap":{"0":236515278848},"averageVolume":{"0":253534},"fiftyTwoWeekHigh":{"0":6135},"fiftyTwoWeekLow":{"0":3210.05},"logo_url":{"0":"https:\/\/logo.clearbit.com\/coforge.com"}}