{"sector":{"0":"Financial Services"},"longName":{"0":"CSB Bank Limited"},"fullTimeEmployees":{"0":4632},"longBusinessSummary":{"0":"CSB Bank Limited provides various banking products and services for small and medium enterprises, retail, and NRI customers in India. It operates through four segments: Treasury, Corporate\/Wholesale Banking, Retail Banking, and Other Banking Operations. The company accepts various deposits products that include savings accounts, NRO, NRE, FCNR, and RFC accounts, fixed deposits, recurring deposits, corporate salary, and current accounts, as well as products for NRI customers; personal and business loans, including loans against gold jewelry, two wheeler and motor vehicle loans, housing loans, loan against property and overdrafts on mortgage\/hypothecation\/pledge, small business loans, and agricultural loans; and microfinance. It also offers demat services; safe deposits lockers; banking services to financial institutions, such as non-banking financial companies, banks, insurance companies, mutual funds, brokers, etc.; cash management and trade finance services; digital banking services; statutory reserves and asset liability management, liquidity management, investment and securities trading, and money market and foreign exchange services; sovereign debt instruments investment services; commercial papers, mutual funds, certificates of deposits, bonds, and debentures; remittance services; life and non-life insurances; and payment services, as well as debit and credit cards. In addition, it provides agri-banking services; and corporate lending services. As of March 31, 2022, the company operated 609 branches, which included 3 service branches, 3 asset recovery branches, and 459 ATMs\/CRMs. The company was formerly known as The Catholic Syrian Bank Limited and changed its name to CSB Bank Limited in June 2019. CSB Bank Limited was incorporated in 1920 and is headquartered in Thrissur, India."},"city":{"0":"Thrissur"},"phone":{"0":"91 48 7233 3020"},"website":{"0":"https:\/\/www.csb.co.in"},"grossProfits":{"0":14044139000},"totalCash":{"0":16305999872},"totalDebt":{"0":13518000128},"totalRevenue":{"0":15489039360},"totalCashPerShare":{"0":94.008},"revenuePerShare":{"0":89.285},"bookValue":{"0":120.029},"priceToBook":{"0":1.9811879},"marketCap":{"0":41345093632},"averageVolume":{"0":639252},"fiftyTwoWeekHigh":{"0":275.1},"fiftyTwoWeekLow":{"0":178},"logo_url":{"0":"https:\/\/logo.clearbit.com\/csb.co.in"}}