{"sector":{"0":"Financial Services"},"longName":{"0":"City Union Bank Limited"},"fullTimeEmployees":{"0":5367},"longBusinessSummary":{"0":"City Union Bank Limited provides various banking products and services to personal and corporate clients in India. The company operates through four segments: Treasury, Corporate, Retail Banking, and Other Banking Operations. It offers savings, current, and salary accounts; fixed, flexi fix, recurring, and tax saver deposits; and NRI banking products and services. The company also provides consumer, two and four-wheeler, home, educational, personal and agricultural gold, working capital, easy business, foreign currency, agricultural term, and small road transport operator loans; cash credits, bank guarantees, letters of credit, and bills finance, as well as gold based overdrafts facilities; and international business services, including export, import, remittance, correspondent banking, and treasury risk management services. In addition, it offers locker facilities, automated teller machines (ATMs), cash deposit machines\/bulk note acceptors, and point of sales services, as well as demat and insurance products and services; and debit\/prepaid and credit cards. Further, the company provides cash management, payment to government, national electronic fund transfer, immediate payment, real time gross settlement, national automatic clearing house, and other tech services. As of March 31, 2022, it operated through a network of 727 branches; 1,732 ATMs, including 789 bulk note recycler machines; 610 passbook kiosks; and 589 cheque deposit kiosks. The company was formerly known as The Kumbakonam City Union Bank Limited and changed its name to City Union Bank Limited in November 1987. City Union Bank Limited was incorporated in 1904 and is based in Kumbakonam, India."},"city":{"0":"Kumbakonam"},"phone":{"0":"91 43 5240 2322"},"website":{"0":"https:\/\/www.cityunionbank.com"},"grossProfits":{"0":20654265000},"totalCash":{"0":45448146944},"totalDebt":{"0":53118234624},"totalRevenue":{"0":21826535424},"totalCashPerShare":{"0":61.451},"revenuePerShare":{"0":29.518},"bookValue":{"0":77.707},"priceToBook":{"0":2.321541},"marketCap":{"0":133381980160},"averageVolume":{"0":3803227},"fiftyTwoWeekHigh":{"0":205},"fiftyTwoWeekLow":{"0":109},"logo_url":{"0":"https:\/\/logo.clearbit.com\/cityunionbank.com"}}