{"sector":{"0":"Industrials"},"longName":{"0":"Cummins India Limited"},"fullTimeEmployees":{"0":3167},"longBusinessSummary":{"0":"Cummins India Limited designs, manufactures, distributes, and services engines, generator sets, and related technologies in India. The company operates through three business units: Engine Business, Power Systems Business, and Distribution Business. The Engine Business segment manufactures and markets diesel engines ranging from 50 HP to 600 HP for off-highway applications, as well as off-highway commercial equipment industry comprising construction and compressor. The Power Systems Business segment provides power generation systems in standby and distributed power generation for individual and institutional customers in various segments, such as infrastructure, manufacturing, data centers, rental, healthcare, and hospitality; and integrated power solutions for railways, mining, marine, pumps, oil and gas, and defense sectors, as well as manufactures and exports low kilowatt generator sets; and power generation systems including generator sets, paralleling controls, switchgears, transfer switches, and controls. The Distribution Business segment offers products, services, and solutions for equipment and engines; and provides after-market support services to customers in India, Nepal, and Bhutan. It also exports its products to the United States, Europe, Mexico, Africa, the Middle East, and China. The company was incorporated in 1962 and is headquartered in Pune, India. Cummins India Limited is a subsidiary of Cummins Inc."},"city":{"0":"Pune"},"phone":{"0":"91 20 6706 7000"},"website":{"0":"https:\/\/www.cummins.com\/en\/in\/company\/cummins-india?locset=IN"},"grossProfits":{"0":20260500000},"totalCash":{"0":22057699328},"totalDebt":{"0":4175300096},"totalRevenue":{"0":66719301632},"totalCashPerShare":{"0":79.573},"revenuePerShare":{"0":240.7},"bookValue":{"0":160.052},"priceToBook":{"0":8.624697},"marketCap":{"0":382646878208},"averageVolume":{"0":645301},"fiftyTwoWeekHigh":{"0":1552},"fiftyTwoWeekLow":{"0":877.2},"logo_url":{"0":"https:\/\/logo.clearbit.com\/cummins.com"}}