{"sector":{"0":"Industrials"},"longName":{"0":"Cyient Limited"},"fullTimeEmployees":{"0":12468},"longBusinessSummary":{"0":"Cyient Limited provides geospatial, engineering design, information technology (IT) solutions, and data analytic services in North America, Europe, and the Asia Pacific. The company operates through segments, Services and Design Led Manufacturing. It offers engineering services, such as systems, mechanical, electrical, manufacturing, plant, network, and field engineering, as well as aftermarket, embedded systems, and intellectual property and allied services. The company also provides electronic and mechanical manufacturing services; and analytics, big data consulting, and Internet of Things and M2M services. In addition, it offers geospatial services, including data acquisition, remote sensing, photogrammetry, navigational data mapping, and location-based services. Further, the company provides digitization of drawings and maps, computer aided design\/engineering, design and modelling, repair development engineering, reverse engineering application software development, software products development, consulting, analytics, and implementation services. The company serves aerospace and defense, automotive, communications, energy, geospatial, industrial and heavy equipment, medical technology and healthcare, mining, oil and gas, power generation, rail transportation, semiconductor, and utilities industries. The company was formerly known as Infotech Enterprises Limited and changed its name to Cyient Limited in May 2014. Cyient Limited was incorporated in 1991 and is headquartered in Hyderabad, India."},"city":{"0":"Hyderabad"},"phone":{"0":"91 40 6764 1000"},"website":{"0":"https:\/\/www.cyient.com"},"grossProfits":{"0":16973000000},"totalCash":{"0":11640000512},"totalDebt":{"0":16551999488},"totalRevenue":{"0":50109001728},"totalCashPerShare":{"0":106.541},"revenuePerShare":{"0":458.657},"bookValue":{"0":268.767},"priceToBook":{"0":3.0176694},"marketCap":{"0":89444212736},"averageVolume":{"0":187619},"fiftyTwoWeekHigh":{"0":1084},"fiftyTwoWeekLow":{"0":720},"logo_url":{"0":"https:\/\/logo.clearbit.com\/cyient.com"}}