{"sector":{"0":"Consumer Defensive"},"longName":{"0":"Dabur India Limited"},"fullTimeEmployees":{"0":5144},"longBusinessSummary":{"0":"Dabur India Limited operates as a fast-moving consumer goods company worldwide. It operates through Consumer Care Business, Foods Business, Retail Business, and Other segments. The company manufactures and sells health supplements under the Dabur Chyawanprash, Dabur Vita, Dabur Honey, Dabur Immunity Kit, Dabur Vedic Suraksha Tea, and Dabur Glucose brands; digestive products under the Dabur Hajmola, Pudin Hara, Hingoli, Dabur Nature Care, and Sat Isabgol brands; and shampoos under the Dabur Almond and Vatika brands. It also offers hair oils under the Dabur Amla, Vatika, Dabur Almond, and Anmol brands; skin care products under the Dabur Gulabari, Oxylife, and Dabur Fem brands; and oral care products under the Dabur Red Paste, Dabur Meswak, Dabur Babool, Dabur Lal Dant Manjan, Dabur Red Pulling Oil, and Dabur Dant Rakshak Ayurvedic Paste brands. In addition, the company provides fruit juices under the Real and Real Activ brands; various cooking pastes under the Hommade brand; and milk-based beverages under the Real Milk Power brand. Further, it offers energizers and rejuvenators under the Shilajit, Shilajit Gold, Shilajit Double Gold, and Dabur Musli Gold names; cough and cold products under the Dabur Honitus and Dabur Tulsi Drops brands name; health juices; women's health products, such as Dabur Dashmularishta and Dabur Ashokarishta; ayurvedic baby massage oil for babies under the Dabur Lal Tail name; and ayurvedic ethical products. Additionally, the company provides mosquito repellents under the Odomos brand name; air fresheners under the Odonil name; toilet cleaners under the Sanifresh Shine brand name; dish wash products under the Odopic name; and natural gum products under brand name DABISCO. It also operates specialized beauty retail stores that offer a range of cosmetics, fragrances, skin care, and personal care products, as well as beauty and fashion accessories under the NewU brand name. Dabur India Limited was founded in 1884 and is based in Ghaziabad, India."},"city":{"0":"Ghaziabad"},"phone":{"0":"91 12 0396 2100"},"website":{"0":"https:\/\/www.dabur.com"},"grossProfits":{"0":51885500000},"totalCash":{"0":14138600448},"totalDebt":{"0":10300999680},"totalRevenue":{"0":110995701760},"totalCashPerShare":{"0":7.998},"revenuePerShare":{"0":62.807},"bookValue":{"0":40.399},"priceToBook":{"0":13.897622},"marketCap":{"0":992565002240},"averageVolume":{"0":2236329},"fiftyTwoWeekHigh":{"0":610.75},"fiftyTwoWeekLow":{"0":482.25},"logo_url":{"0":"https:\/\/logo.clearbit.com\/dabur.com"}}