{"sector":{"0":"Technology"},"longName":{"0":"eClerx Services Limited"},"fullTimeEmployees":{"0":16171},"longBusinessSummary":{"0":"eClerx Services Limited provides data management, analytics, and process outsourcing services in the United States, the United Kingdom, Europe, and the Asia Pacific. The company offers customer experience solutions for business process optimization and customer interaction monitoring; field technical operations services for avoidable truck roll, dispatch services, connected homes, return merchandise authorization, and revenue assurance; omnichannel customer support services; and advanced and digital analytics, and enterprise business intelligence solutions. It also provides and robotic process automation, Q-clips, workforce manager solutions, as well as chatbots and QA testing with webassure. In addition, the company offers digital solutions, such as speech and chat analytics, tag audits and implementation, data management and visualization, forecasting, personalization, social media services, A\/B testing and optimization, reporting and automation, analysis and insights, and consulting and process optimization. Further, it provides derivative trade support, cash securities operations, regulatory compliance and data, document management, and analytics solutions, as well as technology products. The company serves financial services, cable and telecommunications, retail, fashion, media and entertainment, manufacturing, travel and leisure, software, and high-tech industries. eClerx Services Limited was incorporated in 2000 and is based in Mumbai, India."},"city":{"0":"Mumbai"},"phone":{"0":"91 22 6614 8301"},"website":{"0":"https:\/\/www.eclerx.com"},"grossProfits":{"0":8724010000},"totalCash":{"0":6875639808},"totalDebt":{"0":1631239936},"totalRevenue":{"0":22919200768},"totalCashPerShare":{"0":138.482},"revenuePerShare":{"0":456.334},"bookValue":{"0":383.322},"priceToBook":{"0":3.3375335},"marketCap":{"0":43303055360},"averageVolume":{"0":50129},"fiftyTwoWeekHigh":{"0":1980},"fiftyTwoWeekLow":{"0":1221},"logo_url":{"0":"https:\/\/logo.clearbit.com\/eclerx.com"}}