{"sector":{"0":"Industrials"},"longName":{"0":"Engineers India Limited"},"fullTimeEmployees":{"0":2725},"longBusinessSummary":{"0":"Engineers India Limited, an engineering consultancy company, provides design, engineering, procurement, construction, and integrated project management services primarily for oil and gas, and petrochemical industries in India and internationally. The company operates through two segments, Consultancy & Engineering Projects, and Turnkey Projects. It also offers supply chain management services, such as supplier\/contractor registration and revalidation, contracting and purchasing of goods\/services\/works, expediting, inspection, logistics, supplier\/contractor performance review, etc.; and develops various process technologies for petroleum refining, oil and gas processing, and aromatics industries. In addition, the company provides construction services comprising pre-construction activities, including bid management process, plot plan review\/heavy lift study, etc.; and construction services comprising site construction management, liaison with statutory authorities, construction quality and warehouse management, HSE management, contracts administration, pre commissioning and commissioning assistance, and contract and site closing services. Further, it offers heat and mass transfer equipment design, environment engineering, specialist materials and maintenance, and plant operations and safety services; and pre-feed and feed engineering services for a range of processes in the hydrocarbon processing industry. Additionally, the company provides project management, third party inspection, quality assurance, independent engineer and lender's engineer services, and project appraisal and project execution services. Engineers India Limited was incorporated in 1965 and is headquartered in New Delhi, India."},"city":{"0":"New Delhi"},"phone":{"0":"91 11 2676 2121"},"website":{"0":"https:\/\/www.engineersindia.com"},"grossProfits":{"0":5608535000},"totalCash":{"0":14679701504},"totalDebt":{"0":37215000},"totalRevenue":{"0":29814943744},"totalCashPerShare":{"0":26.047},"revenuePerShare":{"0":52.364},"bookValue":{"0":38.609},"priceToBook":{"0":2.04227},"marketCap":{"0":44348551168},"averageVolume":{"0":4179574},"fiftyTwoWeekHigh":{"0":87.8},"fiftyTwoWeekLow":{"0":56},"logo_url":{"0":"https:\/\/logo.clearbit.com\/engineersindia.com"}}