{"sector":{"0":"Consumer Cyclical"},"longName":{"0":"Exide Industries Limited"},"fullTimeEmployees":{"0":5163},"longBusinessSummary":{"0":"Exide Industries Limited designs, manufactures, markets, and sells lead acid storage batteries in India and internationally. The company operates in two segments, Automotive and Industrial. It offers automotive, industrial, genset, solar, inverter, institutional uninterrupted power supply (UPS), and submarine batteries, as well as home UPS systems, integrated power back-up systems, and e-rickshaw vehicles. The company also manufactures and supplies recycled lead and lead alloys; offers lithium ion batteries; produces and distributes industrial battery chargers, rectifiers, and parts; and provides energy storage solutions, as well as engages in the non-conventional energy business. Further, the company offers solutions in the areas of equipment selection, battery sizing, optimum room layout, installation, operation, and maintenance. It sells its batteries under the Exide, Index, Dynex, SF Sonic, Black Panther, Nexcharge, Chloride, and CEIL brand names through a distribution network of approximately 70,000 direct and indirect dealers. The company's products are used in power, solar, railways, telecom, UPS, projects, traction, and other industries. Exide Industries Limited was formerly known as Chloride Industries Ltd. and changed its name to Exide Industries Limited in August 1995. The company was founded in 1916 and is headquartered in Kolkata, India."},"city":{"0":"Kolkata"},"phone":{"0":"91 33 2302 3400"},"website":{"0":"https:\/\/www.exideindustries.com"},"grossProfits":{"0":40670900000},"totalCash":{"0":9105300480},"totalDebt":{"0":5195100160},"totalRevenue":{"0":142454505472},"totalCashPerShare":{"0":10.732},"revenuePerShare":{"0":167.345},"bookValue":{"0":85.631},"priceToBook":{"0":2.104962},"marketCap":{"0":153347686400},"averageVolume":{"0":3200973},"fiftyTwoWeekHigh":{"0":194.2},"fiftyTwoWeekLow":{"0":130.25},"logo_url":{"0":"https:\/\/logo.clearbit.com\/exideindustries.com"}}