{"sector":{"0":"Financial Services"},"longName":{"0":"The Federal Bank Limited"},"fullTimeEmployees":{"0":12641},"longBusinessSummary":{"0":"The Federal Bank Limited provides a range of banking and financial services in India. It operates through four segments: Treasury, Corporate\/Wholesale Banking, Retail Banking, and Other Banking Operations. The company's deposit products include savings accounts, current accounts, noor personal accounts, demat accounts, salary accounts, fixed deposits, cash certificates, recurring deposits, exchange earners' foreign currency accounts, gilt accounts, and NRI deposit schemes. Its loan portfolio comprises personal, gold, housing, car, property, educational and career, instant digital, SME business, agri and agri allied, and other loans; loans against sovereign gold bonds and fixed deposit; term loans, project finance, and working capital loans; and debit and credit cards. The company also provides life, health, and general insurance products; cash management, wealth management, and merchant banking services; mutual funds, sovereign gold bonds, online trading, and national pension system; treasury products; and remittance, fund transfer, payment and collection, bill discounting, bank guarantees, letter of credit, packing credit limit, trade finance, LC bill discounting, internet banking, mobile banking, ATM, and tele banking services. As of March 31, 2022, The Federal Bank Limited operated 1,282 branches and 1,885 ATMs\/recyclers. The company was formerly known as Travancore Federal Bank Limited and changed its name to The Federal Bank Limited in March 1947. The Federal Bank Limited was incorporated in 1931 and is based in Aluva, India."},"city":{"0":"Aluva"},"phone":{"0":"91 48 4262 3620"},"website":{"0":"https:\/\/www.federalbank.co.in"},"grossProfits":{"0":72384222000},"totalCash":{"0":151073996800},"totalDebt":{"0":254978801664},"totalRevenue":{"0":82645721088},"totalCashPerShare":{"0":71.691},"revenuePerShare":{"0":39.286},"bookValue":{"0":77.918},"priceToBook":{"0":1.7845684},"marketCap":{"0":292287283200},"averageVolume":{"0":13883095},"fiftyTwoWeekHigh":{"0":142.2},"fiftyTwoWeekLow":{"0":82.5},"logo_url":{"0":"https:\/\/logo.clearbit.com\/federalbank.co.in"}}