{"sector":{"0":"Technology"},"longName":{"0":"Firstsource Solutions Limited"},"fullTimeEmployees":{"0":26557},"longBusinessSummary":{"0":"Firstsource Solutions Limited provides business process management services in the United Kingdom, the United States, Asia, and internationally. The company offers various services across the customer lifecycle, including acquisition, account servicing, collection, and retentions; complaints handling and resolution, mortgage processing and invoice financing, and asset-based lending; compliance and risk management; lead management; sales conversion & onboarding; analytics and business intelligence; digital collections; dispute management; factoring & discounting; default management; and fraud management, as well as mortgage solutions including mortgage value chain origination, underwriting, title, post-closing, servicing, and collections. It also provides digitally enabled customer engagement solutions comprising eligibility & enrollment services; debt collections; digital mailroom operations; claims adjudication & adjustments; receivables management; intelligent automated; eligibility & enrollment; intelligent data capture; and telehealth tech support. In addition, the company offers customer experience management and digitally enabled contact center solutions, such as tier 1 and tier 2 customer support; self-service\/contact avoidance; complaints handling and remediation; inbound and outbound sales; retention and loyalty; customer insights\/analytics; and revenue generation, as well as meter 2 cash operations; self-service\/digital deflection; customer insights\/automation; and debt management. It serves the banking and financial services, healthcare, telecom and media, insurance, mortgage, and utilities sectors. The company was formerly known as ICICI Onesource Limited and changed its name to Firstsource Solutions Limited in November 2006. The company was incorporated in 2001 and is based in Mumbai, India. Firstsource Solutions Limited is a subsidiary of RPSG Ventures Limited."},"city":{"0":"Mumbai"},"phone":{"0":"91 22 6666 0888"},"website":{"0":"https:\/\/www.firstsource.com"},"grossProfits":{"0":19052240000},"totalCash":{"0":2013580032},"totalDebt":{"0":18195869696},"totalRevenue":{"0":59087089664},"totalCashPerShare":{"0":2.961},"revenuePerShare":{"0":86.833},"bookValue":{"0":42.444},"priceToBook":{"0":2.4102347},"marketCap":{"0":69829165056},"averageVolume":{"0":2272797},"fiftyTwoWeekHigh":{"0":191.4},"fiftyTwoWeekLow":{"0":93},"logo_url":{"0":"https:\/\/logo.clearbit.com\/firstsource.com"}}