{"sector":{"0":"Consumer Cyclical"},"longName":{"0":"Garware Technical Fibres Limited"},"fullTimeEmployees":{"0":1170},"longBusinessSummary":{"0":"Garware Technical Fibres Limited manufactures and sells various technical textile products in India and internationally. It operates through two segments, Synthetic Cordage; and Fibre and Industrial Products and Projects. It offers fishing nets, ropes, and twines for the deep-sea fishing industry; aquaculture cages and predator systems; synthetic ropes for power transmission and marine hawsers for shipping, mooring, and towing applications; and yarn and thread solutions for various applications, such as portable bag closing machines and port bagging threads, shoe stitching, and manufacture of fibrillated bulk containers under the Garlon brand. The company also provides sports products, including soccer, soccer ball carry, tennis, handball, volleyball, beach volleyball, SKI, swimming pool, hockey, ice hockey, basketball, golf, badminton, and cricket nets, as well as baseball batting cage, rapelling, slithering, and fitness rope\/battle ropes under Sportiva brand name; coated fabric products for use in truck tarpaulins, awnings, tents, hangar covers, inflatable bouncies, bio gas covers, trailer curtains, oil booms, and other applications; and agricultural products comprising agriculture shade, sericulture, insect, fencing, floriculture, crop support, grape, and anti-bird nets, as well as staking cords. In addition, it offers geo-synthetics products for use in field of civil engineering and infrastructure development. The company was formerly known as Garware-Wall Ropes Limited and changed its name to Garware Technical Fibres Limited in July 2018. Garware Technical Fibres Limited was incorporated in 1976 and is headquartered in Pune, India."},"city":{"0":"Pune"},"phone":{"0":"91 20 2799 0301"},"website":{"0":"https:\/\/www.garwarefibres.com"},"grossProfits":{"0":8168973000},"totalCash":{"0":1740161024},"totalDebt":{"0":983161984},"totalRevenue":{"0":13249243136},"totalCashPerShare":{"0":84.401},"revenuePerShare":{"0":642.611},"bookValue":{"0":370.499},"priceToBook":{"0":8.4097395},"marketCap":{"0":64242188288},"averageVolume":{"0":8594},"fiftyTwoWeekHigh":{"0":3754.85},"fiftyTwoWeekLow":{"0":2619.8},"logo_url":{"0":"https:\/\/logo.clearbit.com\/garwarefibres.com"}}