{"sector":{"0":"Healthcare"},"longName":{"0":"Glenmark Pharmaceuticals Limited"},"fullTimeEmployees":{"0":15415},"longBusinessSummary":{"0":"Glenmark Pharmaceuticals Limited, together with its subsidiaries, develops, manufactures, and markets pharmaceutical products in India, North America, Latin America, Europe, Japan, and internationally. The company provides branded and generic formulations in the therapeutic areas of dermatology, respiratory, and oncology; and various active pharmaceutical ingredients. Its product pipeline includes GBR 310, a biosimilar candidate, which is in Phase 2 clinical trial for the treatment of asthma and chronic idiopathic urticaria; and GRC 39815, a retinoid-related orphan receptor gamma t (ROR?t) inverse agonist, which is in Phase 1 clinical trial for the treatment of chronic obstructive pulmonary disease; GRC 17536, a targeting transient receptor potential ankyrin 1 inhibitor, which is in Phase 2 clinical trial for the treatment of diabetic peripheral neuropathy; and GRC 54276, a hematopoietic progenitor kinase 1 inhibitor, which is in Phase 1 clinical trial for the treatment of solid tumors. The company's pipeline also comprises ISB 1342, CD38 X CD3 bispecific antibody, which is in Phase 1 clinical trial for the treatment of relapsed\/refractory multiple myeloma; ISB 1442, a CD38 x CD47 immune cell engager, which is in Phase 1 clinical trial for the treatment of relapsed\/refractory multiple myeloma; ISB 880, a IL-1RAP antibody, which is in Phase 1 clinical trial for the treatment of autoimmune diseases; and ISB 830, a OX40 antagonist, which is in Phase 2 clinical trial for the treatment of atopic dermatitis. In addition, it offers Ryaltris nasal spray for the treatment of seasonal allergic rhinitis. The company was incorporated in 1977 and is based in Mumbai, India."},"city":{"0":"Mumbai"},"phone":{"0":"91 22 4018 9999"},"website":{"0":"https:\/\/www.glenmarkpharma.com"},"grossProfits":{"0":77567990000},"totalCash":{"0":14115149824},"totalDebt":{"0":39620210688},"totalRevenue":{"0":124084772864},"totalCashPerShare":{"0":50},"revenuePerShare":{"0":439.695},"bookValue":{"0":230.115},"priceToBook":{"0":1.8432088},"marketCap":{"0":119681556480},"averageVolume":{"0":1182707},"fiftyTwoWeekHigh":{"0":531.2},"fiftyTwoWeekLow":{"0":348.5},"logo_url":{"0":"https:\/\/logo.clearbit.com\/glenmarkpharma.com"}}