{"sector":{"0":"Basic Materials"},"longName":{"0":"Gujarat Narmada Valley Fertilizers & Chemicals Limited"},"fullTimeEmployees":{"0":2401},"longBusinessSummary":{"0":"Gujarat Narmada Valley Fertilizers & Chemicals Limited manufactures and markets fertilizers and chemicals in India and internationally. It offers fertilizers, such as neem coated urea, ammonium nitrophosphate, neem de-oiled cake, Neem Manure, and neem pesticides under the NARMADA brand; and various neem based products, including soaps, hand and face wash products, and shampoos. The company also trades in di-ammonium phosphate, muriate of potash, ammonium sulphate, single super phosphate, and city compost. In addition, it provides industrial chemicals, such as methanol, acetic acid, toluene di \u0096 isocyanate, aniline, concentrated nitric acid, weak nitric acid, formic acid, ammonium nitrate, ethyl acetate, methyl formate, calcium carbonate, nitrobenzene, catsol, and technical grade urea, as well as other products comprising hydrochloric acid, liquid nitrogen, ortho-toluene diamine, meta-toluene diamine, dilute sulphuric acid, dilute nitric acid, and sodium hypochlorite. Further, the company offers various information technology services consisting of public key infrastructure and digital signature certificate, time stamping, e-procurement, e-governance, data center, CCTV, cloud, software application development, authentication, and payment gateway services. The company was formerly known as Gujarat Narmada Valley Fertilizers Co. Ltd. Gujarat Narmada Valley Fertilizers & Chemicals Limited was incorporated in 1976 and is headquartered in Bharuch, India."},"city":{"0":"Bharuch"},"phone":{"0":"91 26 4224 7001"},"website":{"0":"https:\/\/www.gnfc.in"},"grossProfits":{"0":33829800000},"totalCash":{"0":12467500032},"totalDebt":{"0":17700000},"totalRevenue":{"0":99441598464},"totalCashPerShare":{"0":80.225},"revenuePerShare":{"0":639.812},"bookValue":{"0":349.836},"priceToBook":{"0":1.5921746},"marketCap":{"0":86568386560},"averageVolume":{"0":1616332},"fiftyTwoWeekHigh":{"0":912},"fiftyTwoWeekLow":{"0":436.7},"logo_url":{"0":"https:\/\/logo.clearbit.com\/gnfc.in"}}