{"sector":{"0":"Consumer Defensive"},"longName":{"0":"Godrej Agrovet Limited"},"fullTimeEmployees":{"0":2711},"longBusinessSummary":{"0":"Godrej Agrovet Limited, an agri-business company, provides products and services that enhance crop and livestock yields in India and internationally. It operates through Animal Feed, Crop Protection, Vegetable Oil, Real Estate, Seed Business, Energy Generation through Windmill, and Cattle Breeding segments. The company offers animal feed, such as cattle, poultry, and aqua feed. It also engages in the oil palm cultivation with approximately 75,000 hectares of plantations across Andhra Pradesh, Telangana, Tamil Nadu, Goa, Maharashtra, and Mizoram producing crude palm oil, crude palm kernel oil, and palm kernel cake. In addition, the company produces and markets crop protection products, including plant growth regulators, bio-stimulants, herbicides, insecticides, fungicides, and fertilizers and organic manures. Further, it manufactures and markets poultry and meat products under the Real Good Chicken name; vegetarian and non-vegetarian ready-to-cook products under the Godrej Yummiez name; and processes and sells milk and milk products under the Godrej Jersey brand. Additionally, the company produces agrochemical active ingredients, intermediates, bulk and formulations, and pharmaceutical intermediates. The company was incorporated in 1991 and is based in Mumbai, India. Godrej Agrovet Limited is a subsidiary of Godrej Industries Limited."},"city":{"0":"Mumbai"},"phone":{"0":"91 22 2519 4416"},"website":{"0":"https:\/\/www.godrejagrovet.com"},"grossProfits":{"0":19644800000},"totalCash":{"0":343200000},"totalDebt":{"0":15986799616},"totalRevenue":{"0":88164597760},"totalCashPerShare":{"0":1.786},"revenuePerShare":{"0":458.728},"bookValue":{"0":100.426},"priceToBook":{"0":4.677076},"marketCap":{"0":90252386304},"averageVolume":{"0":76286},"fiftyTwoWeekHigh":{"0":593},"fiftyTwoWeekLow":{"0":441},"logo_url":{"0":"https:\/\/logo.clearbit.com\/godrejagrovet.com"}}