{"sector":{"0":"Industrials"},"longName":{"0":"Graphite India Limited"},"fullTimeEmployees":{"0":1719},"longBusinessSummary":{"0":"Graphite India Limited manufactures and sells graphite electrodes, and carbon and graphite specialty products in India and internationally. The company operates in two segments, Graphite and Carbon, and Others. It offers a range of graphite electrodes with various diameter and power for AC and DC furnaces. The company also provides extruded graphite in the form of rods and blocks, mini rods, graphite tubes, heat exchanger tubes, molded mold and isostatically moulded graphite, machined components of carbon and graphite, carbon graphite\/bricks, and carbon composites\/brake discs. In addition, it offers calcined petroleum coke, carbon electrode paste, graphite granules and fines, and carbonaceous materials to aluminum, steel, ferro alloy, and foundry castings industries; and impervious graphite heat exchangers, which are used as condensers, coolers, heaters, re-boilers, evaporators, interchangers, and graphite columns for distillation, absorption and scrubbing, ejector systems, and centrifugal pumps. Further, the company provides HCl synthesis and dry HCl gas generation units, and H2SO4\/HCl concentration and acid dilution cooling units; bursting discs, thermos-wells, pipes, and pipe fittings; glass fiber reinforced plastic pipes, joints, and fittings; and high speed, alloy tool, and powder metallurgy steels for cutting tools. Additionally, it generates and sells electricity through a hydel power plant. The company was founded in 1962 and is headquartered in Kolkata, India. Graphite India Limited is a subsidiary of Emerald Company Private Limited."},"city":{"0":"Kolkata"},"phone":{"0":"91 33 4002 9600"},"website":{"0":"https:\/\/www.graphiteindia.com"},"grossProfits":{"0":18180900000},"totalCash":{"0":17470799872},"totalDebt":{"0":4355500032},"totalRevenue":{"0":32825100288},"totalCashPerShare":{"0":89.422},"revenuePerShare":{"0":167.942},"bookValue":{"0":227.096},"priceToBook":{"0":1.6440184},"marketCap":{"0":72950726656},"averageVolume":{"0":586263},"fiftyTwoWeekHigh":{"0":587},"fiftyTwoWeekLow":{"0":348.25},"logo_url":{"0":"https:\/\/logo.clearbit.com\/graphiteindia.com"}}