{"sector":{"0":"Industrials"},"longName":{"0":"Hindustan Aeronautics Limited"},"fullTimeEmployees":{"0":24375},"longBusinessSummary":{"0":"Hindustan Aeronautics Limited engages in the design, development, manufacture, repair, overhaul, upgrade, and servicing of aircraft, helicopters, aero-engines, avionics, accessories, and aerospace structures in India and internationally. The company provides power plants; materials, including castings, general and precision forgings, powder metallurgy products, rubber products, rolled rings, and composites; and aerospace products, which include structures, tanks, and cryogenic engines. It also offers avionics, such as inertial navigation systems, auto stabilizers, head-up displays, laser range systems, flight data recorders, communication equipment, radio navigation equipment, airborne secondary radars, missile inertial navigation systems, radar computers, and ground radars; and system and accessories comprising hydraulic, wheels and brake, flight control, oxygen, and fuel management systems, as well as ejector release units, panel instruments, gyroscopic\/barometric instruments, and hydraulic pumps. In addition, the company provides various services in the areas of aircraft and helicopters MRO, and power plants, as well as systems, accessories, and avionics. It serves space, defense, and civil industries. The company has a collaboration agreement with Rolls-Royce Holdings plc to expand the supply chain for Adour engine parts in India to serve military customers. Hindustan Aeronautics Limited was incorporated in 1963 and is based in Bengaluru, India."},"city":{"0":"Bengaluru"},"phone":{"0":"91 80 2232 0001"},"website":{"0":"https:\/\/hal-india.co.in"},"grossProfits":{"0":140400800000},"totalCash":{"0":143471902720},"totalDebt":{"0":492700000},"totalRevenue":{"0":266266492928},"totalCashPerShare":{"0":429.059},"revenuePerShare":{"0":796.428},"bookValue":{"0":418.311},"priceToBook":{"0":6.05112},"marketCap":{"0":846690516992},"averageVolume":{"0":933465},"fiftyTwoWeekHigh":{"0":2811.8},"fiftyTwoWeekLow":{"0":1212.05},"logo_url":{"0":"https:\/\/logo.clearbit.com\/hal-india.co.in"}}