{"sector":{"0":"Industrials"},"longName":{"0":"Havells India Limited"},"fullTimeEmployees":{"0":5797},"longBusinessSummary":{"0":"Havells India Limited, a fast-moving electrical goods company, manufactures, trades, and sells various consumer electrical and electronic products in India and internationally. It operates through six segments: Switchgears, Cables, Lighting and Fixtures, Electrical Consumer Durables, Lloyd Consumer, and Others. The company offers switches; switchgears, such as circuit breakers, energy savers, human safety equipment, distribution boards, surge protection devices, and control and monitoring devices, as well as magnetic contractor, thermal overload relays, and starters; lighting products; appliances, including cooking, food preparation, brewing, garment care, climate control appliances, and air purifiers; and power, control, fire survival cables. It also provides fans comprising ceiling, table, pedestal, wall, ceiling mounting, personal, and domestic exhaust fans; storage, instant, instantaneous gas, solar, linea online, heat, and auto immersion water heaters; centrifugal, mono block, submersible, and borewell submersible pumps; water purifiers; air conditioners; televisions; refrigerator; washing machines; dishwashers; air circulators; heavy duty exhaust fans; and air coolers. In addition, the company crane duty, smoke, brake, inverter duty, and energy efficient motors; reactive power solutions; personal grooming products; solar rooftop on grid, solar off grid, solar portables, and solar on grid inverter solutions; and power solutions, including power capacitors, IOT enabled IPFC relays, HD harmonic detuned reactors, IOT enabled APFC panels, high PIV thyristor switches, SVG and active harmonic filters, and hybrid panels. The company offers its products under the Havells, Lloyd, Crabtree, Standard, and REO brands. It also exports its products to approximately 60 countries. Havells India Limited was founded in 1958 and is based in Noida, India."},"city":{"0":"Noida"},"phone":{"0":"91 12 0333 1000"},"website":{"0":"https:\/\/www.havells.com"},"grossProfits":{"0":44449700000},"totalCash":{"0":19728300032},"totalDebt":{"0":2025500032},"totalRevenue":{"0":160144195584},"totalCashPerShare":{"0":31.437},"revenuePerShare":{"0":255.791},"bookValue":{"0":75.188},"priceToBook":{"0":14.629328},"marketCap":{"0":688901914624},"averageVolume":{"0":743457},"fiftyTwoWeekHigh":{"0":1419},"fiftyTwoWeekLow":{"0":1024.5},"logo_url":{"0":"https:\/\/logo.clearbit.com\/havells.com"}}