{"sector":{"0":"Technology"},"longName":{"0":"HCL Technologies Limited"},"fullTimeEmployees":{"0":219325},"longBusinessSummary":{"0":"HCL Technologies Limited offers software development, business process outsourcing, and infrastructure management services worldwide. The company operates in three segments: IT and Business Services; Engineering and R&D Services; and Products & Platforms. The IT and Business Services segment provides IT and business services, such as application, infrastructure, and digital process operations; digital transformation services for digital and analytics; IoTWoRKs; and cloud native and cybersecurity solutions. The Engineering and R&D Services segment offers engineering services and solutions to software, embedded, mechanical, VLSI, and platform engineering that support the lifecycle of products for hardware and software industries. The Products & Platforms segment provides modernized software products for technology and industry specific requirements. This segment also offers HCL software; DRYiCE software, an organic IP-based software; Actian Avalanche Hybrid Cloud Data platform; and Nippon, a workforce analytics solution. It also offers hybrid cloud, digital workplace, and cloud native services, as well as service integration and management. The company serves financial services, manufacturing, life sciences and healthcare, public services, retail and CPG, technology and services, telecom, media, publishing, and entertainment industries. HCL Technologies Limited was founded in 1976 and is headquartered in Noida, India."},"city":{"0":"Noida"},"phone":{"0":"91 11 2643 6336"},"website":{"0":"https:\/\/www.hcltech.com"},"grossProfits":{"0":4408000000},"totalCash":{"0":1923000064},"totalDebt":{"0":824000000},"totalRevenue":{"0":12078000128},"totalCashPerShare":{"0":0.71},"revenuePerShare":{"0":4.459},"bookValue":{"0":3.096},"priceToBook":{"0":335.69122},"marketCap":{"0":2820317118464},"averageVolume":{"0":2903203},"fiftyTwoWeekHigh":{"0":1359.4},"fiftyTwoWeekLow":{"0":877.35},"logo_url":{"0":"https:\/\/logo.clearbit.com\/hcltech.com"}}