{"sector":{"0":"Financial Services"},"longName":{"0":"Housing Development Finance Corporation Limited"},"fullTimeEmployees":{"0":3599},"longBusinessSummary":{"0":"Housing Development Finance Corporation Limited provides housing finance to individuals and corporate customers in India. It operates through Loans, Life Insurance, General Insurance, Asset Management, and Others segments. The company accepts fixed deposits, such as monthly income plans, non-cumulative interest plans, annual income plans, and cumulative options; and trust deposits. It offers loans for the purchase and construction of houses; home renovation and extension, plot, and top-up loans; loans to agriculturists, planters, horticulturists, and dairy farmers; loans for the salaried\/self-employed individuals; loans for non-resident Indians; loans against property; and commercial property and plots loans, as well as education loans. In addition, the company provides cross-selling products and services; investment advisory services; life insurance products; general insurance products, including motor, health, travel, crop, home, personal accident, property, marine, aviation, and liability insurance; venture capital funds; asset management services comprising portfolio management, mutual fund, and property investment management; and other services consisting of project management and investment consultancy services. As of March 31, 2022, it operated through a network of 672 offices; and 3 offices in Dubai, London, and Singapore. The company was incorporated in 1977 and is based in Mumbai, India."},"city":{"0":"Mumbai"},"phone":{"0":"91 22 6631 6000"},"website":{"0":"https:\/\/www.hdfc.com"},"grossProfits":{"0":1066371600000},"totalCash":{"0":1138196217856},"totalDebt":{"0":3538277892096},"totalRevenue":{"0":980015972352},"totalCashPerShare":{"0":627.787},"revenuePerShare":{"0":541.344},"bookValue":{"0":814.73},"priceToBook":{"0":3.2373917},"marketCap":{"0":4776720334848},"averageVolume":{"0":2801426},"fiftyTwoWeekHigh":{"0":2933.8},"fiftyTwoWeekLow":{"0":2026},"logo_url":{"0":"https:\/\/logo.clearbit.com\/hdfc.com"}}