{"sector":{"0":"Technology"},"longName":{"0":"HFCL Limited"},"fullTimeEmployees":{"0":2100},"longBusinessSummary":{"0":"HFCL Limited manufactures and sells telecom products in India and internationally. It operates in Telecom Products; and Turnkey Contracts and Services segments. The company offers optical fiber cables, such as aerial, armoured, FTTx, micro, and unarmoured cables; microwave solutions, including packet microwave, hybrid microwave, and small cell radio solutions, as well as network management systems; and gigabit passive optical network systems, including optical line terminals (OLT), mini OLT, and optical network terminals. It also provides power electronic solutions, including AC and DC power, network integrated control and monitoring, and power racks passive telecom infrastructure; battery management systems; and solar solutions comprising hybrid DC power systems, off grid solar plants, solar water pumps, and MPPT based solar charge controllers. In addition, the company offers telecom network solutions, including in-building system, optical fiber cable network, optical transmission solutions, as well as fiber solutions to the home, building, premises, and curb. Further, it provides network design, equipment supply, installation and commissioning, network integration, and post deployment warranty and AMC support for metro lines, mainline railways, and railway freight corridors; and various solutions consisting of communication\/IT\/telecom infrastructure, data center, disaster recovery and management, security, surveillance, traffic management, and citizen\/mobile applications, as well as power, water, waste, and other utility management. The company has a collaboration agreement with Qualcomm Technologies, Inc. for the design and development of 5G millimeter wave fixed wireless access customer premise equipment products. It serves telecom, security, and railway sectors. The company was formerly known as Himachal Futuristic Communications Limited and changed its name to HFCL Limited in October 2019. HFCL Limited was incorporated in 1987 and is based in New Delhi, India."},"city":{"0":"New Delhi"},"phone":{"0":"91 11 3520 9400"},"website":{"0":"https:\/\/www.hfcl.com"},"grossProfits":{"0":12234600000},"totalCash":{"0":3313100032},"totalDebt":{"0":7591199744},"totalRevenue":{"0":46226698240},"totalCashPerShare":{"0":2.429},"revenuePerShare":{"0":34.028},"bookValue":{"0":13.685},"priceToBook":{"0":5.385458},"marketCap":{"0":101453938688},"averageVolume":{"0":11887803},"fiftyTwoWeekHigh":{"0":101.35},"fiftyTwoWeekLow":{"0":51.55},"logo_url":{"0":"https:\/\/logo.clearbit.com\/hfcl.com"}}