{"sector":{"0":"Industrials"},"longName":{"0":"Hinduja Global Solutions Limited"},"fullTimeEmployees":{"0":21608},"longBusinessSummary":{"0":"Hinduja Global Solutions Limited provides business process management services in the United States, Canada, Europe, India, and internationally. It provides consumer facing services, such as consumer engagement, work at home, HGS work cloud solutions; business process optimization solutions, such as back-office, human resources outsourcing, and B2B services; and contact center transformation solutions, such as cognitive contact center, and contact center for analytics and intelligence. The company also offers digital solutions, including digital experience, automation, analytics, and cloud services; and healthcare services, such as enrollment, member engagement management, mailroom automation, provider and broker, and custom solutions consulting services. In addition, it is involved in investment activities; and the provision of contact center, consulting, call center, and offshoring services, as well as provides platform-based services to help health insurance companies. Further, the company offers digital marketing and consulting services; and cloud migration and cloud monitoring services. It serves customers in automotive, banking, financial, insurance, consumer electronics and technology, consumer packaged goods, healthcare, public, retail and ecommerce, travel and hospitality, and telecom sectors. The company was formerly known as HTMT Global Solutions Limited and changed its name to Hinduja Global Solutions Limited in December 2008. Hinduja Global Solutions Limited was founded in 1973 and is headquartered in Bengaluru, India."},"city":{"0":"Bengaluru"},"phone":{"0":"91 80 4643 1000"},"website":{"0":"https:\/\/hgs.cx"},"grossProfits":{"0":6735851000},"totalCash":{"0":35240128512},"totalDebt":{"0":3122962944},"totalRevenue":{"0":33762385920},"totalCashPerShare":{"0":843.179},"revenuePerShare":{"0":807.941},"bookValue":{"0":912.004},"priceToBook":{"0":1.4585462},"marketCap":{"0":27812485120},"averageVolume":{"0":57109},"fiftyTwoWeekHigh":{"0":1960},"fiftyTwoWeekLow":{"0":846},"logo_url":{"0":"https:\/\/logo.clearbit.com\/hgs.cx"}}