{"sector":{"0":"Energy"},"longName":{"0":"Hindustan Petroleum Corporation Limited"},"fullTimeEmployees":{"0":9065},"longBusinessSummary":{"0":"Hindustan Petroleum Corporation Limited refines and markets petroleum products in India and internationally. The company operates through Downstream Petroleum and All Other segments. It offers petrol, diesel, kerosene, liquefied petroleum gas (LPG), naphtha lubricants, specialties, and greases, as well as aviation turbine fuel; and markets and exports bulk fuels, bitumen, solvents, jet and marine fuel, marine lubes, household insecticides, hexane, propylene, jute batch oil, turpentine oil, carbon black feed stock, molten sulphur, and superior kerosene oil (SKO). The company is also involved in international trade activities, including crude oil imports, petroleum product imports\/exports, import\/export registration, shipping. Further, the company markets bulk fuels and petroleum products to industrial consumers like power plants, chemicals, fertilisers, shipping companies, and airlines. In addition, it offers LPG products under the HP Gas brand, as well as bulk LPG products for industries; and operates retail petrol pumps and pipelines for the transportation of petroleum products. Further, the company explores for and produces hydrocarbons, as well as provides management services for exploration and production blocks; and operates sugar ethanol-cogen plants in Bihar, and wind power plants in Maharashtra and Rajasthan. As of March 31, 2022, it operated through a marketing network of 137 regional offices; 70 depots; 53 LPG bottling plants; 47 aviation service facilities; 20,025 retail outlets; 1,638 SKO and light diesel oil dealers; and 6,243 LPG distributors, as well as 42 terminals, installation, and tap off points. The company was founded in 1910 and is headquartered in Mumbai, India. Hindustan Petroleum Corporation Limited is a subsidiary of Oil and Natural Gas Corporation Limited."},"city":{"0":"Mumbai"},"phone":{"0":"91 22 2286 3900"},"website":{"0":"https:\/\/www.hindustanpetroleum.com"},"grossProfits":{"0":260542800000},"totalCash":{"0":56053698560},"totalDebt":{"0":484977508352},"totalRevenue":{"0":3918257979392},"totalCashPerShare":{"0":39.515},"revenuePerShare":{"0":2762.223},"bookValue":{"0":228.586},"priceToBook":{"0":1.0287156},"marketCap":{"0":333572014080},"averageVolume":{"0":3440915},"fiftyTwoWeekHigh":{"0":332.2},"fiftyTwoWeekLow":{"0":200.05},"logo_url":{"0":"https:\/\/logo.clearbit.com\/hindustanpetroleum.com"}}