{"sector":{"0":"Financial Services"},"longName":{"0":"Housing and Urban Development Corporation Limited"},"fullTimeEmployees":{"0":703},"longBusinessSummary":{"0":"Housing and Urban Development Corporation Limited provides housing and infrastructure development in India. The company offers loans for housing projects, such as urban and rural housing, co-operative housing, community toilets, slum upgradation, staff housing, retail housing, repairs and renewals, land acquisition, and building technology, as well as implementing agencies comprising state government bodies, co-operative societies, corporate borrowers, and joint sectors. It also provides financing for infrastructure projects in the sectors of water supply; sewerage; drainage; solid waste management; roads and transport; power generation, transmission, distribution, and renovation; emerging sector; smart city; and social infrastructure component, such as National games village, stadiums, sports complexes, shooting ranges, parks and play grounds, health centers, government hospitals, schools and colleges, State Vidhan Sabha Sadans, police academies and stations, fire stations, courts\/collectorates\/office buildings, rehabilitation centers, auditoriums, convention halls, crematoriums, abattoirs, etc., as well as commercial infrastructure components, including office buildings, business\/trade centres, shopping malls, market complexes, theatres\/multiplexes\/entertainment centres, hotels, guest houses, terminal markets, multilevel parking, tourist centres etc. In addition, the company offers consultancy services, including URP services, environmental engineering, and government programs consultancy services; and disaster mitigation services. Further, it provides housing finance loans. Housing and Urban Development Corporation Limited was incorporated in 1970 and is based in New Delhi, India."},"city":{"0":"New Delhi"},"phone":{"0":"91 11 2464 9610"},"website":{"0":"https:\/\/www.hudco.org"},"grossProfits":{"0":26944200000},"totalCash":{"0":6442500096},"totalDebt":{"0":614991396864},"totalRevenue":{"0":27095599104},"totalCashPerShare":{"0":3.224},"revenuePerShare":{"0":13.82},"bookValue":{"0":62.395},"priceToBook":{"0":0.8350028},"marketCap":{"0":104298987520},"averageVolume":{"0":13085139},"fiftyTwoWeekHigh":{"0":58.85},"fiftyTwoWeekLow":{"0":30.6},"logo_url":{"0":"https:\/\/logo.clearbit.com\/hudco.org"}}