{"sector":{"0":"Financial Services"},"longName":{"0":"IDBI Bank Limited"},"fullTimeEmployees":{"0":16396},"longBusinessSummary":{"0":"IDBI Bank Limited provides banking and financial solutions to retail and corporate clients in India. It operates through Corporate\/Wholesale Banking, Retail Banking, Treasury, and Other Banking Operations segments. The company offers savings, current, and salary accounts, and fixed deposits; home, auto, education, and personal loans, as well as loans against properties and securities; debit, credit, and prepaid cards; phone, mobile, and Internet banking services; and investment advisory and capital market services. It also provides fund and non-fund-based assistance; packing credit to exporters; receivable buyout with recourse; channel financing for dealers of corporates; scheme for financing automated teller machines (ATMs)\/cash dispense vendors; technology upgrading fund scheme for textile and jute industries; and lending to non-banking finance companies\/housing finance companies and commercial real estate sector. In addition, the company offers bank guarantees, letters of credit, documentary collection, bill discounting, and foreign currency; cash management, treasury, trade finance, and remittance services; and debt syndication and advisory services. Further, it provides finance to micro, small, and medium enterprises; agriculture finance; and products and services for non-resident Indians. Additionally, the company offers information technology and security, and contact center services; merchant banking, stock broking, portfolio management of pension\/PF funds; and mutual fund, security trusteeship assignments, share pledge trustee, venture capital fund, safe keeping, escrow agency, and other trusteeship services, as well as acts as a trustee to securitization transactions and bond\/debentures. As of March 31, 2022, it operated 1,886 branches, 3,403 ATMs, and 58 e-lounges. The company was formerly known as IDBI Ltd. and changed its name to IDBI Bank Limited in May 2008. The company was founded in 1964 and is headquartered in Mumbai, India."},"city":{"0":"Mumbai"},"phone":{"0":"91 22 6655 3355"},"website":{"0":"https:\/\/www.idbibank.in"},"grossProfits":{"0":90208015000},"totalCash":{"0":129895899136},"totalDebt":{"0":216912199680},"totalRevenue":{"0":100393115648},"totalCashPerShare":{"0":12.055},"revenuePerShare":{"0":9.364},"bookValue":{"0":35.292},"priceToBook":{"0":1.540009},"marketCap":{"0":584392966144},"averageVolume":{"0":18226953},"fiftyTwoWeekHigh":{"0":61},"fiftyTwoWeekLow":{"0":30.5},"logo_url":{"0":"https:\/\/logo.clearbit.com\/idbibank.in"}}