{"sector":{"0":"Financial Services"},"longName":{"0":"IDFC First Bank Limited"},"fullTimeEmployees":{"0":27804},"longBusinessSummary":{"0":"IDFC First Bank Limited provides various banking, and financial products and services to corporates, individuals, multi- national companies, SMEs\/entrepreneurs, financial institutions, and the government in India. It operates through Treasury, Corporate and Wholesale Banking, Retail Banking, and Other Banking Business segments. The company provides savings, corporate salary, current, and business accounts; fixed and recurring deposits; debit, credit, and prepaid cards; and payment services. It also offers personal, consumer durable, home, car, two-wheeler, equipment hypothecation, business, working capital, professional, term, and micro enterprise loans, as well as loan against property and loans for women. In addition, the company provides corporate linked finance products, including sales bill\/purchase bill\/invoice discounting, vendor finance, dealer finance, and factoring\/receivables purchase; treasury and capital market services; and trade finance and services comprising import-export solutions, bank guarantees, remittances, etc. Further, it offers investment services consisting of mutual funds, gold bonds, demat and trading account, and investment linked insurance solutions; term, health, motor, home, travel, business, and pradhan mantri insurance products, as well as savings and annuity plans; and mobile, Internet banking, and customer care services. Additionally, the company provides cash management services; investment banking services; and investment management solutions. As of March 31, 2022, it operated 641 branches, 203 asset service branches, 719 ATMs and recyclers, and 601 rural business correspondent branches. The company was formerly known as IDFC Bank Limited and changed its name to IDFC First Bank Limited in January 2019. IDFC First Bank Limited was incorporated in 2014 and is based in Mumbai, India."},"city":{"0":"Mumbai"},"phone":{"0":"91 22 7132 5500"},"website":{"0":"https:\/\/www.idfcfirstbank.com"},"grossProfits":{"0":97289617000},"totalCash":{"0":148505001984},"totalDebt":{"0":566430072832},"totalRevenue":{"0":129850015744},"totalCashPerShare":{"0":23.826},"revenuePerShare":{"0":20.926},"bookValue":{"0":30.694},"priceToBook":{"0":1.9156839},"marketCap":{"0":365456130048},"averageVolume":{"0":39753631},"fiftyTwoWeekHigh":{"0":64.3},"fiftyTwoWeekLow":{"0":28.95},"logo_url":{"0":"https:\/\/logo.clearbit.com\/idfcfirstbank.com"}}