{"sector":{"0":"Financial Services"},"longName":{"0":"Indian Energy Exchange Limited"},"fullTimeEmployees":{"0":null},"longBusinessSummary":{"0":"Indian Energy Exchange Limited operates a power trading platform. It enables trading and price discovery of electricity and related products with risk management for participants of the electricity market. The company's products include Day-Ahead Market, a physical electricity trading market for deliveries for any\/some\/all 15 minute time blocks in 24 hours of next day starting from midnight; Term-Ahead-Market that provides a range of products allowing participants to buy\/sell electricity on intra-day, day-ahead contingency, and term ahead contracts; Real-Time Market, an auction session every half an hour with power to be delivered after 4 time blocks or an hour after gate closure of the auction; Renewable Energy Certificates to ease the purchase of renewable energy by the state utilities and obligated entities; Green Day-Ahead Market, a double-sided closed collective auction in renewable energy on a day-ahead basis; Cross-Border Electricity Trade, an endeavour towards building an integrated South Asian Power Market; and Energy Saving Certificates, a market-based instrument designed for the consumers in energy industries, such as aluminum, cement, thermal Power plant, distribution, utilities, refineries, railways, fertilizer, and iron and steel etc. Indian Energy Exchange Limited was incorporated in 2007 and is based in New Delhi, India."},"city":{"0":"Noida"},"phone":{"0":"91 11 3044 6511"},"website":{"0":"https:\/\/www.iexindia.com"},"grossProfits":{"0":4543296000},"totalCash":{"0":8489537024},"totalDebt":{"0":155924000},"totalRevenue":{"0":4861050880},"totalCashPerShare":{"0":9.419},"revenuePerShare":{"0":5.43},"bookValue":{"0":15.961},"priceToBook":{"0":8.77138},"marketCap":{"0":125813800960},"averageVolume":{"0":4989482},"fiftyTwoWeekHigh":{"0":272},"fiftyTwoWeekLow":{"0":129.25},"logo_url":{"0":"https:\/\/logo.clearbit.com\/iexindia.com"}}