{"sector":{"0":"Healthcare"},"longName":{"0":"Indoco Remedies Limited"},"fullTimeEmployees":{"0":7000},"longBusinessSummary":{"0":"Indoco Remedies Limited manufactures, markets, and sells formulations and active pharmaceutical ingredients in India and internationally. The company's products portfolio includes respiratory products, such as Karvol Plus, Febrex Plus, Dropizin, and Tuspel; stomatologicals products that include Sensodent-K, Sensoform Toothpaste, Sensoform Gum Paint, Rexidin M, Rexidin SRS, RR Sensoform Dental, Sensodent-KF, Poviclean, Rexidin, Sensodent-R, Snowdent, Kidodent, Rexidin Plus, and Dentogel; gastrointestinal products, such as Carmicide, Cyclopam, Cyclopam Plus, Cyclomeff, and Nosic; pain\/analgesics products that include Lignox A and Lignox ; and ophthal\/otologicals products, such as Renolen, Homide, Dexoren \u0096 S, Zincoren, Bfloren, Dexoren, Otorex, Mofloren-D, Mofloren \u0096 BF, Macuchek, and Mofloren LP. It also provides vitamins\/minerals\/nutrients that include Methycal, Cital UTI, SM Fibro, Coloferrin, Cal Aid, and MCBM DHA; urology products, such as Cital-H and Cital; Cloben G, Noxa, and Scabex for dermatology; ATM, Clygan, Vepan, and Oxipod for anti-infectives; Hemsyl for blood related therapies; MCBM 69 and D-Chiro for gynecological; Aloja and Aloja M for Anti-Diabetics; and Spear for anti-haemorrhoidal. In addition, the company provides analytical services, such as impurity profile, particle size analysis, heavy metal analysis, polymorphism and compatibility studies, extractables and leachables studies, lyophilization studies, reference and working standards, forced degradation studies, and chromatographic method development and validation services. Further, it offers architectural design, lighting, mechanical and utility engineering, project and construction management, electrical, control system, piping, structural design, data transfer system, and process engineering. The company was formerly known as Indo Continental Trading Company. Indoco Remedies Limited was founded in 1945 and is based in Mumbai, India."},"city":{"0":"Mumbai"},"phone":{"0":"91 22 6287 1000"},"website":{"0":"https:\/\/www.indoco.com"},"grossProfits":{"0":10448195000},"totalCash":{"0":197800000},"totalDebt":{"0":2566599936},"totalRevenue":{"0":15622200320},"totalCashPerShare":{"0":2.149},"revenuePerShare":{"0":169.626},"bookValue":{"0":77.959},"priceToBook":{"0":5.216203},"marketCap":{"0":37515575296},"averageVolume":{"0":103047},"fiftyTwoWeekHigh":{"0":458.9},"fiftyTwoWeekLow":{"0":307.65},"logo_url":{"0":"https:\/\/logo.clearbit.com\/indoco.com"}}