{"sector":{"0":"Financial Services"},"longName":{"0":"IndusInd Bank Limited"},"fullTimeEmployees":{"0":33582},"longBusinessSummary":{"0":"IndusInd Bank Limited provides various banking products and services to individuals, NRIs, business owners, corporates, and government and financial institutions. It operates through four segments: Treasury, Corporate\/Wholesale Banking, Retail Banking, and Other Banking Operations. The company offers current, savings, defense, and corporate salary; and fixed and FCNR, sweep in\/out deposits, senior citizen schemes, young saver deposits, and recurring and RFC deposits, as well as Rupee multiplier products. It also provides home, personal, car, two wheeler, gold, agricultural, and medical equipment loans, as well as loans against property and securities; micro-finance loans; MSME loans; business loans; loans to merchants and retailers; personal and professional loans; and loan on credit cards. In addition, the company offers transaction banking services, including letters of credit\/guarantees, structured trade and export finance, and import finance solutions, as well as cash management and remittance services; investment products, such as demat account, mutual fund, gold bond, national pension system, and equity trading; project finance, supply chain financing; investment advisory, strategic M&A, and other advisory services; and health, general, life, and card protection insurance. Further, it provides debit, credit, forex, and commercial cards; individual outward remittances, foreign currency bank notes and demand drafts, and travelers cheques; financial inclusion products; trade and foreign exchange accounts; real estate developer financing and bullion services; correspondent banking services; and forex and derivative desk, information and advisory, and remittances through forex channel services. As of June 30, 2022, the company had 5,939 branches and 2,783 ATMs in India. It also has representative offices in London, Dubai, and Abu Dhabi. IndusInd Bank Limited was incorporated in 1994 and is based in Mumbai, India."},"city":{"0":"Mumbai"},"phone":{"0":"91 22 2423 1999"},"website":{"0":"https:\/\/www.indusind.com"},"grossProfits":{"0":141153454000},"totalCash":{"0":592246472704},"totalDebt":{"0":406731194368},"totalRevenue":{"0":167928152064},"totalCashPerShare":{"0":764.06},"revenuePerShare":{"0":216.768},"bookValue":{"0":568.756},"priceToBook":{"0":2.1452081},"marketCap":{"0":953281150976},"averageVolume":{"0":3215972},"fiftyTwoWeekHigh":{"0":1275.8},"fiftyTwoWeekLow":{"0":763.2},"logo_url":{"0":"https:\/\/logo.clearbit.com\/indusind.com"}}