{"sector":{"0":"Energy"},"longName":{"0":"Indian Oil Corporation Limited"},"fullTimeEmployees":{"0":31254},"longBusinessSummary":{"0":"Indian Oil Corporation Limited, together with its subsidiaries, engages in the refining, pipeline transportation, and marketing of petroleum products in India. It is also involved in the exploration and production of crude oil and gas, and petrochemicals; and marketing of natural gas. The company's products include petrol\/gasoline, diesel\/gas oil, lubricants and greases, auto gas, cooking gas, kerosene, LPG, bulk\/industrial fuels, aviation fuel, marine oils, and bitumen. In addition, the company offers special products, such as carbon black feedstock, raw petroleum coke, sulphur, paraffin wax, raw petroleum coke, jute batching oil, micro crystalline wax, mineral turpentine oil, toluene, propylene, benzene, and petcoke. Further, it engages in the explosives and cryogenic; wind and solar power generation; lube blending; bunkering; refining and pipeline consultancy; and lubricants and base oil marketing activities. The company operates through a network of approximately 9 refineries; approximately 15,000 kilometers of pipelines; approximately 34,559 fuel stations, including 11,026 Kisan Seva Kendra outlets; 120 terminals and depots; 101 LPG bottling plants\/terminals; 126 aviation fuel stations; 6,993 consumer pumps; 12,813 LPG distributors; 1,488 CNG stations; 10 lube blending plants; and 2,179 EV charging stations, including 34 battery swapping stations. Its exploration and production portfolio comprises 9 exploration and production blocks in India. The company was founded in 1958 and is based in New Delhi, India."},"city":{"0":"New Delhi"},"phone":{"0":"1800 2333 555"},"website":{"0":"https:\/\/www.iocl.com"},"grossProfits":{"0":974160000000},"totalCash":{"0":98333401088},"totalDebt":{"0":1320195850240},"totalRevenue":{"0":6972476227584},"totalCashPerShare":{"0":7.039},"revenuePerShare":{"0":504.362},"bookValue":{"0":113.042},"priceToBook":{"0":0.67673963},"marketCap":{"0":720183296000},"averageVolume":{"0":12775078},"fiftyTwoWeekHigh":{"0":90.7},"fiftyTwoWeekLow":{"0":65.2},"logo_url":{"0":"https:\/\/logo.clearbit.com\/iocl.com"}}