{"sector":{"0":"Industrials"},"longName":{"0":"Indian Railway Catering & Tourism Corporation Limited"},"fullTimeEmployees":{"0":1363},"longBusinessSummary":{"0":"Indian Railway Catering & Tourism Corporation Limited provides catering and hospitality, Internet ticketing, travel and tourism, and packaged drinking water services in India. It operates through five segments: Catering, Railneer, Tourism & Train Operation, State Teertha, and Internet Ticketing. The company offers mobile catering services, including Rajdhani, Shatabdi and Duronto; mail express, train side vending, Gatiman, and Tejas and Vande Bharat; e-catering; and other catering services, such as food plaza, fast food units, refreshment rooms, Jan Ahaars, cell kitchen, base kitchen, executive lounges, retiring rooms, RYN\/BNR hotels, and non-railway catering. In addition, the company offers tourism products and services comprising domestic tour packages, inbound tourist targeted tours, mass tourism, outbound tour packages, and air ticket and corporate travel; and other tourism activities, such as event management, booking of charter trains and coaches, hill and heritage charters, saloon tours and charters, online reservation and accommodation facilities, and adventure tourism. Further, it offers packaged drinking water under the Rail Neer name; and train ticket booking and travel insurance services, as well as operates irctctourism.com, a tourism portal. The company was incorporated in 1999 and is based in New Delhi, India."},"city":{"0":"New Delhi"},"phone":{"0":"91 11 2331 1263"},"website":{"0":"https:\/\/www.irctc.com"},"grossProfits":{"0":9877310000},"totalCash":{"0":17298259968},"totalDebt":{"0":1066614016},"totalRevenue":{"0":24886994944},"totalCashPerShare":{"0":21.623},"revenuePerShare":{"0":31.109},"bookValue":{"0":83.545},"priceToBook":{"0":7.6569514},"marketCap":{"0":511760007168},"averageVolume":{"0":2646986},"fiftyTwoWeekHigh":{"0":918.65},"fiftyTwoWeekLow":{"0":557},"logo_url":{"0":"https:\/\/logo.clearbit.com\/irctc.com"}}