{"sector":{"0":"Financial Services"},"longName":{"0":"ICICI Securities Limited"},"fullTimeEmployees":{"0":4094},"longBusinessSummary":{"0":"ICICI Securities Limited provides institutional and retail broking, merchant banking, financial products distribution, private wealth management, and issuer and advisory services. The company operates through three segments: Treasury, Broking & Distribution, and Issuer Services & Advisory. It operates ICICIdirect.com, an online broking platform to invest in equity, derivatives, currency futures, and margin trading funding; and distributes financial products and services, such as mutual funds, fixed deposits, loans, tax services, pension products, rental discounting, asset financing, overdraft, and life and general insurance products. The company also provides private wealth management services, such as investment solutions, protection, mortgages and loans, tax advisory, estate planning, and real estate services, as well as alternative investment, raising equity capital, debt syndication, and monetizing assets services. In addition, it offers equity capital market products and services, including initial public offerings, qualified institutional placements, rights issue, preferential issues, and block and bulk deals; corporate access, investor meets, and equity research services; and corporate finance services comprising debt advisory, mergers and acquisitions, advisory, private equity, and structured products. It serves corporates, financial institutions, high net-worth individuals, and retail investors in India and internationally. The company was formerly known as ICICI Securities and Finance Company Limited and changed its name to ICICI Securities Limited in April 2003. The company was incorporated in 1995 and is headquartered in Mumbai, India. ICICI Securities Limited operates as a subsidiary of ICICI Bank Limited."},"city":{"0":"Mumbai"},"phone":{"0":"91 22 6807 7100"},"website":{"0":"https:\/\/www.icicisecurities.com"},"grossProfits":{"0":28930500000},"totalCash":{"0":62969200640},"totalDebt":{"0":81923899392},"totalRevenue":{"0":31100299264},"totalCashPerShare":{"0":194.938},"revenuePerShare":{"0":96.346},"bookValue":{"0":56.521},"priceToBook":{"0":8.799384},"marketCap":{"0":160479428608},"averageVolume":{"0":247434},"fiftyTwoWeekHigh":{"0":838},"fiftyTwoWeekLow":{"0":408.4},"logo_url":{"0":"https:\/\/logo.clearbit.com\/icicisecurities.com"}}