{"sector":{"0":"Consumer Defensive"},"longName":{"0":"ITC Limited"},"fullTimeEmployees":{"0":23829},"longBusinessSummary":{"0":"ITC Limited engages in the fast-moving consumer goods, hotels, paperboards and paper, packaging, agri, and information technology (IT) businesses in India and internationally. It primarily offers cigarettes and cigars; staples, spices, biscuits, confectionery and gums, snacks, noodles and pasta, beverages, dairy, ready to eat meals, chocolate, coffee, and frozen foods; personal care products; notebooks, pens and pencils, geometry boxes, erasers, sharpeners, rulers, wax and plastic crayons, sketch pens, and oil pastels; apparel, safety matches; and incense sticks under various brands. The company also operates approximately 113 hotels under the ITC Hotel, WelcomHotel, Fortune, and WelcomHeritage brands; and Kaya Kalp spas. In addition, it offers virgin, recycled, barrier coated, biodegradable barrier, and graphic boards, as well as specialty papers; and packaging products, such as carton board, flexible, tobacco, and green packaging products; and exports feed ingredients, food grains, marine products, processed fruits, coffee products, leaf tobacco products, and spices. Further, the company offers information technology services for the banking, financial services, consumer goods, manufacturing, travel, hospitality, and healthcare industries. Additionally, it provides property infrastructure and estate maintenance; engineering, procurement, and construction management services; project management consultancy services; business consulting, real estate development, and agro-forestry and other related services; manages and operates golf courses; fabricates and assembles machinery for tube filling; cartooning and wrapping services; conveyor solutions; and produces and commercializes seed potato technology products The company was incorporated in 1910 and is headquartered in Kolkata, India."},"city":{"0":"Kolkata"},"phone":{"0":"91 33 2288 9371"},"website":{"0":"https:\/\/www.itcportal.com"},"grossProfits":{"0":336206000000},"totalCash":{"0":162994798592},"totalDebt":{"0":2526599936},"totalRevenue":{"0":692611317760},"totalCashPerShare":{"0":13.16},"revenuePerShare":{"0":56.116},"bookValue":{"0":48.064},"priceToBook":{"0":6.898094},"marketCap":{"0":4085557755904},"averageVolume":{"0":11256625},"fiftyTwoWeekHigh":{"0":361.45},"fiftyTwoWeekLow":{"0":207},"logo_url":{"0":"https:\/\/logo.clearbit.com\/itcportal.com"}}