{"sector":{"0":"Financial Services"},"longName":{"0":"JM Financial Limited"},"fullTimeEmployees":{"0":2405},"longBusinessSummary":{"0":"JM Financial Limited provides various integrated and diversified financial services to corporations, financial institutions, high net-worth individuals, and retail customers in India. The company operates through four segments: Investment Bank, Mortgage Lending, Alternative & Distressed Credit, and Asset Management, Wealth Management & Securities Business (Platform AWS). The Investment Bank segment manages capital markets transactions, as well as advises on mergers and acquisitions, and private equity syndication. This segment also engages in institutional equities business and research, private equity funds, fixed income, syndication, and finance. The Mortgage Lending segment provides finance against commercial and residential real estate to a range of corporates and non-corporate clients. This segment also engages in educational institutions lending and housing finance businesses. The Alternative & Distressed Credit segment provides securitization and reconstruction of financial assets and manages alternative credit funds. The Platform AWS segment provides investment advisory and distribution services, which include equity brokerage, wealth management, and capital market lending for wealth management and broking clients, as well as distributes financial products; and manages mutual fund assets through various schemes. JM Financial Limited was founded in 1973 and is headquartered in Mumbai, India."},"city":{"0":"Mumbai"},"phone":{"0":"91 22 6630 3030"},"website":{"0":"https:\/\/www.jmfl.com"},"grossProfits":{"0":23429800000},"totalCash":{"0":78194499584},"totalDebt":{"0":134980403200},"totalRevenue":{"0":22417600512},"totalCashPerShare":{"0":81.96},"revenuePerShare":{"0":23.501},"bookValue":{"0":72.838},"priceToBook":{"0":0.9816305},"marketCap":{"0":68214218752},"averageVolume":{"0":1952323},"fiftyTwoWeekHigh":{"0":84.9},"fiftyTwoWeekLow":{"0":57.1},"logo_url":{"0":"https:\/\/logo.clearbit.com\/jmfl.com"}}