{"sector":{"0":"Consumer Defensive"},"longName":{"0":"Jyothy Labs Limited"},"fullTimeEmployees":{"0":2593},"longBusinessSummary":{"0":"Jyothy Labs Limited, together with its subsidiaries, engages in manufacturing and marketing fabric care, dishwashing, personal care, and household insecticides products in India and internationally. The company operates through Dishwashing, Fabric Care, Household Insecticides, Personal Care, Laundry Services, and Others segments. The Dishwashing segment offers dish wash scrubbers and scrubber steel, as well as dish wash bars, liquids, and powders under the Pril and Exo brands. The Fabric Care segment provides fabric whiteners, fabric enhancers, bar soaps, and detergent powders under the Henko, Mr. White, Ujala, and More light brands. The Household Insecticides segment offers mosquito repellent coils, liquids, and cards, as well as insect repellents and air care products under the Maya, T- Shine, and Maxo brands. The Personal Care segment provides body soaps, face washes, toothpastes, deodorants, talcum powders, after shave products, hand sanitizers, and moisturizers under the Margo, Fa, and Neem Active brands. The Laundry Services segment provides dry cleaning and laundry services. The Others segment offers incense sticks, toilet and vegetable cleaner and floor shine products under the Joy of shine brand. The company was formerly known as Jyothy Laboratories Limited and changed its name to Jyothy Labs Limited in July 2019. Jyothy Labs Limited was founded in 1983 and is based in Mumbai, India."},"city":{"0":"Mumbai"},"phone":{"0":"91 22 6689 2800"},"website":{"0":"https:\/\/www.jyothylabs.com"},"grossProfits":{"0":9058152000},"totalCash":{"0":2087938048},"totalDebt":{"0":1712408960},"totalRevenue":{"0":22686003200},"totalCashPerShare":{"0":5.686},"revenuePerShare":{"0":61.739},"bookValue":{"0":36.487},"priceToBook":{"0":5.614329},"marketCap":{"0":75277254656},"averageVolume":{"0":539016},"fiftyTwoWeekHigh":{"0":217.9},"fiftyTwoWeekLow":{"0":130.15},"logo_url":{"0":"https:\/\/logo.clearbit.com\/jyothylabs.com"}}