{"sector":{"0":"Industrials"},"longName":{"0":"Kalpataru Power Transmission Limited"},"fullTimeEmployees":{"0":3072},"longBusinessSummary":{"0":"Kalpataru Power Transmission Limited provides engineering, procurement, and construction (EPC) services relating to power transmission and distribution, civil construction, railway track laying and electrification, and oil and gas pipelines laying in India and internationally. It designs, tests, fabricates, erects, constructs, and maintains transmission lines, oil and gas infrastructure, and railways projects on a turnkey basis. The company also provides EPC contracting services for cross-country pipelines, terminals, and gas gathering stations across various territories; and EPC services for executing civil infrastructure, bridges, new track laying, track rehabilitation, gauge conversion, signaling and telecommunication, traction sub-station, and over-head electrification projects for railways. In addition, it engages in the high voltage substation business in air insulated and gas insulated; manufacture of railway structures; and operation of two biomass power generation plants in Rajasthan, India. Further, the company is involved in the agri-storage infrastructure with value added services, such as warehousing, collateral management, testing and certification, and pest management, as well as preservation, maintenance, and security. Kalpataru Power Transmission Limited was incorporated in 1981 and is based in Mumbai, India."},"city":{"0":"Mumbai"},"phone":{"0":"91 22 3064 5000"},"website":{"0":"https:\/\/www.kalpatarupower.com"},"grossProfits":{"0":38900200000},"totalCash":{"0":10768900096},"totalDebt":{"0":38377799680},"totalRevenue":{"0":152503795712},"totalCashPerShare":{"0":72.319},"revenuePerShare":{"0":1022.855},"bookValue":{"0":226.292},"priceToBook":{"0":2.4698179},"marketCap":{"0":83335913472},"averageVolume":{"0":319048},"fiftyTwoWeekHigh":{"0":575.95},"fiftyTwoWeekLow":{"0":331.8},"logo_url":{"0":"https:\/\/logo.clearbit.com\/kalpatarupower.com"}}