{"sector":{"0":"Financial Services"},"longName":{"0":"Kotak Mahindra Bank Limited"},"fullTimeEmployees":{"0":90000},"longBusinessSummary":{"0":"Kotak Mahindra Bank Limited provides banking and financial services to corporate and individual customers in India. It operates through Treasury, BMU, and Corporate Centre; Retail Banking; Corporate\/Wholesale Banking; Vehicle Financing; Other Lending Activities; Broking; Advisory and Transactional Services; Asset Management; and Insurance segments. The Treasury, BMU and Corporate Centre segment engages in money market, forex market, derivatives, and investments; and the primary dealership of government securities and balance sheet management unit (BMU) responsible for asset liability management. The Retail Banking segment offers commercial vehicle finance, personal, home, and other loans\/services, and agriculture finance services. This segment also provides savings, current, and term deposit accounts; branch banking network and services, including distribution of financial products; and credit cards. The Corporate\/Wholesale Banking segment offers wholesale borrowings and lending, and other related services to the corporate sector. The Vehicle Financing segment provides retail vehicle and wholesale trade finance to auto dealers. The Other Lending Activities segment offers financing against securities, securitization, and other loans\/services. The Broking segment provides brokerage income on market transactions and delayed payments interest; and distributes financial products. The Advisory and Transactional Services segment offers mergers and acquisition advice, and equity\/debt issue management services. The Asset Management segment engages in the management of funds and investments on behalf of clients and funds. The Insurance segment provides life insurance and general insurance products. As of June 30, 2022, the company had 1,702 branches and 2,761 ATMs; and branches in Dubai International Financial Centre and Gujarat International Finance Tec-City. Kotak Mahindra Bank Limited was incorporated in 1985 and is headquartered in Mumbai, India."},"city":{"0":"Mumbai"},"phone":{"0":"91 22 6166 0001"},"website":{"0":"https:\/\/www.kotak.com"},"grossProfits":{"0":467260719000},"totalCash":{"0":411866202112},"totalDebt":{"0":470780313600},"totalRevenue":{"0":484848009216},"totalCashPerShare":{"0":207.407},"revenuePerShare":{"0":244.283},"bookValue":{"0":421.683},"priceToBook":{"0":4.3332314},"marketCap":{"0":3625081372672},"averageVolume":{"0":2448315},"fiftyTwoWeekHigh":{"0":1997.55},"fiftyTwoWeekLow":{"0":1631},"logo_url":{"0":"https:\/\/logo.clearbit.com\/kotak.com"}}