{"sector":{"0":"Basic Materials"},"longName":{"0":"Linde India Limited"},"fullTimeEmployees":{"0":242},"longBusinessSummary":{"0":"Linde India Limited primarily operates as an industrial gases company in India. The company operates in two segments, Gases and Related Products, and Project Engineering. The Gases and Related Products segment primarily produces and sells oxygen, nitrogen, and argon gases. This segment engages in provision of pipeline gas supply to steel, glass, and chemical industries; liquefied gases through cryogenic tankers to various industrial sectors; and compressed gas in cylinders to fabrication, manufacturing, and construction industries. It also offers gases, such as medical oxygen, synthetic air, and nitrous oxide for pharmaceutical use, as well as medical gas distribution systems to hospitals. The Project Engineering segment is involved in the design and engineering, supply, installation, testing, and commissioning of air separation plants and related projects on turnkey basis. This segment also manufactures distillation columns for air separation plants, cryogenic liquid storage tanks, ambient and steam bath vaporizers, process vessels, LINIT plants, small sized cold boxes, and containerized micro plants for cylinder filling for in-house use, as well as for sale to third party customers. In addition, it supplies range of gases and mixtures; and provides related services, including the construction and installation of plants, equipment, pipelines, and associated engineering services to various industries. The company was formerly known as BOC India Limited and changed its name to Linde India Limited in February 2013. The company was incorporated in 1935 and is headquartered in Kolkata, India. Linde India Limited operates as a subsidiary of The BOC Group Limited."},"city":{"0":"Kolkata"},"phone":{"0":"91 33 6602 1600"},"website":{"0":"https:\/\/www.linde.in"},"grossProfits":{"0":9938030000},"totalCash":{"0":9712360448},"totalDebt":{"0":230130000},"totalRevenue":{"0":22736930816},"totalCashPerShare":{"0":113.86},"revenuePerShare":{"0":266.592},"bookValue":{"0":261.981},"priceToBook":{"0":13.110684},"marketCap":{"0":292929896448},"averageVolume":{"0":41224},"fiftyTwoWeekHigh":{"0":4190},"fiftyTwoWeekLow":{"0":2497},"logo_url":{"0":"https:\/\/logo.clearbit.com\/linde.in"}}