{"sector":{"0":"Technology"},"longName":{"0":"L&T Technology Services Limited"},"fullTimeEmployees":{"0":21474},"longBusinessSummary":{"0":"L&T Technology Services Limited provides engineering, research, and development (ER&D) services in North America, Europe, India, and internationally. Its Transportation segment offers engineering services and solutions to transportation industry that includes original equipment manufacturers (OEM) and Tier 1 suppliers in automotive, trucks and off-highway vehicles, aerospace, rail, and polymer industries. The company's Industrial Products segment helps OEM customers in building automation, home and office products, energy, process control, and machinery sectors. This segment offers product development counsel, software expertise, electronics, connectivity, mechanical engineering, industrial networking protocols, user interface\/user experience, test frameworks, and enterprise control solutions. Its Telecom & Hi-Tech segment offers embedded software design and development, hardware platform design and development, product maintenance, enhancement and sustenance, testing and validation, system integration for communication and related solutions, and systems and field implementation services to OEM\/ODMs, chipset vendors, telecom carriers, and ISVs. The company's Plant Engineering segment provides end to end engineering services for chemical, consumer packaged goods, and energy and utility sector clients. Its Medical Devices segment delivers solutions in diagnostic, life sciences, surgical, cardiovascular, home healthcare, general medical, and other devices to medical device OEMs. The company was formerly known as L&T Technology and Engineering Services Company Limited and changed its name to L&T Technology Services Limited in July 2012. The company was incorporated in 2012 and is based in Vadodara, India. L&T Technology Services Limited is a subsidiary of Larsen & Toubro Limited."},"city":{"0":"Vadodara"},"phone":{"0":null},"website":{"0":"https:\/\/www.ltts.com"},"grossProfits":{"0":28255000000},"totalCash":{"0":23044999168},"totalDebt":{"0":4611999744},"totalRevenue":{"0":72803999744},"totalCashPerShare":{"0":218.291},"revenuePerShare":{"0":690.149},"bookValue":{"0":331.061},"priceToBook":{"0":11.126499},"marketCap":{"0":388559273984},"averageVolume":{"0":290343},"fiftyTwoWeekHigh":{"0":5955.5},"fiftyTwoWeekLow":{"0":2924.2},"logo_url":{"0":"https:\/\/logo.clearbit.com\/ltts.com"}}