{"sector":{"0":"Consumer Cyclical"},"longName":{"0":"Mahindra & Mahindra Limited"},"fullTimeEmployees":{"0":260000},"longBusinessSummary":{"0":"Mahindra & Mahindra Limited provides mobility products and farm solutions in India and internationally. The company operates through Automotive, Farm Equipment, Financial Services, Hospitality, Real Estate, and Others segments. It offers parts and assemblies for aerospace and defense sectors; passenger and commercial vehicles, trucks, buses, vans, cars, utility vehicles, and electric vehicles; watercrafts; motorcycles, scooters, and mopeds; construction equipment, such as backhoe loaders under the Mahindra EarthMaster brand; and road construction equipment comprising motor graders under the Mahindra RoadMaster brand. The company also provides land and naval systems, defense electronics, and security consulting services for defense industry; pre-owned car and car services; and farm equipment. In addition, it operates M2All, an e-commerce platform for various portfolio of products; approximately 100 resorts; and solar PV projects. Further, the company offers financial services comprising retail and other loans, SME finance, housing finance, mutual funds, and life and non-life insurance broking services, as well as vehicle and equipment financing; logistics services; information security and risk management, engineering consulting, and business process management consulting services; information technology services; and power backup solutions, such as diesel and gas generators. Additionally, it engages in the development, management, and operation of commercial complexes; sale of timeshare and vacation ownership; and making, processing, and trading of steel for automotive, non-automotive, and power industries. The company was incorporated in 1945 and is based in Mumbai, India."},"city":{"0":"Mumbai"},"phone":{"0":"91 22 2490 1441"},"website":{"0":"https:\/\/www.mahindra.com"},"grossProfits":{"0":397609700000},"totalCash":{"0":226925707264},"totalDebt":{"0":778423697408},"totalRevenue":{"0":1002048323584},"totalCashPerShare":{"0":204.046},"revenuePerShare":{"0":901.453},"bookValue":{"0":null},"priceToBook":{"0":null},"marketCap":{"0":1552992960512},"averageVolume":{"0":2443877},"fiftyTwoWeekHigh":{"0":1366.55},"fiftyTwoWeekLow":{"0":671.15},"logo_url":{"0":"https:\/\/logo.clearbit.com\/mahindra.com"}}