{"sector":{"0":"Industrials"},"longName":{"0":"Mahindra Logistics Limited"},"fullTimeEmployees":{"0":3471},"longBusinessSummary":{"0":"Mahindra Logistics Limited provides integrated logistics and mobility solutions in India and internationally. It operates through two segments, Supply Chain Management (SCM) and Enterprise Mobility Services (EMS). The SCM segment provides customized and end-to-end logistics solutions and services, including transportation and distribution, warehousing, in-factory logistics, and value-added services. It also offers B2B express\/part truck load, freight forwarding, last-mile delivery, and micro fulfillment and electric cargo delivery services. This segment serves domestic and multinational companies operating in various industry verticals, including automotive, engineering, e-commerce, consumer goods, pharmaceuticals, telecom, and commodities. The EMS segment provides technology-enabled people transportation solutions and services for domestic and multinational companies operating in the information technology, information technology-enabled service, business process outsourcing, financial services, consulting, e-commerce, and manufacturing industries. This segment offers integrated technology services, such as application-based interactions for route planning and optimization, round-the-clock control tower operations for tracking vehicles and passengers, and electric vehicle telematics. It also provides freight forwarding services for exports and imports, customs brokerage operations, project cargo services, and air charters; and logistics and transportation services to original equipment manufacturers for carrying finished automobiles. The company was founded in 2000 and is based in Mumbai, India. Mahindra Logistics Limited is a subsidiary of Mahindra & Mahindra Limited."},"city":{"0":"Mumbai"},"phone":{"0":"91 22 2490 1441"},"website":{"0":"https:\/\/www.mahindralogistics.com"},"grossProfits":{"0":2722300000},"totalCash":{"0":2482200064},"totalDebt":{"0":3048699904},"totalRevenue":{"0":43997298688},"totalCashPerShare":{"0":34.537},"revenuePerShare":{"0":611.933},"bookValue":{"0":79.474},"priceToBook":{"0":6.3140144},"marketCap":{"0":36061106176},"averageVolume":{"0":126212},"fiftyTwoWeekHigh":{"0":744},"fiftyTwoWeekLow":{"0":391.1},"logo_url":{"0":"https:\/\/logo.clearbit.com\/mahindralogistics.com"}}