{"sector":{"0":"Industrials"},"longName":{"0":"MMTC Limited"},"fullTimeEmployees":{"0":null},"longBusinessSummary":{"0":"MMTC Limited operates as a trading company in Asia, Europe, Africa, the Middle East, Latin America, and North America. It exports mineral products, such as chrome ore, chrome concentrate, manganese ore, bentonite, bentonite power, bauxite, feldspar, quartz, sandstone, granite, mica flakes, and other products. The company also imports and exports gold, silver, platinum, palladium, rough diamonds, emeralds, rubies, and other semi-precious stones; and manufactures gold and silver medallions. In addition, it imports and exports non-ferrous metals, such as copper, aluminum, zinc and lead ingots, tin ingots, nickel, briquettes, ferro nickel, etc.; minor metals comprising antimony, silicon, cobalt metal, silicon, magnesium, and mercury; brown and white fused alumina, calcined alumina and bauxite, noble metals, and ferro alloys; and aluminum, zinc, and other alloys. Further, the company trades in agro products, including wheat, rice, maize, soya bean meal, sugar, edible oil, and pulses; and imports and sells fertilizers and raw materials, such as urea, di-ammonium phosphate, mono-ammonium phosphate, powdered mono-ammonium phosphate, muriate of potash, complex fertilizers, sulphur and rock phosphate, and phosphoric acid. Additionally, it trades in coking coal; and engineering products, as well as operates a windmill project located at Gajendergarh in Karnataka. MMTC Limited was incorporated in 1963 and is based in New Delhi, India."},"city":{"0":"New Delhi"},"phone":{"0":"91 11 2436 1889"},"website":{"0":"https:\/\/mmtclimited.com"},"grossProfits":{"0":11329200000},"totalCash":{"0":2018899968},"totalDebt":{"0":26259200000},"totalRevenue":{"0":84038402048},"totalCashPerShare":{"0":1.342},"revenuePerShare":{"0":56.038},"bookValue":{"0":5.088},"priceToBook":{"0":7.4292455},"marketCap":{"0":56699998208},"averageVolume":{"0":2870353},"fiftyTwoWeekHigh":{"0":64.7},"fiftyTwoWeekLow":{"0":31},"logo_url":{"0":"https:\/\/logo.clearbit.com\/mmtclimited.com"}}