{"sector":{"0":"Consumer Cyclical"},"longName":{"0":"Samvardhana Motherson International Limited"},"fullTimeEmployees":{"0":47456},"longBusinessSummary":{"0":"Samvardhana Motherson International Limited engages in the manufacture and sale of components for automotive original equipment manufacturers in India and internationally. The company offers interior and exterior mirrors, and camera-based detection systems; modules and polymer products; cutting and gear cutting tools, and machining of high precision metal machined components; and technology, engineering, and manufacturing solutions. It also provides exterior lighting and electronics, passenger car HVAC and compressors, body control module, struts, shock absorbers, and backyard integration products; logistics solutions; and health and medical products, solutions, and services, as well as integrated solutions for aerospace industry. In addition, the company offers industrial park; manufacturing engineering, consultation, project management, and turnkey supplies to the automotive industry; and machine tools and hydraulic products trading. Further, it designs, manufactures, and integrates electrical distribution systems, electronics, and related components for commercial vehicle industries, rolling stock manufacturers, and other related segments. The company was formerly known as Motherson Sumi Systems Limited and changed its name to Samvardhana Motherson International Limited in May 2022. The company was incorporated in 1986 and is headquartered in Noida, India."},"city":{"0":"Noida"},"phone":{"0":"91 12 0675 2100"},"website":{"0":"https:\/\/www.motherson.com"},"grossProfits":{"0":253306000000},"totalCash":{"0":49936998400},"totalDebt":{"0":141296992256},"totalRevenue":{"0":646933577728},"totalCashPerShare":{"0":7.369},"revenuePerShare":{"0":112.175},"bookValue":{"0":null},"priceToBook":{"0":null},"marketCap":{"0":null},"averageVolume":{"0":14981279},"fiftyTwoWeekHigh":{"0":134.86667},"fiftyTwoWeekLow":{"0":61.8},"logo_url":{"0":"https:\/\/logo.clearbit.com\/motherson.com"}}