{"sector":{"0":"Financial Services"},"longName":{"0":"Motilal Oswal Financial Services Limited"},"fullTimeEmployees":{"0":10000},"longBusinessSummary":{"0":"Motilal Oswal Financial Services Limited offers financial services in India. It operates through Broking and Other Related Activities, Fund Based Activities, Asset Management and Advisory, Investment Banking Services, and Home Finance segments. The company offers broking and distribution services, such as equities, derivatives, commodities, currencies, mutual funds, insurance products, and other investment products; primary equity offerings; and depository, portfolio management, and asset management services. It also provides private wealth management services, such as equity, alternate, credit solutions, estate planning, will making, and property advisory services; and home loans. In addition, the company offers institutional broking services, including cash and derivatives; private equity services; and investment banking advisory and transaction solutions, including private placement of equity, mergers and acquisitions advisory, and equity capital markets transactions. It serves high net worth individuals; and mutual funds, foreign institutional investors, financial institutions, and corporate clients. Motilal Oswal Financial Services Limited was founded in 1987 and is headquartered in Mumbai, India. Motilal Oswal Financial Services Limited operates as a subsidiary of Passionate Investment Management Private Limited."},"city":{"0":"Mumbai"},"phone":{"0":"91 22 7193 4200"},"website":{"0":"https:\/\/www.motilaloswalgroup.com"},"grossProfits":{"0":28507800000},"totalCash":{"0":21375399936},"totalDebt":{"0":62339301376},"totalRevenue":{"0":36498399232},"totalCashPerShare":{"0":143.399},"revenuePerShare":{"0":248.26},"bookValue":{"0":302.44},"priceToBook":{"0":2.2693756},"marketCap":{"0":101025226752},"averageVolume":{"0":136484},"fiftyTwoWeekHigh":{"0":1005.95},"fiftyTwoWeekLow":{"0":653},"logo_url":{"0":"https:\/\/logo.clearbit.com\/motilaloswalgroup.com"}}