{"sector":{"0":"Communication Services"},"longName":{"0":"Info Edge (India) Limited"},"fullTimeEmployees":{"0":4785},"longBusinessSummary":{"0":"Info Edge (India) Limited operates as an online classifieds company in the areas of recruitment, matrimony, real estate, and education and related services in India and internationally. It operates through Recruitment Solutions, 99acres, and Other segments. The company offers recruitment services through naukri.com, an online job website for job seekers and corporate customers, including hiring consultants; firstnaukri.com, a job search network for college students and recent graduates; naukrigulf.com, a website catering to Gulf markets; and quadranglesearch.com, a site that provides off-line placement services to middle and senior management, as well as Highorbit\/iimjobs.com, zwayam.com, hirist.com, doselect.com, ambitionbox.com, bigshyft.com, and jobhai.com. It also provides 99acres.com, which offers listing of properties for sale, purchase, and rent; Jeevansathi.com, an online matrimonial classifieds services; and shiksha.com, an education classified website that helps students to decide their undergraduate and postgraduate options by providing useful information on careers, exams, colleges, and courses, as well as operates multiple dating platforms on the web through its mobile apps Aisle, Anbe, Arike and HeyDil. In addition, the company provides internet, computer, and electronic and related services; and software development, consultancy, technical support for consumer companies, SAAS providers, and other services in the field of information technology and product development, as well as brokerage services in the real estate sector. Further, it acts as an investment adviser and manager, financial and management consultant, and sponsor of alternative investment funds, as well as provides advertising space for colleges and universities on www.shiksha.com. Info Edge (India) Limited was incorporated in 1995 and is based in Noida, India."},"city":{"0":"Noida"},"phone":{"0":"91 12 0308 2000"},"website":{"0":"https:\/\/www.infoedge.in"},"grossProfits":{"0":8000760000},"totalCash":{"0":33117769728},"totalDebt":{"0":640680000},"totalRevenue":{"0":18076880896},"totalCashPerShare":{"0":257.314},"revenuePerShare":{"0":140.427},"bookValue":{"0":354.479},"priceToBook":{"0":11.092477},"marketCap":{"0":506385137664},"averageVolume":{"0":386909},"fiftyTwoWeekHigh":{"0":5761.65},"fiftyTwoWeekLow":{"0":3313},"logo_url":{"0":"https:\/\/logo.clearbit.com\/infoedge.in"}}