{"sector":{"0":"Industrials"},"longName":{"0":"NBCC (India) Limited"},"fullTimeEmployees":{"0":1367},"longBusinessSummary":{"0":"NBCC (India) Limited engages in project management consultancy and real estate development businesses in India and internationally. The company operates through three segments: Project Management Consultancy (PMC); Engineering Procurement and Construction (EPC); and Real Estate Development. The PMC segment provides services for various civil construction projects, including residential and commercial complexes, re-development of colonies, hospitals, educational institutions, infrastructure works for security personnel, and border fencing projects, as well as infrastructure projects, such as roads, water supply systems, storm water drainage systems, water storage solutions, and solid waste management schemes. The EPC segment executes various projects, which include chimneys, cooling towers, coal handling plants, roads, TV towers, airports, runways, etc.; and project conceptualization, feasibility studies, detailed project reports, engineering, tender specifications and packages covering basic and detailed engineering, review of projects, procurement, construction drawings, commissioning, testing, and handing projects services. The Real Estate Development segment develops residential, commercial, and institutional projects. It is also involved in the provision of post-construction maintenance services; implementation of integrated steel plants; consultancy services in the field of hospital planning, design, detail engineering, quality control, project management, and monitoring, as well as procurement, supply, installation, and commissioning of medical equipment; construction, real estate, and project management consultancy; and environment and sustainability business. The company was formerly known as National Buildings Construction Corporation Limited and changed its name to NBCC (India) Limited in May 2016. NBCC (India) Limited was incorporated in 1960 and is headquartered in New Delhi, India."},"city":{"0":"New Delhi"},"phone":{"0":"91 11 2436 7314"},"website":{"0":"https:\/\/www.nbccindia.com"},"grossProfits":{"0":5023890000},"totalCash":{"0":56466145280},"totalDebt":{"0":4570000},"totalRevenue":{"0":79944753152},"totalCashPerShare":{"0":26.921},"revenuePerShare":{"0":42.642},"bookValue":{"0":8.403},"priceToBook":{"0":4.6173987},"marketCap":{"0":69839994880},"averageVolume":{"0":8883203},"fiftyTwoWeekHigh":{"0":53.7},"fiftyTwoWeekLow":{"0":26.55},"logo_url":{"0":"https:\/\/logo.clearbit.com\/nbccindia.com"}}