{"sector":{"0":"Industrials"},"longName":{"0":"NCC Limited"},"fullTimeEmployees":{"0":5109},"longBusinessSummary":{"0":"NCC Limited engages in the construction business in India and internationally. The company constructs industrial and commercial buildings, housing projects, IT parks, shopping malls, sports complexes, and hospitals, as well as stadia; and roads, highways, flyovers, bridges, etc. It also undertakes design, engineering, erection, testing, and commissioning of transmission lines and sub-stations, as well as project electrification and various utility distribution projects; and railway projects, which include freight corridors, railway sidings, and port connectivity projects. In addition, the company constructs water supply projects, water treatment plants, distribution networks, pumping stations, river intake works, electromechanical works, underground drainage networks, lift irrigation schemes, sewage pumping stations and treatment plants, and summer storage tanks; and dams and reservoirs, canals, tunnels, and hydroelectric power projects, as well as barrages, spillways, and aqueducts. Further, it engages in the engineering, procurement, and construction of power and metal projects; and provision of mine developer-cum-operator services, as well as removal of overburden and extraction of coal\/lignite\/other minerals from open cast mines. The company was formerly known as Nagarjuna Construction Company Limited and changed its name to NCC Limited in March 2011. NCC Limited was founded in 1978 and is based in Hyderabad, India."},"city":{"0":"Hyderabad"},"phone":{"0":"91 40 2326 8888"},"website":{"0":"https:\/\/ncclimited.com"},"grossProfits":{"0":18988300000},"totalCash":{"0":2913299968},"totalDebt":{"0":13024300032},"totalRevenue":{"0":123950096384},"totalCashPerShare":{"0":4.777},"revenuePerShare":{"0":203.29},"bookValue":{"0":81.489},"priceToBook":{"0":1.0295869},"marketCap":{"0":51166162944},"averageVolume":{"0":5319236},"fiftyTwoWeekHigh":{"0":96.9},"fiftyTwoWeekLow":{"0":52.2},"logo_url":{"0":"https:\/\/logo.clearbit.com\/ncclimited.com"}}