{"sector":{"0":"Communication Services"},"longName":{"0":"Network18 Media & Investments Limited"},"fullTimeEmployees":{"0":620},"longBusinessSummary":{"0":"Network18 Media & Investments Limited operates as a media and entertainment company in India. The company engages in television, digital content, filmed entertainment, digital commerce, print, and allied businesses. It operates business news channels, such as CNBC-TV18, CNBC Awaaz, and CNBC Bajar; general news channels, including CNN News18, News18 India, News18 International, and News18; and regional news channels comprising News18 network. The company also operates Hindi general entertainment channels consisting of Colors, Colors Cineplex, Colors Rishtey, Rishtey Cineplex, MTV India, and MTV Beats; English entertainment channels, including VH1, Comedy Central, and Colors Infinity; and regional entertainment channels consisting of Colors Kannada, Colors Super, Kannada Cinema, Colors Bangla, Colors Marathi, Colors Gujarati, Colors Oriya, and Colors Tamil. In addition, it operates kids entertainment channels comprising Nickelodeon, Sonic, Nick Jr., and Nick HD+; factual entertainment and lifestyle channels, such as HistoryTV18 and FYI TV18; VOOT, a Viacom18's video-on-demand platform; filmed entertainment channels, such as Viacom18 Motion Pictures; and IndiaCast, a content asset monetization channel, as well as Tipping Point for digital content production. Further, the company operates digital content websites, including MoneyControl, News18.com, CNBCTV18.com, and Firstpost, as well as bookmyshow.com, an online ticketing platform; and TopperLearning, a premier K-12 content, delivery, and assessment service provider. Additionally, it publishes Forbes India, Overdrive, and Better Photography magazines; and produces films and TV shows. The company was formerly known as Network18 Fincap Private Limited and changed its name to Network18 Media & Investments Limited in December 2007. Network18 Media & Investments Limited was incorporated in 1996 and is based in Mumbai, India. Network18 Media & Investments Limited operates as a subsidiary of Reliance Industries Limited."},"city":{"0":"Mumbai"},"phone":{"0":"91 22 4001 9000"},"website":{"0":"https:\/\/www.nw18.com"},"grossProfits":{"0":23491700000},"totalCash":{"0":2167899904},"totalDebt":{"0":31433601024},"totalRevenue":{"0":61673000960},"totalCashPerShare":{"0":2.079},"revenuePerShare":{"0":59.172},"bookValue":{"0":5.308},"priceToBook":{"0":12.452901},"marketCap":{"0":69203394560},"averageVolume":{"0":1485717},"fiftyTwoWeekHigh":{"0":117.5},"fiftyTwoWeekLow":{"0":57.4},"logo_url":{"0":"https:\/\/logo.clearbit.com\/nw18.com"}}