{"sector":{"0":"Utilities"},"longName":{"0":"NHPC Limited"},"fullTimeEmployees":{"0":5092},"longBusinessSummary":{"0":"NHPC Limited, together with its subsidiaries, generates and sells electricity in India. The company generates electricity through hydro, wind, and solar power stations. It owns and operates 24 power stations with an installed capacity of 7071.2 megawatts. The company also offers consultancy services in the areas of river basin studies; detailed survey and investigations; cost engineering; environmental impact assessment and environmental management plans; project reports, clearances, and investment decision; tendering for civil \/ mechanical \/electrical works; contract management and assistance in procurement; equipment planning and management; construction planning and management; quality control and assurance; operation and maintenance; renovation, modernization, and uprating of hydropower stations; hydro power, tidal, wind, and geothermal development; lenders independent engineers\/ review consultant\/ techno\u0096commercial advisory services; projects execution; training \/ human resources development; and information technology and communication. In addition, it provides project management and construction contract services, as well as trades in power. The company sells electricity to bulk customers that include electricity utilities owned by state governments\/private distribution companies. The company was formerly known as National Hydroelectric Power Corporation Ltd. NHPC Limited was incorporated in 1975 and is based in Faridabad, India."},"city":{"0":"Faridabad"},"phone":{"0":"91 12 9258 8500"},"website":{"0":"https:\/\/www.nhpcindia.com"},"grossProfits":{"0":79612600000},"totalCash":{"0":17281800192},"totalDebt":{"0":281131515904},"totalRevenue":{"0":95568003072},"totalCashPerShare":{"0":1.72},"revenuePerShare":{"0":9.513},"bookValue":{"0":31.23},"priceToBook":{"0":1.2728146},"marketCap":{"0":399928721408},"averageVolume":{"0":16288152},"fiftyTwoWeekHigh":{"0":46.9},"fiftyTwoWeekLow":{"0":27.05},"logo_url":{"0":"https:\/\/logo.clearbit.com\/nhpcindia.com"}}