{"sector":{"0":"Consumer Defensive"},"longName":{"0":"NIIT Limited"},"fullTimeEmployees":{"0":3104},"longBusinessSummary":{"0":"NIIT Limited provides learning and knowledge solutions to individuals, enterprises, and institutions worldwide. It offers managed training services, such as custom curriculum design and content development, learning administration and technology, learning delivery, strategic sourcing, and advisory services; and learning and development transformation services, including augmented and virtual reality-based learning solutions, curriculum transformation, and portfolio optimization. The company also provides skills and careers programs, which includes software and product engineering, data sciences and analytics, cloud computing, cybersecurity, banking and finance, digital marketing, content design, UI\/UX, project\/product\/ program management, sales & service excellence, professional life skills, business process excellence, and multi-sectoral vocational and professional skills. Its brands portfolio comprises the training.com, a learning platform for career programs; NIIT.tv, a digital learning platform; banking, insurance, and financial services under IFBI brand; and NIIT NGuru that offers various education solutions for schools comprising interactive classrooms for teachers, as well as math lab, mobile science labs, IT wizard programs, learning labs for students, and education resource planning solution for the school management. In addition, the company provides Talent Pipeline as a Service, a just-in-time job ready talent that offers talent sourcing, training, and onboarding services; and StackRoute program. The company was incorporated in 1981 and is based in Gurugram, India."},"city":{"0":"Gurugram"},"phone":{"0":"91 12 4429 3000"},"website":{"0":"https:\/\/www.niit.com"},"grossProfits":{"0":6689520000},"totalCash":{"0":12438420480},"totalDebt":{"0":252260000},"totalRevenue":{"0":14800490496},"totalCashPerShare":{"0":92.916},"revenuePerShare":{"0":110.694},"bookValue":{"0":109.537},"priceToBook":{"0":2.8501785},"marketCap":{"0":41728655360},"averageVolume":{"0":560851},"fiftyTwoWeekHigh":{"0":658.65},"fiftyTwoWeekLow":{"0":271},"logo_url":{"0":"https:\/\/logo.clearbit.com\/niit.com"}}