{"sector":{"0":"Technology"},"longName":{"0":"Oracle Financial Services Software Limited"},"fullTimeEmployees":{"0":8657},"longBusinessSummary":{"0":"Oracle Financial Services Software Limited provides information technology (IT) solutions and business processing services to the financial services industry worldwide. It operates in two segments, Product Licenses and Related Activities; and IT Solutions and Consulting Services. The company offers Oracle FLEXCUBE, a banking solution for retail, corporate and investment banking, consumer lending, asset management, and investor servicing with payments; Oracle Banking Digital Experience, a digital banking solution; Oracle Financial Services Lending and Leasing, an asset finance solution; and Oracle Banking APIs that enables banks to build partnerships with third-party technology organizations. It also provides Oracle FLEXCUBE Universal Banking; Oracle Banking Platform; Oracle FLEXCUBE Investor Servicing; Oracle Banking Enterprise Limits and Collateral Management; Oracle FLEXCUBE for Islamic Banking; Oracle Banking Branch; Oracle Banking Origination; Oracle Banking Cash Management; Oracle Banking Liquidity Management; Oracle Banking Corporate Lending; Oracle Banking Supply Chain Finance; Oracle Banking Trade Finance; Oracle Banking Treasury Management; Oracle Banking Virtual Account Management; Oracle Banking Payments; Oracle Banking Corporate Lending Process Management; Oracle Banking Credit Facilities Process Management; Oracle Banking Enterprise Collections; and Oracle Banking Enterprise Originations. In addition, the company offers a suite of industry applications catering to the areas of risk, finance, treasury, front office, regulatory reporting, and compliance. Further, it provides Oracle Financial Services PrimeSourcing, a suite of consulting and application services; and Oracle Financial Services BPO Services for back-office work and contact center services. The company was incorporated in 1989 and is headquartered in Mumbai, India. Oracle Financial Services Software Limited is a subsidiary of Oracle Global (Mauritius) Limited."},"city":{"0":"Mumbai"},"phone":{"0":"91 22 6718 3000"},"website":{"0":"https:\/\/www.oracle.com\/industries\/financial-services\/"},"grossProfits":{"0":28051500000},"totalCash":{"0":44455030784},"totalDebt":{"0":776670016},"totalRevenue":{"0":53216002048},"totalCashPerShare":{"0":514.79},"revenuePerShare":{"0":616.801},"bookValue":{"0":743.11},"priceToBook":{"0":4.0685096},"marketCap":{"0":260778754048},"averageVolume":{"0":79467},"fiftyTwoWeekHigh":{"0":4230},"fiftyTwoWeekLow":{"0":2883.25},"logo_url":{"0":"https:\/\/logo.clearbit.com\/oracle.com"}}