{"sector":{"0":"Consumer Cyclical"},"longName":{"0":"Orient Electric Limited"},"fullTimeEmployees":{"0":899},"longBusinessSummary":{"0":"Orient Electric Limited manufactures, purchases, and sells electrical consumer durables, and lighting and switchgear products in India. The company operates in two segments, Electrical Consumer Durables, and Lighting and Switchgear. It offers ceiling, portable, airflow, wall, lifestyle, stand, table, exhaust, and multi-utility fans, as well as related components and accessories; and home appliances, such as air coolers, room and water heaters, oil filled radiators, heat convectors, dry irons, mixer grinders, juicer mixer grinders, wet grinders, electric kettles and rice cookers, induction cooktops, electric choppers and toasters, and electric hand mixers; and health appliances. The company also provides lighting products comprising LED bulbs and luminaires, LED lamps and tubes, professional lighting products, CFLs, fluorescent tube lights, incandescent lamps, and conventional fittings; and switchgears, including miniature and residual current circuit breakers, distribution boards, isolators, and modular switches and plates, as well as wiring accessories. Orient Electric Limited also exports its products to approximately 26 countries. The company sells its products through a sales\/distribution network, as well as online. It also franchises smart shops. Orient Electric Limited was incorporated in 2016 and is headquartered in New Delhi, India."},"city":{"0":"New Delhi"},"phone":{"0":"91 11 4050 7000"},"website":{"0":"https:\/\/www.orientelectric.com"},"grossProfits":{"0":6778300000},"totalCash":{"0":1499800064},"totalDebt":{"0":675400000},"totalRevenue":{"0":26476800000},"totalCashPerShare":{"0":7.068},"revenuePerShare":{"0":124.163},"bookValue":{"0":16.793},"priceToBook":{"0":15.697018},"marketCap":{"0":55939612672},"averageVolume":{"0":159185},"fiftyTwoWeekHigh":{"0":381},"fiftyTwoWeekLow":{"0":244},"logo_url":{"0":"https:\/\/logo.clearbit.com\/orientelectric.com"}}