{"sector":{"0":"Technology"},"longName":{"0":"Persistent Systems Limited"},"fullTimeEmployees":{"0":null},"longBusinessSummary":{"0":"Persistent Systems Limited provides software products, services, and technology solutions in India, North America, and internationally. It provides payments, cloud and infrastructure, intelligent automation, data governance and security, Persistent digital bank and credit union, loan origination, data and analytics, operations automation, and regulatory compliance management solutions; foreign exchange and trade finance, and treasury and cash management services; product and platform strategy, engineering, modernization, and sustenance and support solutions; and enterprise IT security services. The company also offers CX transformation, and integrated wellness and care solutions for insurance; claims lifecycle management automation solutions; Persistent digital front door, revenue cycle optimization, healthcare interoperability, and population health management solutions; patient claims management, care management, and payor operations solutions; product and digital engineering solutions; digital lab and optimization, cloud migration and modernization, decentralized trails, quality management and compliance, and genomics solutions; and commercial and multiplatform analytics and integration, as well as robotic process automation and quality management system solutions. In addition, it provides IBM engineering lifecycle management solutions; Dassault 3D experience platforms, as well as planning and optimization, and manufacturing and operations software; and engineering managed and integration services. Further, the company offers network assurance and performance management, 5G AI operations and automation, mobile edge cloud accelerators, and network API monetization solutions; and operates technology centers. It serves customers in the banking, financial services, insurance, healthcare, life sciences, industrial, software and hi-tech, and telecom and media sectors. Persistent Systems Limited was incorporated in 1990 and is based in Pune, India."},"city":{"0":"Pune"},"phone":{"0":"91 20 6746 2084"},"website":{"0":"https:\/\/www.persistent.com"},"grossProfits":{"0":14351050000},"totalCash":{"0":10941559808},"totalDebt":{"0":7518309888},"totalRevenue":{"0":70563233792},"totalCashPerShare":{"0":149.782},"revenuePerShare":{"0":936.815},"bookValue":{"0":365.899},"priceToBook":{"0":10.579149},"marketCap":{"0":295833534464},"averageVolume":{"0":316972},"fiftyTwoWeekHigh":{"0":4987.5},"fiftyTwoWeekLow":{"0":3092.05},"logo_url":{"0":"https:\/\/logo.clearbit.com\/persistent.com"}}