{"sector":{"0":"Financial Services"},"longName":{"0":"Power Finance Corporation Limited"},"fullTimeEmployees":{"0":501},"longBusinessSummary":{"0":"Power Finance Corporation Limited, a non-banking finance company, provides financial products and related advisory, and other services to the power sector in India. The company offers fund based financial policies\/products, including guidelines for solar and wind power generation projects, as well as for funding private sector independent transmission projects; debt refinancing and prepayment policy for solar wind projects; and takeout financing, asset acquisition, bridge and corporate loan, buyer's line of credit, credit facility for purchase of power through power exchange, energy saving project, and project and short-term loan services. Its fund based financial policies\/products also include financing of fuel supply projects and equipment manufacturers; grants\/interest free loans for studies\/consultancies; lease financing for the purchase of equipment and wind power projects; line of credit for import of coal; policy for underwriting of debt; and financial assistance to distribution franchisee. In addition, the company provides non-fund based policies\/products comprising guarantees, letter of comfort, and policy for guarantee for credit enhancement; and non-fund based consultancy services. Power Finance Corporation Limited was incorporated in 1986 and is headquartered in New Delhi, India."},"city":{"0":"New Delhi"},"phone":{"0":"91 11 2355 6000"},"website":{"0":"https:\/\/www.pfcindia.com"},"grossProfits":{"0":278986400000},"totalCash":{"0":152752291840},"totalDebt":{"0":6611326730240},"totalRevenue":{"0":265407496192},"totalCashPerShare":{"0":57.845},"revenuePerShare":{"0":100.521},"bookValue":{"0":226.414},"priceToBook":{"0":0.62341547},"marketCap":{"0":372647264256},"averageVolume":{"0":6649146},"fiftyTwoWeekHigh":{"0":147.8},"fiftyTwoWeekLow":{"0":97.1},"logo_url":{"0":"https:\/\/logo.clearbit.com\/pfcindia.com"}}