{"sector":{"0":"Financial Services"},"longName":{"0":"Punjab National Bank"},"fullTimeEmployees":{"0":103144},"longBusinessSummary":{"0":"Punjab National Bank provides various banking and financial products and services in India. The company operates through Treasury, Corporate\/Wholesale Banking, Retail Banking, and Other Banking Operations segments. It offers personal banking products and services, including saving fund accounts, current accounts, fixed deposit, and capital gain account and gold monetization schemes; housing, vehicle, education, personal, and mortgage loans; and cards. The company also provides various micro, small, and medium enterprises schemes; banking products for government customers; agricultural banking services; corporate banking products and services consisting of loans against future lease rentals, working capital financing, and term loans; EXIM finance and cash management services, as well as gold card schemes for exporters; and international banking products and services. In addition, it offers insurance services, such as life, fire, motor, marine, theft\/burglary, fidelity guarantee, personal accident, health, travel, house hold goods, etc.; and depository, mutual fund, merchant banking, and application supported by blocked amount services. Further, the company provides mobile banking, SMS banking, missed call, e-statement, ATM, cash deposit machine, passbook updating machine, and electronic cheque deposit machine services, as well as debit cards. As of March 31, 2022, it operated a network of 10,098 branches in India; and 2 branches comprising 1 in Hong Kong and 1 in Dubai, as well as 2 representative offices in Bangladesh and Myanmar. The company was founded in 1895 and is headquartered in New Delhi, India."},"city":{"0":"New Delhi"},"phone":{"0":"91 11 2804 4857"},"website":{"0":"https:\/\/www.pnbindia.in"},"grossProfits":{"0":241667300000},"totalCash":{"0":1158289424384},"totalDebt":{"0":814333296640},"totalRevenue":{"0":232205697024},"totalCashPerShare":{"0":106.895},"revenuePerShare":{"0":21.156},"bookValue":{"0":96.825},"priceToBook":{"0":0.5830106},"marketCap":{"0":621570949120},"averageVolume":{"0":115624569},"fiftyTwoWeekHigh":{"0":62},"fiftyTwoWeekLow":{"0":28.05},"logo_url":{"0":"https:\/\/logo.clearbit.com\/pnbindia.in"}}