{"sector":{"0":"Healthcare"},"longName":{"0":"Poly Medicure Limited"},"fullTimeEmployees":{"0":2140},"longBusinessSummary":{"0":"Poly Medicure Limited manufactures and sells medical devices. It offers infusion devices, such as I.V. cannulas, mid line catheters, arterial cannula, three way stop cocks, I.V. infusion sets, manifolds, safety winged infusion sets, T-type extension sets, stylet\/mandrin with luer locks, vial access spikes, measured volume fluid administration sets, extension lines, central venous catheters, CVP manometers, needle free connectors, pre filled syringes, vascular accesses, and blood administration sets. The company also provides nasogastric and infant feeding tubes, gastro-duodenal feeding tubes, and umbilical catheters; urine collection bags, foley balloon catheters, irrigation sets, urine drainage catheters, and urine collection bags with measured volume meters; and endotracheal and tracheostomy tubes, mucus extractors, ventilator circuits, bain circuits, catheter mounts, spinal needles, HME filters, and laryngeal mask airways. It offers oncology products; endo bronchial suction catheters, oxygen catheters, respiratory exercisers, nasal oxygen cannulas, oro-pharyngeal airways, variable concentration masks, oxygen mask with reservoirs, fixed concentration masks, and aerosol therapy masks; and dialyzers, blood lines, dialysis systems, fistula needles, haemodialysis catheters, and peritoneal dialysis and transfusion sets. The company provides closed wound suction units, under water seal drainage systems, high pressure vacuum bottles, yankauer suction sets, and thoracic drainage catheters; blood collection tubes, safety blood collection sets, blood collection needles, erythrocyte sedimentation rate pipettes, and luer adaptors; blood bag systems; face protective shields, polymasks, and viral transport medium kits; and insulin syringes, sputum collectors, dry brushes, umbilical cord clamps, luer locks, cannula fixators, injection stoppers, luer lock injection sites, universal caps, and ECG electrodes. The company was incorporated in 1995 and is based in New Delhi, India."},"city":{"0":"New Delhi"},"phone":{"0":"91 11 2632 1838"},"website":{"0":"https:\/\/www.polymedicure.com"},"grossProfits":{"0":5724481000},"totalCash":{"0":3516704000},"totalDebt":{"0":1267084032},"totalRevenue":{"0":9599762432},"totalCashPerShare":{"0":36.67},"revenuePerShare":{"0":100.101},"bookValue":{"0":56.301},"priceToBook":{"0":15.947319},"marketCap":{"0":86086393856},"averageVolume":{"0":51335},"fiftyTwoWeekHigh":{"0":1045},"fiftyTwoWeekLow":{"0":651.1},"logo_url":{"0":"https:\/\/logo.clearbit.com\/polymedicure.com"}}