{"sector":{"0":"Basic Materials"},"longName":{"0":"Polyplex Corporation Limited"},"fullTimeEmployees":{"0":2650},"longBusinessSummary":{"0":"Polyplex Corporation Limited manufactures and sells polyester (PET) films primarily for flexible packaging in India and internationally. The company offers Sarafil base films, including biaxially-oriented (BO) PET films for use in packaging, electrical, and industrial applications; BO polypropylene (PP) films for flexible packaging and other applications; cast PP films for flexible packaging and other applications; blown PP films used in pressure sensitive applications; sustainable films; holographic films; and transfer metalized papers. It also provides Saracote silicone coated PET\/PP films, such as release liner-labels, release liner-specialty products, shingle roofing tapes, release film liners, and primer coated liners used in labels, tapes, roofing shingles, and peels and sticks underlayments. In addition, the company offers Saralam range of extrusion coated film products comprising reflective insulation, decorative lamination, PET thermal lamination film-thin and thick gauge, PP thermal lamination, MegaBond PET and PP thermal lamination, nylon thermal lamination, and Zafira UV polyester thermal lamination films for use in thermal lamination products, such as book covers, identity cards, etc., as well as in carton lamination, commercial films, etc. Further, it provides Saraprint, a non tearable PET films, such as digital print media products, polyester master plates, laser printer, inkjet, backlit, and label face films for various applications comprising photo albums, commercial printing, promotional and customized digital printing, and label and flexible packaging applications, as well as in durable displays, certificates, aadhar cards, product catalogues, company brochures, signage, posters, graphic industries, visiting cards, menu cards, bills, and self-adhesive labels applications. Polyplex Corporation Limited was incorporated in 1984 and is based in Noida, India."},"city":{"0":"Noida"},"phone":{"0":"91 12 0244 3716"},"website":{"0":"https:\/\/www.polyplex.com"},"grossProfits":{"0":29493689000},"totalCash":{"0":10454200320},"totalDebt":{"0":9455699968},"totalRevenue":{"0":72170397696},"totalCashPerShare":{"0":332.992},"revenuePerShare":{"0":2299.002},"bookValue":{"0":1010.39},"priceToBook":{"0":1.5767179},"marketCap":{"0":50011389952},"averageVolume":{"0":125098},"fiftyTwoWeekHigh":{"0":2870.2},"fiftyTwoWeekLow":{"0":1462},"logo_url":{"0":"https:\/\/logo.clearbit.com\/polyplex.com"}}