{"sector":{"0":"Utilities"},"longName":{"0":"Power Grid Corporation of India Limited"},"fullTimeEmployees":{"0":8536},"longBusinessSummary":{"0":"Power Grid Corporation of India Limited, an electric power transmission utility, engages in the transmission of power in India. It operates in three segments: Transmission Services, Telecom Services, and Consultancy Services. As of March 31, 2022, the company owned and operated 1,72,437 circuit kms of transmission lines, as well as 265 substations with transformation capacity of 4,74,457 mega volt ampere. It also provides consultancy services, including power system planning and techno-economic feasibility studies; environmental and social impact assessment; design and engineering; procurement assistance; project management and construction supervision; asset management; and other services, such as owners' and lenders' engineer service; grid code and tariff mechanisms preparation; legal and technical advisory; and market analysis advisory services, as well as renewable energy certificate mechanism implementation. The company offers its consultancy services to firms, utilities, government departments, and IFIs in Afghanistan, Bangladesh, Kenya, Ethiopia, the United Arab Emirates, Nepal, Bhutan, Myanmar, Kyrgyzstan, Tajikistan, and Pakistan. In addition, it provides overhead optic fiber network services using optical ground wire on power transmission lines under the POWERTEL brand name; and operates EV charging stations. The company was formerly known as National Power Transmission Corporation Limited and changed its name to Power Grid Corporation of India Limited in October 1992. Power Grid Corporation of India Limited was incorporated in 1989 and is based in Gurugram, India."},"city":{"0":"Gurugram"},"phone":{"0":"91 12 4257 1700"},"website":{"0":"https:\/\/www.powergrid.in"},"grossProfits":{"0":407868400000},"totalCash":{"0":50195398656},"totalDebt":{"0":1381831278592},"totalRevenue":{"0":423029702656},"totalCashPerShare":{"0":7.196},"revenuePerShare":{"0":60.646},"bookValue":{"0":129.457},"priceToBook":{"0":1.6507411},"marketCap":{"0":1490653675520},"averageVolume":{"0":9243562},"fiftyTwoWeekHigh":{"0":248.35},"fiftyTwoWeekLow":{"0":186.35},"logo_url":{"0":"https:\/\/logo.clearbit.com\/powergrid.in"}}