{"sector":{"0":"Basic Materials"},"longName":{"0":"Privi Speciality Chemicals Limited"},"fullTimeEmployees":{"0":725},"longBusinessSummary":{"0":"Privi Speciality Chemicals Limited operates as a manufacturer, supplier, and exporter of aroma and fragrance chemicals in India and internationally. The company offers amber fleur, acetates, dihydromyrcenol, ionones, nitriles, sandal wood derivatives, and specialty chemicals, as well as bulk aroma chemicals. It also provides aroma chemicals, including alpha damascone, alpha ionone, alpha terpenyl acetate, amber fleur, amber gamma, beta iso damascol, BI perfumery grade, BI technical grade, carene-60 & Carene-90, cedar ketol, citronellal, citronellyl acetate, citronellyl nitrile, dipentene, double distilled turpentine oil, dihydro myrcenol, dihydromyrcene, gamma methyl ionone, gamma terpenyl acetate, geraniol, geranyl acetate, Indian sandal core, ionone, iso boronyl acetate, l-limonene, methyl ionone, nerol, neryl acetate, nimberol, OTBCHA, pine oil, prionyl, PTBCHA, rose oxide, terpeniol alpha, terpeniol gamma, terpeniol BP grade, terpinolene, and sandal fleur, as well as sandal touch, tetrahydroflorol, tetrahydrogeraniol, tetrahydrogeranyl acetate, tetrahydromyrcenol, timber forte, and timber touch. The company was formerly known as Fairchem Speciality Limited and changed its name to Privi Speciality Chemicals Limited in October 2020. Privi Speciality Chemicals Limited was incorporated in 1985 and is based in Mumbai, India."},"city":{"0":"Mumbai"},"phone":{"0":"91 22 3304 3500"},"website":{"0":"https:\/\/www.privi.com"},"grossProfits":{"0":5573988000},"totalCash":{"0":493904000},"totalDebt":{"0":9330136064},"totalRevenue":{"0":14602398720},"totalCashPerShare":{"0":12.679},"revenuePerShare":{"0":374.088},"bookValue":{"0":161.737},"priceToBook":{"0":7.0691924},"marketCap":{"0":44661649408},"averageVolume":{"0":19422},"fiftyTwoWeekHigh":{"0":2249},"fiftyTwoWeekLow":{"0":1015.3},"logo_url":{"0":"https:\/\/logo.clearbit.com\/privi.com"}}