{"sector":{"0":"Technology"},"longName":{"0":"Redington Limited"},"fullTimeEmployees":{"0":4025},"longBusinessSummary":{"0":"Redington (India) Limited provides supply chain solutions for information technology products, telecom, lifestyle, healthcare, and solar products in India and internationally. The company distributes IT hardware and software products, including consumer and commercial PCs, desktops, laptops, and MacBooks; tablets and phablets; deskjets, laserjets, and related consumables and accessories; smartphones and augmented reality\/virtual reality-powered wearables; and networking, enterprise server and storage, as well as software solutions, and licensing and subscription support services. It also offers cloud consulting, migration, DevOps, integration, and security products, as well as managed services; and develops, manufactures, and markets digital printing solutions comprising printing presses, proprietary consumables, and workflow. In addition, the company is involved in the on demand part manufacturing business that consists of SLA, SLS, multi jet printing, color jet printing, vacuum casting, direct metal printing, metal die casting, CNC machines plastic and metals, and investment casting patterns. Further, it provides enterprise solutions and services, such as SOC and NOC services, converged network solutions, ICT and physical security solutions, and cloud services and solutions, as well as IT consulting, storage, data center, and virtualization solutions; and infrastructure managed services, including annual maintenance contracts, facility management services, managed print services, and IT outsourcing and helpdesk services. Additionally, the company offers spare part management; professional services comprising RBT and onsite repair, one time implementation projects, vendor managed support, and migrations and upgrades, as well as DOA validations, pats, and product screening; and logistics services. Redington (India) Limited was incorporated in 1961 and is based in Chennai, India."},"city":{"0":"Chennai"},"phone":{"0":"91 44 4224 3353"},"website":{"0":"https:\/\/redingtongroup.com\/india\/"},"grossProfits":{"0":37897500000},"totalCash":{"0":36714799104},"totalDebt":{"0":8307599872},"totalRevenue":{"0":660492189696},"totalCashPerShare":{"0":46.983},"revenuePerShare":{"0":845.231},"bookValue":{"0":115.373},"priceToBook":{"0":1.5670911},"marketCap":{"0":141276577792},"averageVolume":{"0":4372256},"fiftyTwoWeekHigh":{"0":202.3},"fiftyTwoWeekLow":{"0":109.4},"logo_url":{"0":"https:\/\/logo.clearbit.com\/redingtongroup.com"}}