{"sector":{"0":"Industrials"},"longName":{"0":"RITES Limited"},"fullTimeEmployees":{"0":2154},"longBusinessSummary":{"0":"RITES Limited, together with its subsidiaries, provides consultancy, engineering, and project management services in the field of railways, highways, airports, ports, ropeways, urban transport, inland waterways, and renewable energy. The company operates through four segments: Consultancy Services; Leasing of Railway Rolling Stock & Equipments; Export of Rolling Stock, Equipments and spares; and Turnkey Construction Projects. It is involved in the survey and feasibility studies, detailed design and engineering, project management consultancy, technical audit, third party inspection, quality assurance, construction supervision, and leasing and export of locomotives and rolling stock; and maintenance and operational facilities such as smart yards, coaching, and freight maintenance depots. The company also constructs railway workshops, track doubling \/tripling\/quadruplicating, new\/additional railway line, railway electrification, redevelopment of railway stations, institutional buildings, wind, solar and other renewable energy projects on a turnkey basis; and civil construction works; and generates power from windmills and solar energy plants. In addition, it offers services in the field of road\/railway tunnels engineering, urban engineering, electrical engineering, information technology, privatization and concession projects, railway electrification, rolling stock design, railway equipment, signaling & telecommunications, surveys, and training programs. The company serves central\/state governments, public sector undertakings, large corporations, and private enterprises in India, Asia, and Africa. RITES Limited was incorporated in 1974 and is based in Gurugram, India."},"city":{"0":"Gurugram"},"phone":{"0":"91 12 4257 1666"},"website":{"0":"https:\/\/www.rites.com"},"grossProfits":{"0":8956500000},"totalCash":{"0":7835700224},"totalDebt":{"0":275900000},"totalRevenue":{"0":29118199808},"totalCashPerShare":{"0":32.592},"revenuePerShare":{"0":121.125},"bookValue":{"0":108.02},"priceToBook":{"0":3.1406221},"marketCap":{"0":81583521792},"averageVolume":{"0":1639522},"fiftyTwoWeekHigh":{"0":433},"fiftyTwoWeekLow":{"0":226.2},"logo_url":{"0":"https:\/\/logo.clearbit.com\/rites.com"}}