{"sector":{"0":"Consumer Cyclical"},"longName":{"0":"Schaeffler India Limited"},"fullTimeEmployees":{"0":1078},"longBusinessSummary":{"0":"Schaeffler India Limited develops, manufactures, and distributes high-precision roller and ball bearings, and related components worldwide. It offers ball, cylindrical, spherical, and tapered roller bearings, as well as wheel bearings. The company also provides engine and transmission components for front accessory drive systems, chain drive systems, valve train components, shift systems, and a range of needle roller bearings and elements; clutch systems and dual mass flywheels for passenger cars, light commercial vehicles, heavy commercial vehicles, and tractors; and concentric slave cylinder, clutch master cylinder, semi slave cylinder, adapter, and high-pressure pipe assemblies. In addition, it offers engine oil, transmission oil, grease, coolant, hydraulic oil, and shock absorber oil. The company offers its products under the brand names of Schaeffler, LuK, INA, FAG, and Schaeffler TruPower. It serves the construction machinery, electrical engineering, industrial gear, mining and cement, power generation, agricultural engineering, steel plant, motorcycle, textile machinery, machine tool, wind power, pulp and paper, automotive and tractor, precision equipment, machine tools and material handling, car and truck, railway, two wheelers, renewable energy, power transmission, off highway, automation, and heavy, as well as MRO-steel, raw material, power, paper, and pulp industries. The company was formerly known as FAG Bearings India Limited and changed its name to Schaeffler India Limited in July 2017. Schaeffler India Limited was incorporated in 1962 and is based in Pune, India."},"city":{"0":"Pune"},"phone":{"0":"91 20 6819 8400"},"website":{"0":"https:\/\/www.schaeffler.co.in"},"grossProfits":{"0":20981200000},"totalCash":{"0":13396100096},"totalDebt":{"0":581500032},"totalRevenue":{"0":65959899136},"totalCashPerShare":{"0":85.841},"revenuePerShare":{"0":421.68},"bookValue":{"0":1004.548},"priceToBook":{"0":2.7342148},"marketCap":{"0":85862195200},"averageVolume":{"0":164954},"fiftyTwoWeekHigh":{"0":3969.85},"fiftyTwoWeekLow":{"0":1598},"logo_url":{"0":"https:\/\/logo.clearbit.com\/schaeffler.co.in"}}