{"sector":{"0":"Industrials"},"longName":{"0":"The Shipping Corporation of India Limited"},"fullTimeEmployees":{"0":547},"longBusinessSummary":{"0":"The Shipping Corporation of India Limited provides shipping services in India, Singapore, and internationally. It operates through Liner, Bulk, Tanker, Technical & Offshore, and Others segments. The company's fleet comprises bulk carriers, crude oil tankers, product tankers, container vessels, passenger-cum-cargo vessels, LPG carriers, and offshore supply vessels. Its bulk carriers transport cargos, including iron ore, coal, coke, grain, fertilizer, steel, plywood, bauxite products, etc.; tankers are used for feeding crude oil to various oil refineries; and passenger-cum-cargo vessels offer transportation services between the Mainland, and Andaman and Nicobar group of islands. The company is also involved in the chartering of various ships, as well as in lighterage operations. In addition, it provides offshore services comprising towing and anchor handling, carriage of men and materials, standby and rescue, routine surveillance, and firefighting services, as well as dry docking services. Further, the company offers shipbuilding consultancy assistance services for new building vessels, including project viability and feasibility, design consultancy, project management, and site supervision; and for the acquisition of second-hand ships, such as identifying the type and size of vessels, receipt and evaluation of offers, inspection of class records, physical inspection of vessels, processing specific proposals for owners\/government approval, taking delivery of the vessels, etc., as well as provides liner break-bulk and container services. It operates a fleet of 59 vessels with deadweight tonnage of 5.311 million. The Shipping Corporation of India Limited was incorporated in 1950 and is based in Mumbai, India."},"city":{"0":"Mumbai"},"phone":{"0":"91 22 2202 6666"},"website":{"0":"https:\/\/www.shipindia.com"},"grossProfits":{"0":16078300000},"totalCash":{"0":14070200320},"totalDebt":{"0":32003700736},"totalRevenue":{"0":54320898048},"totalCashPerShare":{"0":30.194},"revenuePerShare":{"0":116.6},"bookValue":{"0":170.321},"priceToBook":{"0":0.7981987},"marketCap":{"0":63461187584},"averageVolume":{"0":2038880},"fiftyTwoWeekHigh":{"0":151.4},"fiftyTwoWeekLow":{"0":85.6},"logo_url":{"0":"https:\/\/logo.clearbit.com\/shipindia.com"}}