{"sector":{"0":"Industrials"},"longName":{"0":"Siemens Limited"},"fullTimeEmployees":{"0":8608},"longBusinessSummary":{"0":"Siemens Limited manufactures and sells electric motors, generators, transformers, electricity distribution and control apparatus, general purpose machinery, and other electrical equipment in India and internationally. The company's Energy segment provides integrated products, solutions, and services for oil and gas production, and power generation and transmission. It serves oil and gas, utilities, independent power producers, and engineering, procurement, and construction companies. Its Smart Infrastructure segment supplies products, systems, solutions, and services for transmission and distribution of electrical energy for power utilities, industrial companies, and infrastructure segments. This segment offers systems for low and medium voltage distribution; solutions for smart grids and energy automation; and low voltage power supply systems, as well as intelligent and connected infrastructure for grids and buildings. The company's Mobility segment provides solutions for passenger and freight transportation, including rail vehicles, rail automation systems, rail electrification systems, road traffic technology, and IT solutions. Its Portfolio Companies segment provides products, services, and mining and minerals solutions to industry sector. The company's Digital Industries segment offers automation, drives, and software technologies covering the complete life cycle from product design and production execution to services for discrete and process industries. The company also engages in the lease rental business. Additionally, it manufactures electronic components and optical products, and industrial machinery and equipment, as well as engages in the repair of fabricated metal products, and machinery and equipment. The company was formerly known as Siemens India Limited and changed its name to Siemens Limited in March 1987. Siemens Limited was founded in 1867 and is based in Mumbai, India. Siemens Limited operates as a subsidiary of Siemens Aktiengesellschaft."},"city":{"0":"Mumbai"},"phone":{"0":"91 22 6251 7000"},"website":{"0":"https:\/\/www.siemens.co.in"},"grossProfits":{"0":42006000000},"totalCash":{"0":50889998336},"totalDebt":{"0":2038000000},"totalRevenue":{"0":160949993472},"totalCashPerShare":{"0":142.837},"revenuePerShare":{"0":452.039},"bookValue":{"0":266.539},"priceToBook":{"0":10.604076},"marketCap":{"0":1006537539584},"averageVolume":{"0":356722},"fiftyTwoWeekHigh":{"0":3138.5},"fiftyTwoWeekLow":{"0":2150.1},"logo_url":{"0":"https:\/\/logo.clearbit.com\/siemens.co.in"}}