{"sector":{"0":"Industrials"},"longName":{"0":"SIS Limited"},"fullTimeEmployees":{"0":250901},"longBusinessSummary":{"0":"SIS Limited, together with its subsidiaries, operates as a security and related services company in India, Australia, Singapore, and New Zealand. It operates through three business groups: Security Services (India), Security Services (International), and Facility Management. The company offers manned guarding, training, physical security, fire detection and suppression, maritime and aviation security, perimeter protection, command and control center, access control\/entry automation, closed circuit television, intrusion detection, and paramedic and emergency response services; and loss prevention, asset protection, and rowing and mobile patrolling services. It also provides cash logistics services, including cash-in-transit, door step banking, ATM cash replenishment, and precious items and bullion transportation services; and alarm monitoring and response services, such as trading and installation of electronic security devices and systems. In addition, the company offers facility management services, which include cleaning, house-keeping, pest control management, office support, gardening, mechanical, and electrical maintenance, plumbing, preventive maintenance, repairing, and business process outsourcing services, as well as asset management, short-term repairs, heating, ventilation, and air-conditioning services. It serves power, telecom, transportation, aviation, ports, logistics, real estate and townships, educational institutions, and healthcare establishments. The company was formerly known as Security and Intelligence Services (India) Limited and changed its name to SIS Limited in January 2021. SIS Limited was incorporated in 1985 and is based in New Delhi, India."},"city":{"0":"New Delhi"},"phone":{"0":"91 11 4646 4444"},"website":{"0":"https:\/\/www.sisindia.com"},"grossProfits":{"0":21528260000},"totalCash":{"0":7387019776},"totalDebt":{"0":14508130304},"totalRevenue":{"0":103579648000},"totalCashPerShare":{"0":50.238},"revenuePerShare":{"0":703.941},"bookValue":{"0":123.449},"priceToBook":{"0":3.1818807},"marketCap":{"0":57703104512},"averageVolume":{"0":76893},"fiftyTwoWeekHigh":{"0":560},"fiftyTwoWeekLow":{"0":373.6},"logo_url":{"0":"https:\/\/logo.clearbit.com\/sisindia.com"}}