{"sector":{"0":"Industrials"},"longName":{"0":"SKF India Limited"},"fullTimeEmployees":{"0":1681},"longBusinessSummary":{"0":"SKF India Limited supplies rotating equipment in automotive and industrial segment in India. It offers rolling bearings, bearings accessories, engineered products, and track rollers; and mounted bearings and housings, super-precision bearings, slewing bearings, plain bearings, and magnetic bearings and systems. The company also provides industrial seals, such as power transmission, hydraulic, fluid handling, and machined seals, as well as engineering services; automotive seals; and lubrication management products, such as automatic lubrication systems, lubrication system components, lubricants, lubricators, and manual lubrication tools. In addition, it offers maintenance products comprises hydraulic, mechanical, and alignment tools, as well as heaters; condition monitoring systems, such as basic and portable monitoring products, surveillance systems, and machine protection products; and power transmission solutions, including belts, pulleys, chains, sprockets, bushings and hubs, couplings, and bolts and tightening systems. Further, the company provides test and measuring equipment consisting of noise and vibration testers, grease test rigs, and waviness, roundness, as well as services for test and measuring equipment; and supplies replacement parts. Additionally, it offers technical consultancy, numerical simulation and design, and root cause analysis services; asset management; mechanical and condition based maintenance; remanufacturing; and training services in various fields. It serves aerospace, agriculture, cars and light trucks, construction, food and beverage, machine tools, marine, material handling, metals, mining, mineral processing and cement, ocean energy, and other industries. SKF India Limited was founded in 1923 and is based in Pune, India."},"city":{"0":"Pune"},"phone":{"0":"91 20 6611 2500"},"website":{"0":"https:\/\/www.skf.com\/in"},"grossProfits":{"0":13688400000},"totalCash":{"0":3994200064},"totalDebt":{"0":161000000},"totalRevenue":{"0":40270999552},"totalCashPerShare":{"0":80.792},"revenuePerShare":{"0":814.489},"bookValue":{"0":269.461},"priceToBook":{"0":16.696665},"marketCap":{"0":222426513408},"averageVolume":{"0":40788},"fiftyTwoWeekHigh":{"0":5175},"fiftyTwoWeekLow":{"0":2981.3},"logo_url":{"0":"https:\/\/logo.clearbit.com\/skf.com"}}