{"sector":{"0":"Real Estate"},"longName":{"0":"Sobha Limited"},"fullTimeEmployees":{"0":3007},"longBusinessSummary":{"0":"Sobha Limited engages in the construction, development, sale, management, and operation of residential and commercial projects primarily in India. It operates through two segments, Real Estate, and Contractual and Manufacturing. The company's residential projects include luxury and super luxury apartments, presidential apartments, villas, row houses, plotted developments, and aspirational homes; and contractual projects for corporates comprise offices, convention centers, software development blocks, multiplex theatres, hostel facilities, hotels, guest houses, food courts, restaurants, research centers, club houses, and factory buildings. It also manufactures corporate and residential interiors, and solid wood veneer and MDF panelled doors; and panelling, partitions, tables, and loose furniture like chairs, sofas, cots and modular kitchens, etc. In addition, the company manufactures and markets aluminum doors, windows, structural glazing products, MS and SS metal fabrications, aluminum composite panels and SS claddings, and pre-engineered buildings; and undertakes other architectural metal works. Further, it manufactures concrete products, such as concrete blocks, pavers, kerbs, water drainage channels, paving slabs, and landscape products; and mattresses under the Restoplus brand. The company was formerly known as Sobha Developers Limited and changed its name to Sobha Limited in August 2014. Sobha Limited was incorporated in 1995 and is headquartered in Bengaluru, India."},"city":{"0":"Bengaluru"},"phone":{"0":"91 80 4932 0000"},"website":{"0":"https:\/\/www.sobha.com"},"grossProfits":{"0":14650140000},"totalCash":{"0":1390649984},"totalDebt":{"0":28129720320},"totalRevenue":{"0":28001599488},"totalCashPerShare":{"0":14.662},"revenuePerShare":{"0":294.92},"bookValue":{"0":256.332},"priceToBook":{"0":2.2474759},"marketCap":{"0":55018643456},"averageVolume":{"0":171351},"fiftyTwoWeekHigh":{"0":1044.95},"fiftyTwoWeekLow":{"0":480.2},"logo_url":{"0":"https:\/\/logo.clearbit.com\/sobha.com"}}