{"sector":{"0":"Healthcare"},"longName":{"0":"Sun Pharma Advanced Research Company Limited"},"fullTimeEmployees":{"0":403},"longBusinessSummary":{"0":"Sun Pharma Advanced Research Company Limited, a biopharmaceutical company, engages in the research and development of pharmaceutical products in India and internationally. It develops new chemical and biological entities, and reformulated products with a therapeutic focus on oncology, neurodegeneration, ophthalmology, dermatology, and Immunology. The company offers Elepsia, a formulation of levetiracetam that is an anti-epileptic agent to treat epilepsy disorder; and Xelpros, a latanoprost ophthalmic emulsion for the treatment of open-angle glaucoma or ocular hypertension. In addition, it is developing SDN-037, a formulation of difluprednate for the treatment of inflammation and pain associated with ocular surgery that is in phase 3 clinical trial; PDP-716 to treat glaucoma, which is in phase 3 clinical trial; phenobarbital sodium for the treatment of neonatal seizures; Vodobatinib (SCO-088) for the treatment of resistant chronic myelogenous leukemia that has completed a part A of the Phase 1 study; Vodobatinib (SCC-138), which is in phase 2 clinical trial to treat Parkinson's disease; SCD-044 for the treatment of psoriasis and atopic dermatitis that is in phase 2 clinical trial; and SCO-120 for the treatment of hormone receptor-positive, human epidermal receptor 2 negative, and metastatic breast cancer, which is in phase 1 clinical trial. Sun Pharma Advanced Research Company Limited has a collaboration agreement with Bioprojet to develop an S1P receptor 1 agonist for autoimmune disorders. The company was incorporated in 2006 and is based in Mumbai, India. Sun Pharma Advanced Research Company Limited is a subsidiary of Shanghvi Finance Private Limited."},"city":{"0":"Mumbai"},"phone":{"0":"91 22 6645 5645"},"website":{"0":"https:\/\/www.sparc.life"},"grossProfits":{"0":1102606000},"totalCash":{"0":128800000},"totalDebt":{"0":792200000},"totalRevenue":{"0":1437200000},"totalCashPerShare":{"0":0.474},"revenuePerShare":{"0":5.413},"bookValue":{"0":-1.786},"priceToBook":{"0":null},"marketCap":{"0":54956089344},"averageVolume":{"0":607298},"fiftyTwoWeekHigh":{"0":349},"fiftyTwoWeekLow":{"0":170.45},"logo_url":{"0":"https:\/\/logo.clearbit.com\/sparc.life"}}