{"sector":{"0":"Basic Materials"},"longName":{"0":"SRF Limited"},"fullTimeEmployees":{"0":6674},"longBusinessSummary":{"0":"SRF Limited manufactures, purchases, and sells technical textiles, chemicals, packaging films, and other polymers. It operates through Technical Textiles Business, Chemicals Business, Packaging Film Business, and Others segments. The company offers nylon tyre cord, belting, coated, and laminated fabrics; and industrial and polyester industrial yarns. It also provides fluorochemicals, such as refrigerants for room air-conditioner, automobile air-conditioner, refrigerator, and chillers under the Floron brand, as well as propellants for the pharmaceutical sector under the Dymel brand; and industrial chemicals used in various applications comprising solvents in pharma, feedstock for pharmaceutical and agrochemicals, metal de-greasing, etching of stainless steel and glass, and dry- foam blowing cleaning. In addition, it provides advanced intermediates for the agrochemical and pharmaceutical industries. Further, the company provides bi-axially oriented polyethylene terephthalate films under PETLAR brand and bi-axially oriented polypropylene films under OPLAR brand. It serves in India, Germany, the United States, Belgium, Switzerland, and internationally. The company was formerly known as Shri Ram Fibres and changed its name to SRF Limited in 1990. The company was incorporated in 1970 and is headquartered in Gurugram, India. SRF Limited is a subsidiary of KAMA Holdings Limited."},"city":{"0":"Gurugram"},"phone":{"0":"91 12 4435 4400"},"website":{"0":"https:\/\/www.srf.com"},"grossProfits":{"0":61128500000},"totalCash":{"0":7903399936},"totalDebt":{"0":36551901184},"totalRevenue":{"0":136289796096},"totalCashPerShare":{"0":26.663},"revenuePerShare":{"0":459.912},"bookValue":{"0":949.37},"priceToBook":{"0":2.4124947},"marketCap":{"0":678907871232},"averageVolume":{"0":569494},"fiftyTwoWeekHigh":{"0":2865},"fiftyTwoWeekLow":{"0":2002.2},"logo_url":{"0":"https:\/\/logo.clearbit.com\/srf.com"}}