{"sector":{"0":"Consumer Cyclical"},"longName":{"0":"Sundram Fasteners Limited"},"fullTimeEmployees":{"0":2937},"longBusinessSummary":{"0":"Sundram Fasteners Limited manufactures and sells precision components for the automotive, infrastructure, windmill, and aviation sectors in India, China, Germany, the United States, the United Kingdom, Italy, France, and Brazil. Its products include high tensile fasteners comprising wind energy, automotive, and aerospace and aviation fasteners; cold extruded parts, including gear blanks, transmission shafts, cams, starter sleeves and pinions, CV joint parts, and fan hubs; and hot forged parts consisting of bevel gears and pinions, hub rings, clutch hubs, crankshafts sprockets, turbocharger parts, and connecting rods. It also provides powertrain components, such as turbine and output shafts, sungear shafts, and slip yokes; powder metallurgy parts comprising rotors and gears, synchronizer hubs, shock absorber components, valve train components, bushes, and structural parts; and metal and nylon radiator caps, as well as offers pumps and assemblies for passenger cars, heavy and light commercial vehicles, off-road vehicles, tractors, combines, harvesters, forklifts, marine engines, power generation engines, and two- wheelers. In addition, the company engages in the generation of power using non-conventional sources; and manufacture of parts for aerospace and defense. Further, it provides financial and software services; bearing housings; and spokes and nipples, automobile kits, dowels and rollers, small screws, and tools. The company was incorporated in 1962 and is headquartered in Chennai, India."},"city":{"0":"Chennai"},"phone":{"0":"91 44 2847 8500"},"website":{"0":"https:\/\/www.sundram.com"},"grossProfits":{"0":27299100000},"totalCash":{"0":565699968},"totalDebt":{"0":7716800000},"totalRevenue":{"0":51997499392},"totalCashPerShare":{"0":2.692},"revenuePerShare":{"0":247.465},"bookValue":{"0":98.778},"priceToBook":{"0":9.837211},"marketCap":{"0":204181372928},"averageVolume":{"0":124483},"fiftyTwoWeekHigh":{"0":1010},"fiftyTwoWeekLow":{"0":673.05},"logo_url":{"0":"https:\/\/logo.clearbit.com\/sundram.com"}}