{"sector":{"0":"Technology"},"longName":{"0":"Sterling and Wilson Renewable Energy Limited"},"fullTimeEmployees":{"0":1067},"longBusinessSummary":{"0":"Sterling and Wilson Renewable Energy Limited provides engineering, procurement, and construction (EPC) services to solar power projects. The company's EPC services primarily include the design and engineering, procurement, inspection and audit, construction, and field quality monitoring; project managing, testing, commissioning, and connecting solar projects to the grid; anchoring and mooring, planning, module, equipment floating structure installation, maintenance manual and design book issuance, bathymetric, and geotechnical assessment studies; and hybrid energy solutions, such as solar and battery energy storage, standalone turnkey battery energy storage solutions, and industrial, island, and grid connected microgrids. It also offers operations and maintenance services to third-party projects. In addition, the company imports, exports, and trades in solar modules, structures, invertors, and related accessories. Further, it engages in the installation and maintenance of solar power generating facilities and other related activities. The company's customers include independent power producers, developers, and equity funds. It operates in 25 countries with operations in India, the Middle East, North Africa, Rest of Africa, South East Asia, the United States, Australia, Europe, and Latin America. The company was formerly known as Sterling and Wilson Solar Limited and changed its name to Sterling and Wilson Renewable Energy Limited in November 2021. Sterling and Wilson Renewable Energy Limited was founded in 2011 and is based in New Delhi, India."},"city":{"0":"Mumbai"},"phone":{"0":"91 22 2548 5300"},"website":{"0":"https:\/\/www.sterlingandwilsonre.com"},"grossProfits":{"0":-4159500000},"totalCash":{"0":4786999808},"totalDebt":{"0":13278499840},"totalRevenue":{"0":40855400448},"totalCashPerShare":{"0":25.229},"revenuePerShare":{"0":223.943},"bookValue":{"0":66.048},"priceToBook":{"0":4.0463},"marketCap":{"0":50695450624},"averageVolume":{"0":249294},"fiftyTwoWeekHigh":{"0":423.45},"fiftyTwoWeekLow":{"0":256.25},"logo_url":{"0":"https:\/\/logo.clearbit.com\/sterlingandwilsonre.com"}}