{"sector":{"0":"Healthcare"},"longName":{"0":"Syngene International Limited"},"fullTimeEmployees":{"0":5975},"longBusinessSummary":{"0":"Syngene International Limited, a contract research and manufacturing company, provides drug discovery and development services in India, the United States, and internationally. The company provides discovery chemistry services, such as medicinal and synthetic chemistry, library and peptide synthesis, biomolecules, organic electronic materials, and computational and analytical chemistry; and discovery biology services in the areas of recombinant DNA engineering, cell line development, hybridoma technology, sequencing, protein sciences, screening and assay biology, DMPK, in vivo pharmacology, toxicology, and biologicals. It also offers exploratory\/discovery, in vitro and genetic, and developmental and reproductive toxicology services, as well as acute, sub-chronic, and chronic toxicity studies; and chemical, formulation, analytical, and clinical development services, as well as commercial manufacturing services. In addition, the company provides lead generation, preclinical development, API, and drug product development services; and clinical trial management, pharmacokinetic analysis\/bioanalytical, central lab, biometrics and clinical data management, regulatory, medical monitoring, pharmacovigilance, and medical writing services. Further, it offers other drug modalities, which include peptides, oligonucleotide synthesis, antibody drug conjugate, PROTACs, and CAR T-cell therapy services. The company serves pharmaceutical, biotechnology, nutrition, animal health, consumer goods, specialty chemical, and other companies. It has partnerships and collaborations with Bristol-Myers Squibb Co.; Baxter Inc.; and Amgen Inc. The company was incorporated in 1993 and is headquartered in Bengaluru, India. Syngene International Limited is a subsidiary of Biocon Limited."},"city":{"0":"Bengaluru"},"phone":{"0":"91 80 2808 2808"},"website":{"0":"https:\/\/www.syngeneintl.com"},"grossProfits":{"0":17121000000},"totalCash":{"0":11043000320},"totalDebt":{"0":10090000384},"totalRevenue":{"0":28120999936},"totalCashPerShare":{"0":27.608},"revenuePerShare":{"0":71.071},"bookValue":{"0":70.974},"priceToBook":{"0":8.250204},"marketCap":{"0":234686676992},"averageVolume":{"0":485131},"fiftyTwoWeekHigh":{"0":683},"fiftyTwoWeekLow":{"0":510.05},"logo_url":{"0":"https:\/\/logo.clearbit.com\/syngeneintl.com"}}