{"sector":{"0":"Technology"},"longName":{"0":"Tanla Platforms Limited"},"fullTimeEmployees":{"0":336},"longBusinessSummary":{"0":"Tanla Platforms Limited, together with its subsidiaries, provides cloud communication services for mobile operators and enterprises in India and internationally. It offers SMS Campaign Manager, which helps in sending instant messages whether promotional or transactional to all your customers at one go; Two-Factor Authentication; Boomering provides international calling options; and Omni Communication, a platform enables gapless changeover between communication channels for excellent customer journeys and an unsurpassed brand. The company also provides cloud voice services, including Hosted IVR solution that enables enterprises to design, build, and update custom IVR applications using a web interface; Voice Broadcast technology that enables enterprises to initiate and deploy personalized interactive voice broadcasts; Free Ring, a solution for engaging and interactive communications with customers and prospects; and Source Trace, which enables enterprises and agencies to track inbound calls back to the marketing source. In addition, it offers IoT platform, which enables businesses to connect, collect, and curate. Further, it provides Trubloq, a block chain enabled communication platform as a service (CPaaS) stack; and Wisely, which delivers communication services for CPaaS ecosystem. The company was formerly known as Tanla Solutions Limited and changed its name to Tanla Platforms Limited in October 2020. Tanla Platforms Limited was incorporated in 1995 and is headquartered in Hyderabad, India."},"city":{"0":"Hyderabad"},"phone":{"0":"91 40 4009 9999"},"website":{"0":"https:\/\/www.tanla.com"},"grossProfits":{"0":7658393000},"totalCash":{"0":8523297792},"totalDebt":{"0":511068992},"totalRevenue":{"0":33891579904},"totalCashPerShare":{"0":62.818},"revenuePerShare":{"0":250.039},"bookValue":{"0":50.189},"priceToBook":{"0":14.235191},"marketCap":{"0":96983728128},"averageVolume":{"0":397627},"fiftyTwoWeekHigh":{"0":2096.75},"fiftyTwoWeekLow":{"0":584.5},"logo_url":{"0":"https:\/\/logo.clearbit.com\/tanla.com"}}