{"sector":{"0":"Basic Materials"},"longName":{"0":"Tata Steel Limited"},"fullTimeEmployees":{"0":65000},"longBusinessSummary":{"0":"Tata Steel Limited manufactures and distributes steel products in India and internationally. It operates in Tata Steel India, Tata Steel Long Products, Other Indian Operations, Tata Steel Europe, Other Trade Related Operations, South-East Asian operations, and Rest of the World segments. The company offers hot-rolled (HR) and cold-rolled (CR) coated steel coils and sheets, precision tubes, tire bead wires, spring wires, and bearings, as well as auto ancillaries for the automotive market; and galvanized iron wires, agriculture and garden tools, and conveyance tubes, as well as fencing, farming, and irrigation equipment for the agriculture market. It also provides rebars, steel doors and windows, roofing sheets, plumbing pipes, tubes, prefabricated houses, water kiosks, modular toilets, office cabins, rooftop houses, EV charging stations, rebars and corrosion-resistance steels, cut and bend bars, PC strands, and ground granulated blast furnace slags for individual house builders, corporate and government bodies, infrastructure companies, and housing and commercial customers in the construction market. In addition, the company offers CR, coated, HR, tube, wire rod, ferro chrome and manganese, boiler tube, pipes, ferroshot, blast furnace slag, coal tar, and metallic coated coil and sheet products for use in panels and appliances, fabrication and capital goods, furniture, Liquid Petroleum Gas cylinders, solar, heavy vehicles, consumer and industrial packaging, and welding applications, as well as the process industries, such as cement, power, and steel in the industrial and general engineering markets. The company was incorporated in 1907 and is based in Mumbai, India."},"city":{"0":"Mumbai"},"phone":{"0":"91 22 6665 8282"},"website":{"0":"https:\/\/www.tatasteel.com"},"grossProfits":{"0":1536817200000},"totalCash":{"0":241291001856},"totalDebt":{"0":755613499392},"totalRevenue":{"0":2539238195200},"totalCashPerShare":{"0":19.726},"revenuePerShare":{"0":209.253},"bookValue":{"0":549.901},"priceToBook":{"0":0.20485505},"marketCap":{"0":139887640576},"averageVolume":{"0":43444037},"fiftyTwoWeekHigh":{"0":138.67},"fiftyTwoWeekLow":{"0":82.7},"logo_url":{"0":"https:\/\/logo.clearbit.com\/tatasteel.com"}}