{"sector":{"0":"Communication Services"},"longName":{"0":"Tata Communications Limited"},"fullTimeEmployees":{"0":12348},"longBusinessSummary":{"0":"Tata Communications Limited provides telecommunications services worldwide. The company operates through Voice Solutions, Data and Managed Services, Payment Solutions, Transformation Services, and Real Estate segments. It provides voice and data transmission services; internet connectivity services; and other value-added services, such as unified conferencing and collaboration, managed hosting, mobile global roaming and signaling, transponder lease, and television up-linking, and other managed services, as well as sells and leases bandwidth on undersea cable systems. The company also offers end-to-end automated teller machines deployment, POS enablement, financial inclusion, card issuance and related managed services, and switching services to banking sector; cyber security; data center colocation services; and network management and support services. In addition, it provides networking services, including WAN ethernet, global VPN, and private lines; Internet of Things, smartphone proliferation, and tighter supply chain integration\/automation; and network security, cloud security operations centers, cloud security, and custom solutions. Further, the company offers cloud, hosting, security, and SD-WAN; intelligent routing and on-demand connectivity solutions; media and entertainment services, including gaming, sports, news, cable, broadcasting, asset management, workflow management, channel origination, video contribution and distribution feeds, OTT platform as a service, live OTT delivery, and transcoding as services; and leases premises. It serves service providers and enterprises. The company was formerly known as Videsh Sanchar Nigam Limited and changed its name to Tata Communications Limited in 2008. Tata Communications Limited was incorporated in 1986 and is based in Mumbai, India."},"city":{"0":"Mumbai"},"phone":{"0":"91 22 6659 1968"},"website":{"0":"https:\/\/www.tatacommunications.com"},"grossProfits":{"0":58126400000},"totalCash":{"0":13546800128},"totalDebt":{"0":88394997760},"totalRevenue":{"0":171891802112},"totalCashPerShare":{"0":47.541},"revenuePerShare":{"0":603.106},"bookValue":{"0":4.051},"priceToBook":{"0":314.60132},"marketCap":{"0":363218239488},"averageVolume":{"0":507728},"fiftyTwoWeekHigh":{"0":1591.95},"fiftyTwoWeekLow":{"0":856.25},"logo_url":{"0":"https:\/\/logo.clearbit.com\/tatacommunications.com"}}