{"sector":{"0":"Consumer Defensive"},"longName":{"0":"Tata Consumer Products Limited"},"fullTimeEmployees":{"0":3000},"longBusinessSummary":{"0":"Tata Consumer Products Limited, together with its subsidiaries, produces and sells tea, coffee, and mineral water in India, Canada, the United States, the United Kingdom, Europe, the Middle East, South Africa, Australia, and internationally. The company operates through Branded Business and Non Branded Business segments. It engages in the processing and blending of tea, including the manufacture of instant tea. The company's products include food ingredients and sweeteners, salt, pulses, spices, ready-to-drink and ready-to-eat products, poha, flour, snacks, besan, cereals, ready-to-cook products, glucose-based ready-to-serve drinks, dry fruits, natural mineral water, packaged drinking water, functional beverages, and other packaged foods. It operates cafes under the Tata Cha brand. Tata Consumer Products Limited offers its products primarily under the Tata Tea, Tata Coffee Grand, Tata Water Plus, Tata Gluco Plus, Tata Fruski, Tetley, Tata Tea 1868, Teapigs, Vitax, Laager, Good Earth, Eight O'Clock Coffee, Himalayan, Tata Coffee Grand, and Joekels brands, as well as Tata Salt, Tata Soulfull, Tata Sampann, Sonnets by Tata Coffee, Tata Starbucks, Good Earth Kombucha, and Tata Q brands. The company was formerly known as Tata Global Beverages Limited and changed its name to Tata Consumer Products Limited in February 2020. Tata Consumer Products Limited was incorporated in 1962 and is headquartered in Mumbai, India."},"city":{"0":"Mumbai"},"phone":{"0":"91 22 6121 8400"},"website":{"0":"https:\/\/www.tataconsumer.com"},"grossProfits":{"0":52448800000},"totalCash":{"0":21066700800},"totalDebt":{"0":12944199680},"totalRevenue":{"0":130736701440},"totalCashPerShare":{"0":22.859},"revenuePerShare":{"0":141.823},"bookValue":{"0":153.165},"priceToBook":{"0":5.007345},"marketCap":{"0":715297456128},"averageVolume":{"0":1359094},"fiftyTwoWeekHigh":{"0":861.15},"fiftyTwoWeekLow":{"0":650.2},"logo_url":{"0":"https:\/\/logo.clearbit.com\/tataconsumer.com"}}