{"sector":{"0":"Basic Materials"},"longName":{"0":"Tata Chemicals Limited"},"fullTimeEmployees":{"0":4642},"longBusinessSummary":{"0":"Tata Chemicals Limited manufactures, sells, and distributes basic chemistry and specialty products in India, Europe, Africa, the United States, rest of Asia, and internationally. It offers dense and light soda ash; crushed refined soda; Portland and masonry cement under the Tata Shudh brand name; salt; pharmaceutical grade, food grade, and animal feed grade sodium bicarbonate, as well as technical and refined grade sodium bicarbonate; and allied chemicals, such as caustic soda, bromine-based products, and gypsum, as well as marine chemicals and nutrition solutions. In addition, it offers specialty products, including nano zinc oxides for various industrial and cosmetic applications; and silica. Further, the company provides fungicides, insecticides, pesticides, herbicides, plant growth nutrients, crop protection solutions, and seeds, as well as agri-input solutions; and runs farmer connect initiative under the Rallis Kisan Kutumb name. Its products are used in various industrial applications, such as agriculture; animal nutrition; chemicals; construction; food and nutrition; glass; high performance rubber; metals; oral care and cosmetics; paints, inks, and adhesives; pharmaceuticals; safety and environmen; soaps and detergents; textiles and leather; lithium-ion, dry cell, and other batteries; and others. Tata Chemicals Limited was founded in 1927 and is based in Mumbai, India."},"city":{"0":"Mumbai"},"phone":{"0":"91 22 6665 8282"},"website":{"0":"https:\/\/www.tatachemicals.com"},"grossProfits":{"0":95370300000},"totalCash":{"0":26157099008},"totalDebt":{"0":70388498432},"totalRevenue":{"0":136391196672},"totalCashPerShare":{"0":102.675},"revenuePerShare":{"0":535.437},"bookValue":{"0":558.487},"priceToBook":{"0":1.6780158},"marketCap":{"0":238744584192},"averageVolume":{"0":1416162},"fiftyTwoWeekHigh":{"0":1214.9},"fiftyTwoWeekLow":{"0":773.35},"logo_url":{"0":"https:\/\/logo.clearbit.com\/tatachemicals.com"}}