{"sector":{"0":"Technology"},"longName":{"0":"Tata Consultancy Services Limited"},"fullTimeEmployees":{"0":616171},"longBusinessSummary":{"0":"Tata Consultancy Services Limited provides information technology (IT) and IT enabled services worldwide. The company operates through Banking, Financial Services and Insurance; Manufacturing; Retail and Consumer Business; Communication, Media and Technology; Life Sciences and Healthcare; and Others segments. It offers CHROMA, a cloud-based talent management solution; ignio, a cognitive automation software; TCS iON, an assessment platform; TAP, a procurement offering; TCS MasterCraft, a platform to automate and manage IT processes; Quartz, a blockchain solution; and TCS OmniStore, a commerce platform. The company also provides customer intelligence and insight solutions; Intelligent Urban Exchange, a smart city solution; OPTUMERA, a merchandise optimization platform; TwinX, an AI powered system of actionable intelligence for business leaders to simulate and optimize enterprise decisions; TCS BaNCS, a financial platform; and Jile, an agile DevOps platform. In addition, it offers drug development and connected intelligent platforms; ERP on cloud, an enterprise solution; and HOBS, a platform for subscription based digital business. Further, the company provides cognitive business, consulting, analytics and insights, automation and artificial intelligence, Internet of Things, cloud, blockchain, cyber security, interactive, digital and quality engineering, sustainability, and enterprise application services. It serves banking, financial, and public services; capital market; consumer goods and distribution; education; insurance; life sciences and healthcare; manufacturing, retail; hi-tech; travel, transportation, and hospitality industries; communications, media, and technology industries; and energy, resource, and utility industries. Further, the company has collaboration with Microsoft to build autonomous solutions. The company was founded in 1968 and is headquartered in Mumbai, India. Tata Consultancy Services Limited is a subsidiary of Tata Sons Private Limited."},"city":{"0":"Mumbai"},"phone":{"0":"91 22 6778 9595"},"website":{"0":"https:\/\/www.tcs.com"},"grossProfits":{"0":830370000000},"totalCash":{"0":483289989120},"totalDebt":{"0":74599997440},"totalRevenue":{"0":2075429961728},"totalCashPerShare":{"0":132.081},"revenuePerShare":{"0":564.155},"bookValue":{"0":233.603},"priceToBook":{"0":13.941174},"marketCap":{"0":12046695399424},"averageVolume":{"0":1684407},"fiftyTwoWeekHigh":{"0":4043},"fiftyTwoWeekLow":{"0":2926.1},"logo_url":{"0":"https:\/\/logo.clearbit.com\/tcs.com"}}