{"sector":{"0":"Technology"},"longName":{"0":"Tech Mahindra Limited"},"fullTimeEmployees":{"0":158035},"longBusinessSummary":{"0":"Tech Mahindra Limited provides information technology (IT) services and solutions in the Americas, Europe, India, and internationally. The company operates through IT Business and Business Processing Outsourcing (BPO) segments. It offers IT outsourcing, consulting, application outsourcing, network, infrastructure outsourcing, integrated engineering, BPO, and platform services. The company also provides consulting-led integrated portfolio services to telecom equipment manufacturers and service providers, IT infrastructure service providers, and business process outsourcing service providers; and IT and IT-enabled enterprise solutions. In addition, it offers IT enabled, application development and maintenance, consulting and enterprise business solutions, extended engineering solutions, and infrastructure management services. Further, the company provides data and analytics; IT infrastructure and cloud services; customer experience solutions; enterprise platforms; and enterprise business solutions. Additionally, it offers testing, telecom product engineering, digital supply chain, performance engineering, artificial intelligence, and cyber security services. The company serves communication; banking, financial, and insurance services; energy and utilities; media and entertainment; health life sciences; hi-tech; professional services; manufacturing; retail and consumer goods; travel, transportation, hospitality, and logistics; oil and gas; and public and government sectors. Tech Mahindra Limited was incorporated in 1986 and is based in Pune, India."},"city":{"0":"Pune"},"phone":{"0":"91 20 4225 0000"},"website":{"0":"https:\/\/www.techmahindra.com"},"grossProfits":{"0":148591000000},"totalCash":{"0":82897002496},"totalDebt":{"0":26183999488},"totalRevenue":{"0":471563010048},"totalCashPerShare":{"0":94.459},"revenuePerShare":{"0":535.833},"bookValue":{"0":284.428},"priceToBook":{"0":3.5734878},"marketCap":{"0":986673381376},"averageVolume":{"0":2266236},"fiftyTwoWeekHigh":{"0":1818},"fiftyTwoWeekLow":{"0":943.7},"logo_url":{"0":"https:\/\/logo.clearbit.com\/techmahindra.com"}}