{"sector":{"0":"Technology"},"longName":{"0":"Tejas Networks Limited"},"fullTimeEmployees":{"0":920},"longBusinessSummary":{"0":"Tejas Networks Limited designs, develops, manufactures, and sells optical, data networking, and wireless products to telecommunications and internet service providers, web-scale internet companies, utility and defense companies, and government entities in India and internationally. It offers TJ1400-1 OLT, a pizza box GPON OLT that provides broadband solutions; TJ1400 OLT, a GPON\/XGS-PON based fiber access for FTTH and FTTB services with various end-user ONT devices; and TJ2100N ONT, a series of advanced GPON\/XGS-PON ONT elements designed for optical access networks deployed in FTTH and FTTB formats. The company also provides TJ1400, an ultra-converged broadband designed for cost-optimized delivery of mobile backhaul, broadband access, enterprise, and network modernization; TJ1600, an optical transport platform that enables support of applications and services, including mobile backhaul networks, business connectivity, and broadband and access infrastructure; and TJ1270 MSPP, a multi-service provisioning platform. In addition, it offers TJ1400 products designed for access and aggregation applications in the network. Further, the company provides enterprise Ethernet switches, such as TJ1400P-M1 portfolio of Layer2+ switches; TJ1400P M3 and TJ1400P M2 switching products optimized for LAN and metro applications; TJ1400P access routers; and TJ1400, an aggregation\/core service router. Additionally, it provides TJ1400-7, an ultra-converged broadband access platform, which supports optical transport with multi-service access and LTE; TJ1602W, a 4G\/LTE Macro eNodeB solution on the TJ1600-2 platform; TJ6003W, a 4G\/LTE packet core EPC solution; and TJ5500, a network management system. The company was formerly known as Tejas Networks India Limited and changed its name to Tejas Networks Limited in March 2008. Tejas Networks Limited was incorporated in 2000 and is based in Bengaluru, India."},"city":{"0":"Bengaluru"},"phone":{"0":"91 80 4179 4600"},"website":{"0":"https:\/\/www.tejasnetworks.com"},"grossProfits":{"0":2391900000},"totalCash":{"0":10512600064},"totalDebt":{"0":572800000},"totalRevenue":{"0":5817999872},"totalCashPerShare":{"0":69.326},"revenuePerShare":{"0":44.043},"bookValue":{"0":122.052},"priceToBook":{"0":4.738554},"marketCap":{"0":66016337920},"averageVolume":{"0":694212},"fiftyTwoWeekHigh":{"0":773},"fiftyTwoWeekLow":{"0":360.6},"logo_url":{"0":"https:\/\/logo.clearbit.com\/tejasnetworks.com"}}