{"sector":{"0":"Consumer Cyclical"},"longName":{"0":"Tube Investments of India Limited"},"fullTimeEmployees":{"0":3107},"longBusinessSummary":{"0":"Tube Investments of India Limited manufactures and sells cycles and accessories, steel strips and tubes, and metal formed products in India. It operates through three segments: Cycles and Accessories, Engineering, and Metal Formed Products. The Cycles and Accessories segment offers standard bi-cycles; special bi-cycles, such as alloy bikes; specialty performance bikes; and fitness equipment. It serves customers in the group of kids, adolescent boys and girls, urban adults, and performance cyclists. The Engineering segment manufactures and supplies cold drawn welded tubes, electric resistance welded tubes, and tubular components for automobile applications; large diameter tubes for hydraulic cylinders and off-road applications; and special grade cold rolled steel strips. The Metal Formed Products segment manufactures and supplies sheet metal formed products, industrial chains, fine blanked components, motor casings and agri-blades for the automotive, industrial, railway, and agriculture segments; and roll-formed car doorframes and cold rolled formed sections for railway wagons and passenger coaches. The company also provides power generation and distribution solutions. In addition, the company operates Track & Trail Urban, Track & Trail Sport, and BSA Hercules Rural outlets, as well as trackandtrail.in. The company also exports its bicycles, tubes, and industrial chains to other countries in Asia, Europe, and the Americas. Tube Investments of India Limited was incorporated in 2008 and is based in Chennai, India."},"city":{"0":"Chennai"},"phone":{"0":"91 44 4217 7770"},"website":{"0":"https:\/\/www.tiindia.com"},"grossProfits":{"0":35971200000},"totalCash":{"0":9183500288},"totalDebt":{"0":8709099520},"totalRevenue":{"0":133686697984},"totalCashPerShare":{"0":47.595},"revenuePerShare":{"0":693.331},"bookValue":{"0":94.137},"priceToBook":{"0":29.484156},"marketCap":{"0":535886561280},"averageVolume":{"0":629321},"fiftyTwoWeekHigh":{"0":3046.2},"fiftyTwoWeekLow":{"0":1441.95},"logo_url":{"0":"https:\/\/logo.clearbit.com\/tiindia.com"}}