{"sector":{"0":"Consumer Cyclical"},"longName":{"0":"Titan Company Limited"},"fullTimeEmployees":{"0":7263},"longBusinessSummary":{"0":"Titan Company Limited, together with its subsidiaries, manufactures and sells watches, jewelry, eyewear, and other accessories and products in India and internationally. It operates through four segments: Watches & Wearables, Jewellery, Eyewear, and Others. The company offers watches and accessories under the Titan Edge, Titan Raga, Nebula, Purple, Automatic, Octane, Fastrack, Titan HTSE, Zoop, Sonata, Favre-Leuba, SF, Xylys, and World of Titan. It also provides jewelry products under the Mia, CaratLane, Tanishq, and Zoya brands; and retails watches under the Helios brand. In addition, the company offers optical products under the Titan EyePlus brand, as well as Fastrack and Glares brands. Further, it provides a range of fragrance products under the SKINN brand; and sarees, lehengas, bridal wear, yardages, stoles, and dupattas under the Taneira brand, as well as engages in the precision component manufacturing and designing, and automation machines manufacturing activities for the aerospace and defense industries. The company offers its products through retail stores and dealers, as well as online. As of March 31, 2022, it operated approximately 2,718 stores with approximately 2.8 million square feet of retail space. The company was formerly known as Titan Industries Limited and changed its name to Titan Company Limited in August 2013. Titan Company Limited was incorporated in 1984 and is based in Bengaluru, India."},"city":{"0":"Bengaluru"},"phone":{"0":"91 80 6704 7000"},"website":{"0":"https:\/\/www.titancompany.in"},"grossProfits":{"0":71190000000},"totalCash":{"0":6560000000},"totalDebt":{"0":72749998080},"totalRevenue":{"0":347690008576},"totalCashPerShare":{"0":7.389},"revenuePerShare":{"0":393.976},"bookValue":{"0":84.541},"priceToBook":{"0":30.724737},"marketCap":{"0":2306024144896},"averageVolume":{"0":1077371},"fiftyTwoWeekHigh":{"0":2791},"fiftyTwoWeekLow":{"0":1825.05},"logo_url":{"0":"https:\/\/logo.clearbit.com\/titancompany.in"}}