{"sector":{"0":"Industrials"},"longName":{"0":"Triveni Turbine Limited"},"fullTimeEmployees":{"0":666},"longBusinessSummary":{"0":"Triveni Turbine Limited, together with its subsidiaries, engages in the manufacture and supply of power generating equipment and solutions in India. The company offers back-pressure and condensing steam turbines for a range of pressure and flow applications; American Petroleum Institute (API) compliant steam turbines; and sustainable modularly arranged pressure reducing turbines, as well as spares parts. It is also involved in the provision of various steam turbine service solutions, such as predictive and preventive maintenance, long term service agreements, troubleshooting and health check-up, automation solutions, improvement and restoration, up gradation, modification and conversion package, balance of plant solutions, turnkey solutions, operation and maintenance, high speed balancing, remote monitoring & diagnostic solution, and training programs; and trading of steam turbines and parts. The company's turbines are used in various applications, such as co-generation, combined heat & power generation, waste to energy, captive power generation, and independent power generation. It serves barge mounted and biomass independent power plants (IPPs), carbon black, cement, chemicals and fertilizers, distillery, district heating, food and beverage, municipal solid waste IPPs, oil and gas, palm oil, pulp and paper, steel, sugar, and textile industries. The company also exports its products. Triveni Turbine Limited was incorporated in 1995 and is headquartered in Bengaluru, India."},"city":{"0":"Bengaluru"},"phone":{"0":"91 80 2216 4000"},"website":{"0":"https:\/\/www.triveniturbines.com"},"grossProfits":{"0":3749810000},"totalCash":{"0":7506140160},"totalDebt":{"0":21730000},"totalRevenue":{"0":9272150016},"totalCashPerShare":{"0":23.217},"revenuePerShare":{"0":28.646},"bookValue":{"0":17.978},"priceToBook":{"0":14.476026},"marketCap":{"0":84140122112},"averageVolume":{"0":1021486},"fiftyTwoWeekHigh":{"0":309.35},"fiftyTwoWeekLow":{"0":147.25},"logo_url":{"0":"https:\/\/logo.clearbit.com\/triveniturbines.com"}}