{"sector":{"0":"Consumer Defensive"},"longName":{"0":"Triveni Engineering & Industries Limited"},"fullTimeEmployees":{"0":4180},"longBusinessSummary":{"0":"Triveni Engineering & Industries Limited engages in the sugar and engineering businesses in India and internationally. The company manufactures and sells white crystal sugar for beverages, food, and fast moving consumer goods (FMCG) companies; pharmaceutical companies; and confectionery producers, as well as offers sugar under the Shagun brand. It also sells surplus molasses and bagasse produced as a by-product in the manufacture of sugar; produces ethanol, extra neutral alcohol, rectified spirit, and denatured spirit; and operates a 104.5 MW grid connected co-generation facility. In addition, the company manufactures and sells high-speed gears and gearboxes for gas and steam turbines, compressors, pumps, blowers, and other industry applications; low-speed gearboxes for hydel turbines, steel mills, sugar mills, rubber mixers and extruders, cement mills, thermal plants, plastics, and other industries; and reciprocating compressors, pumps, and marine offerings. Further, it provides diagnostics and troubleshooting support, reverse engineering, replacement solutions, overhauling, on-site training and assistance, upgradation and automation of existing plants, and installation and commissioning services; refurbishment solutions; and health monitoring of gearboxes. Additionally, the company offers water and wastewater management solutions, as well as recycles water; trades in various FMCG; and retails diesel\/petrol. It also develops and manufactures propulsion gearboxes, auxiliary power gas turbines generators, steam turbines, turbo alternator turbines, turbo pumps for the Indian defense forces, as well as steering systems. Triveni Engineering & Industries Limited was incorporated in 1932 and is headquartered in Noida, India."},"city":{"0":"Noida"},"phone":{"0":"91 12 0430 8000"},"website":{"0":"https:\/\/www.trivenigroup.com"},"grossProfits":{"0":14301880000},"totalCash":{"0":238170000},"totalDebt":{"0":15750636544},"totalRevenue":{"0":44798550016},"totalCashPerShare":{"0":0.985},"revenuePerShare":{"0":185.303},"bookValue":{"0":58.771},"priceToBook":{"0":4.796583},"marketCap":{"0":68150734848},"averageVolume":{"0":1166070},"fiftyTwoWeekHigh":{"0":374.5},"fiftyTwoWeekLow":{"0":211.05},"logo_url":{"0":"https:\/\/logo.clearbit.com\/trivenigroup.com"}}