{"sector":{"0":"Communication Services"},"longName":{"0":"Tata Teleservices (Maharashtra) Limited"},"fullTimeEmployees":{"0":367},"longBusinessSummary":{"0":"Tata Teleservices (Maharashtra) Limited provides wireline voice, data, and managed telecom services to enterprise customers in Maharashtra and Goa, India. The company provides its connectivity and communication solutions under the Tata Tele Business Services brand name. It offers cloud and software as a services comprising content delivery network, digital survey, document management, cloud CRM, SmartFlo, fee collection, and live chat services; collaboration services, such as audio and web conferencing, international bridging, and webcasting services; data services, including business broadband, secure cloud connect, hub connect, Tata Tele Wi-Fi, smart VPN, Internet lease line connection, L2 multicast, and leased line; and voice services comprising PRI, centrex, SIP trunk, and SmartOffice, a business connectivity solution. The company also provides Internet of Things solutions comprising asset management, fleet management tracking, school bus tracking, and workforce management solutions; marketing solutions, such as call register, digital survey, hosted OBD and IVR, SMS solutions, and toll-free services; and cyber security solutions comprising email security, endpoint security, multifactor authentication, virtual firewall, and web security solutions. As of March 31, 2021, it had 17,000 kilometers of optical fiber transmission network. The company was incorporated in 1995 and is based in Navi Mumbai, India."},"city":{"0":"Navi Mumbai"},"phone":{"0":"91 22 6661 5111"},"website":{"0":"https:\/\/www.tatateleservices.com"},"grossProfits":{"0":5030000000},"totalCash":{"0":1172000000},"totalDebt":{"0":197938298880},"totalRevenue":{"0":10986500096},"totalCashPerShare":{"0":0.6},"revenuePerShare":{"0":5.619},"bookValue":{"0":-94.286},"priceToBook":{"0":null},"marketCap":{"0":181821538304},"averageVolume":{"0":1445487},"fiftyTwoWeekHigh":{"0":290.15},"fiftyTwoWeekLow":{"0":78.85},"logo_url":{"0":"https:\/\/logo.clearbit.com\/tatateleservices.com"}}