{"sector":{"0":"Consumer Cyclical"},"longName":{"0":"Uflex Limited"},"fullTimeEmployees":{"0":6910},"longBusinessSummary":{"0":"Uflex Limited manufactures and sells flexible packaging products and solutions in India. Its Packaging Films division offers bi-axially oriented polyethylene terephthalate (BOPET) films; bi-axially oriented polypropylene (BOPP) films; cast polypropylene (CPP) films; metallized films; special effects films; and AlOx coated films. The company's Flexible Packaging division provides flexible laminates, pre-formed pouches, flexo printed rolls and bags, laminated woven poly propylene bags, shower proof bags, electron beam and cast n cure packaging products, packing products for pharmaceuticals, flexitubes, hygiene films, modified atmosphere packaging products, and injection moulding products, as well as N-95 masks. Its Aseptic Liquid Packaging division offers packaging materials and filling machines. The company's Chemical division offers laminating adhesives, water based inks and coatings, inks binders, solvent based-specialty coatings, and flexible packaging and other products. Its Engineering division provides packaging and converting machines, as well as specialty products. The company's Printing Cylinders division offers gravure cylinders, flexo plates, and flexo printing sleeves. Its Holography division provides holograms, holographic films, textile value addition products, hot stamping foils, holographic metalized papers and board transfers, and labeling solutions. The company exports its products to the United States, Europe, the Asia Pacific, the Middle East, Africa, and internationally. Uflex Limited was founded in 1983 and is based in Noida, India."},"city":{"0":"Noida"},"phone":{"0":"91 12 0401 2345"},"website":{"0":"https:\/\/www.uflexltd.com"},"grossProfits":{"0":52770294000},"totalCash":{"0":5882699776},"totalDebt":{"0":47866200064},"totalRevenue":{"0":142279802880},"totalCashPerShare":{"0":81.465},"revenuePerShare":{"0":1970.374},"bookValue":{"0":707.511},"priceToBook":{"0":0.79468733},"marketCap":{"0":40616542208},"averageVolume":{"0":103811},"fiftyTwoWeekHigh":{"0":811},"fiftyTwoWeekLow":{"0":431.65},"logo_url":{"0":"https:\/\/logo.clearbit.com\/uflexltd.com"}}