{"sector":{"0":"Basic Materials"},"longName":{"0":"UltraTech Cement Limited"},"fullTimeEmployees":{"0":21942},"longBusinessSummary":{"0":"UltraTech Cement Limited, together with its subsidiaries, manufactures and sells cement and cement related products in India. It offers ordinary Portland cement, Portland blast furnace slag cement, Portland Pozzolana cement, white cement, and white cement-based products; and ready-mix concrete. The company also provides Tile Adhesive polymer under TILEFIXO, FLEX, HIFLEX,MYKROFILL, Seal & Dry water proofing products for kitchen balconies, chajjas, slope roofs, bathrooms, canal linings, swimming pools, and water tanks; Power Grout, an industrial grout for machine foundation, precast elements, and safety vaults; Readi Plast and Super Stucco, a plastering agent for internal and external walls; as well as liquid system for mortar and concrete modifier, repair mortars and concrete under the name of Basekrete and Microkrete. In addition, the company offers bed jointing material for AAC block, Fly Ash Bricks, and concrete blocks, and light weight block for masonry construction, and flooring screeds. Further, the company offers construction products for home builders; and value-added services that include technical advice during concreting, vaastu consultancy, various training programs, and other related services. UltraTech Cement Limited exports its products to the United Arab Emirates, Bahrain, and Sri Lanka. The company was incorporated in 2000 and is based in Mumbai, India. UltraTech Cement Limited operates as a subsidiary of Grasim Industries Limited."},"city":{"0":"Mumbai"},"phone":{"0":"91 22 6691 7800"},"website":{"0":"https:\/\/www.ultratechcement.com"},"grossProfits":{"0":324965800000},"totalCash":{"0":29106900992},"totalDebt":{"0":128762200064},"totalRevenue":{"0":578088796160},"totalCashPerShare":{"0":100.926},"revenuePerShare":{"0":2004.558},"bookValue":{"0":1412.932},"priceToBook":{"0":4.9252543},"marketCap":{"0":2026684153856},"averageVolume":{"0":352535},"fiftyTwoWeekHigh":{"0":7946},"fiftyTwoWeekLow":{"0":5157.05},"logo_url":{"0":"https:\/\/logo.clearbit.com\/ultratechcement.com"}}