{"sector":{"0":"Financial Services"},"longName":{"0":"Union Bank of India"},"fullTimeEmployees":{"0":75201},"longBusinessSummary":{"0":"Union Bank of India provides various banking products and services. It operates through four segments: Treasury Operations, Retail Banking Operations, Corporate and Wholesale Banking, and Other Banking Operations. The company offers savings and current accounts; term and recurring deposits; and demat and online trading accounts. It also provides retail loans, including home, vehicle, education, and personal loans; loans against the property; and loans for pensioners, as well as products and loans for micro, small, and medium enterprises. In addition, the company offers mutual funds, life, non-life, health, and general insurance products, and tax saving deposits; government saving schemes, tax collection services, pension products, and departmentalized ministries accounts; short term, long term, and other credit for agricultural\/SSI\/tertiary sectors; and safe deposit locker and cheque collection services. Further, it provides corporate loans comprising Covid emergency line of credit, trade finance, working capital, lines of credit, project financing, and channel finance; debt structuring\/restructuring, loan syndication, structured finance, mergers and acquisition advisory, and private equity services; cash management, ECGC cover, and foreign exchange services, as well as derivatives; export and import finance services; NRI banking services; and treasury and other products, and remittance services. Additionally, the company offers app, internet, self-service, ATM, and SMS banking services; point of sale terminal and immediate payment services; and combo, debit, credit, gift, prepaid, and payroll cards. As of March 31, 2022, it operated 8,870 branches in India; 3 overseas branches at Hong Kong, Dubai, and Sydney; 1 representative office in Abu Dhabi; and 11,232 ATMs. The company was incorporated in 1919 and is headquartered in Mumbai, India."},"city":{"0":"Mumbai"},"phone":{"0":"91 22 2289 6636"},"website":{"0":"https:\/\/www.unionbankofindia.co.in"},"grossProfits":{"0":249111135000},"totalCash":{"0":783361179648},"totalDebt":{"0":566359097344},"totalRevenue":{"0":252576940032},"totalCashPerShare":{"0":114.614},"revenuePerShare":{"0":36.966},"bookValue":{"0":99.991},"priceToBook":{"0":0.8040724},"marketCap":{"0":549513920512},"averageVolume":{"0":30325478},"fiftyTwoWeekHigh":{"0":96.4},"fiftyTwoWeekLow":{"0":33.5},"logo_url":{"0":"https:\/\/logo.clearbit.com\/unionbankofindia.co.in"}}