{"sector":{"0":"Consumer Cyclical"},"longName":{"0":"UNO Minda Limited"},"fullTimeEmployees":{"0":9881},"longBusinessSummary":{"0":"UNO Minda Limited, together with its subsidiaries, designs, develops, manufactures, and sells auto components in India and internationally. It provides auto electrical parts, including switches, horns, and lighting products. The company's products include switching systems and handle bar solutions for two\/three-wheelers and off-road vehicles; sensors, actuators, and controllers, including start-stop sensors, contact and non-contact type speed sensors, HID ballasts, tire pressure monitoring systems, electronic accelerator pedal modules, and DC-DC converters; and lights for two, three, and four-wheelers, as well as off-road vehicles. It also provides automotive horns for two\/four-wheelers, and off-road and commercial vehicles; trumpet and disc horns; alloy wheels; fuel caps; and LPG\/CNG kits. In addition, the company offers batteries; lamps; general aluminum castings; 2W and 4W switches; HVAC products; wheel covers; car infotainment systems; air filters and canisters; spoilers; EA pads; air ducts; washer bottles; reverse parking sensors and ADAS products; speakers; air bags; steering wheels; body sealing products; hoses; blow moldings; telematics and connected car solutions; alternate fuel systems; cigarette lighter and socket assemblies; seat belts; shifters; and cameras. It sells its products to original equipment manufacturers. The company was formerly known as Minda Industries Limited and changed its name to UNO Minda Limited in July 2022. The company was founded in 1958 and is based in Gurugram, India."},"city":{"0":"Gurugram"},"phone":{"0":"91 12 4229 0427"},"website":{"0":"https:\/\/www.unominda.com"},"grossProfits":{"0":29683600000},"totalCash":{"0":2462899968},"totalDebt":{"0":9437899776},"totalRevenue":{"0":92656402432},"totalCashPerShare":{"0":4.312},"revenuePerShare":{"0":163.103},"bookValue":{"0":null},"priceToBook":{"0":null},"marketCap":{"0":null},"averageVolume":{"0":323815},"fiftyTwoWeekHigh":{"0":622.35},"fiftyTwoWeekLow":{"0":384.475},"logo_url":{"0":"https:\/\/logo.clearbit.com\/unominda.com"}}