{"sector":{"0":"Industrials"},"longName":{"0":"Voltas Limited"},"fullTimeEmployees":{"0":2576},"longBusinessSummary":{"0":"Voltas Limited operates as an air conditioning and engineering company primarily in India, the Middle East, Singapore, and internationally. It operates through three segments: Unitary Cooling Products for Comfort and Commercial Use; Electro-Mechanical Projects and Services; and Engineering Products and Services. The company manufactures, sells, and services cooling appliances and cold storage products, such as air conditioners, air coolers, freezers, visi coolers, water dispensers, variable refrigerant flow, and chillers. It also undertakes electro-mechanical projects, including electrical; heating, ventilation, and air conditioning projects; and plumbing, firefighting, extra low voltage, and specialized activities. In addition, the company provides facilities maintenance and hard services, such as operations and maintenance contracts in various sectors, AMCs, retrofits and energy management, etc. Further, it engages in the provision of water treatment solutions for industrial, oil and gas, and sewage segments; sale and service of capital machinery for textile industry; sale of spares and accessories for textile equipment; and sale of mining and construction equipment. Additionally, the company offers operations and maintenance services for mining and construction industry; manufactures ducts and duct accessories; and undertakes engineering, procurement, and construction projects. It also engages in the drilling, irrigation, and landscaping activities; and construction of water treatment plants. Voltas Limited was incorporated in 1954 and is headquartered in Mumbai, India."},"city":{"0":"Mumbai"},"phone":{"0":"91 22 6665 6666"},"website":{"0":"https:\/\/www.voltas.com"},"grossProfits":{"0":20263700000},"totalCash":{"0":10475400192},"totalDebt":{"0":3608300032},"totalRevenue":{"0":89172500480},"totalCashPerShare":{"0":31.659},"revenuePerShare":{"0":269.504},"bookValue":{"0":132.626},"priceToBook":{"0":6.030868},"marketCap":{"0":264658354176},"averageVolume":{"0":1132476},"fiftyTwoWeekHigh":{"0":1347.65},"fiftyTwoWeekLow":{"0":770},"logo_url":{"0":"https:\/\/logo.clearbit.com\/voltas.com"}}