{"sector":{"0":"Consumer Cyclical"},"longName":{"0":"Welspun India Limited"},"fullTimeEmployees":{"0":26000},"longBusinessSummary":{"0":"Welspun India Limited manufactures and sells home textile products in India, North America, the United Kingdom, Europe, and internationally. It offers solid, yarn-dyed, dobby, and jacquard towels and bath robes; bath rugs\/mats, such as cotton, nylon, PET, and polyester filament-based Drylon and Resilon yarn rugs; and printed nylon and polyester bath mats. The company also provides utility bedding and bed sheet products comprising pillow fillers, mattress pads, and down-alternative filled comforters; and fashion bedding products for the bedroom. In addition, it offers flooring products, including carpet tiles, broadloom carpets and area rugs, and artificial grasses. The company offers its products under the owned and licensed brands, such as Spaces, Welspun, Welspun Flooring, Welspun Health, Spun, The Championships, Wimbledon, Despicable Me, Marvel, Disney, Christy, Living by, Kingsley, WelHome, Welspun Basics, Martha Stewart, ScottLiving, Stay Well, American Cotton, and Wimbledon. Further, it is involved in power generation; home textile product trading; and real estate business. The company was formerly known as Welspun Winilon Silk Mills Pvt. Ltd. and changed its name to Welspun India Limited in 1995. The company was founded in 1985 and is based in Mumbai, India. Welspun India Limited is a subsidiary of Welspun Group Master Trust."},"city":{"0":"Mumbai"},"phone":{"0":"91 22 6613 6000"},"website":{"0":"https:\/\/www.welspunindia.com"},"grossProfits":{"0":41366060000},"totalCash":{"0":9594699776},"totalDebt":{"0":33039499264},"totalRevenue":{"0":90542301184},"totalCashPerShare":{"0":9.856},"revenuePerShare":{"0":91.941},"bookValue":{"0":33.066},"priceToBook":{"0":2.3317},"marketCap":{"0":76179267584},"averageVolume":{"0":1006589},"fiftyTwoWeekHigh":{"0":160},"fiftyTwoWeekLow":{"0":62.2},"logo_url":{"0":"https:\/\/logo.clearbit.com\/welspunindia.com"}}