{"sector":{"0":"Communication Services"},"longName":{"0":"Zee Entertainment Enterprises Limited"},"fullTimeEmployees":{"0":3182},"longBusinessSummary":{"0":"Zee Entertainment Enterprises Limited, together with its subsidiaries, engages in broadcasting satellite television channels. The company broadcasts Hindi entertainment channels, such as Zee TV, Zee TV HD, &tv, &tv HD, Zing, BIG Magic, and Zee Anmol; Hindi movie channels comprising Zee Anmol Cinema, Zee Cinema, Zee Action, Zee Classic, &pictures, and Zee Bollywood, as well as Zee Cinema HD and &pictures HD; and regional entertainment channels, including Zee Marathi, Zee Yuva, Zee Bangla, Zee Tamil, Zee Telegu, Zee Kannada, Zee Sarthak, Big Ganga, Zee Talkies, Zee Bangla Cinema, Zee Cinemalu, Zee Marathi HD, Zee Talkies HD, Zee Telugu HD, and Zee Bangla HD. It also broadcasts Zee Café, Zee Café HD, &privé HD, Zee Studio, &flix, &flix HD, and Zee ETC Bollywood channels; ZEE LIVE and Zee Theatre channels; and ZEE5, India.com, TheHealthSite.com, Bollywoodlife.com, and BGR.in for audiences on digital mediums, as well as broadcasts 39 channels in the international markets. In addition, the company operates as a space selling agent for other satellite television channels; and sells media content, which include programs\/film rights\/feeds\/music rights. It has a library housing of approximately 250,000 hours of television content; and rights to approximately 4,800 movie titles. The company has approximately 1.3 billion viewers in 173 countries worldwide. The company was formerly known as Zee Telefilms Limited and changed its name to Zee Entertainment Enterprises Limited in January 2007. Zee Entertainment Enterprises Limited was incorporated in 1982 and is based in Mumbai, India."},"city":{"0":"Mumbai"},"phone":{"0":"91 22 7106 1234"},"website":{"0":"https:\/\/www.zee.com"},"grossProfits":{"0":32261000000},"totalCash":{"0":12974499840},"totalDebt":{"0":763100032},"totalRevenue":{"0":82600697856},"totalCashPerShare":{"0":13.508},"revenuePerShare":{"0":85.936},"bookValue":{"0":102.365},"priceToBook":{"0":2.3450398},"marketCap":{"0":230571868160},"averageVolume":{"0":8056826},"fiftyTwoWeekHigh":{"0":332.2},"fiftyTwoWeekLow":{"0":200.5},"logo_url":{"0":"https:\/\/logo.clearbit.com\/zee.com"}}