{"sector":{"0":"Healthcare"},"longName":{"0":"Zydus Lifesciences Limited"},"fullTimeEmployees":{"0":23000},"longBusinessSummary":{"0":"Zydus Lifesciences Limited engages in the research, development, production, marketing, distribution, and sale of pharmaceutical products in India, the United States, Europe, Latin America, the Asia Pacific, and Africa. The company operates in Pharmaceuticals and Consumer Products segments. It offers finished dosage human formulations comprising generics, branded generics, and specialty formulations, including biosimilars and vaccines; active pharmaceutical ingredients; consumer wellness products; and products in the therapeutic areas of pain management, neurology, dermatology, liver diseases, and other areas. The company also provides consumer wellness products, such as Complan; EverYuth, a range of skincare products; Nycil; Glucon-D glucose powder; Nutralite; Nutralite Doodhshakti, a portfolio of dairy products; and various other products. In addition, the company offers a pipeline of biological products in the areas of oncology, autoimmune disease, nephrology, ophthalmology, inflammation, rheumatology, hepatology, infectious disease, etc. Further, it engages in the investment, animal health and veterinary, pharmacy retail, and manpower supply and administration activities. The company was formerly known as Cadila Healthcare Limited and changed its name to Zydus Lifesciences Limited in February 2022. Zydus Lifesciences Limited was founded in 1952 and is based in Ahmedabad, India."},"city":{"0":"Ahmedabad"},"phone":{"0":"91 79 7180 0000"},"website":{"0":"https:\/\/www.zyduslife.com"},"grossProfits":{"0":95795000000},"totalCash":{"0":39735001088},"totalDebt":{"0":42210000896},"totalRevenue":{"0":153361006592},"totalCashPerShare":{"0":38.813},"revenuePerShare":{"0":149.756},"bookValue":{"0":null},"priceToBook":{"0":null},"marketCap":{"0":null},"averageVolume":{"0":1282269},"fiftyTwoWeekHigh":{"0":486.85},"fiftyTwoWeekLow":{"0":319},"logo_url":{"0":"https:\/\/logo.clearbit.com\/zyduslife.com"}}